/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const MACH_CORE_FILEHEADER_MAXFILES: u32 = 16;
pub const MACH_CORE_FILEHEADER_NAMELEN: u32 = 16;
pub const MACH_CORE_FILEHEADER_V2_FLAG_LOG_ENCRYPTED_AEA: u32 = 1;
pub const MACH_CORE_FILEHEADER_V2_FLAG_EXISTING_COREFILE_KEY_FORMAT_NIST_P256: u32 = 256;
pub const MACH_CORE_FILEHEADER_V2_FLAG_NEXT_COREFILE_KEY_FORMAT_NIST_P256: u32 = 65536;
pub const MACH_CORE_FILEHEADER_V2_FLAGS_EXISTING_COREFILE_KEY_FORMAT_MASK: u32 = 256;
pub const MACH_CORE_FILEHEADER_V2_FLAGS_NEXT_COREFILE_KEY_FORMAT_MASK: u32 = 65536;
pub const MACH_CORE_DETAILS_V2_FLAG_ENCRYPTED_AEA: u32 = 1;
pub const MACH_CORE_DETAILS_V2_FLAG_COMPRESSED_ZLIB: u32 = 256;
pub const MACH_CORE_DETAILS_V2_FLAG_COMPRESSED_LZ4: u32 = 512;
pub const KOBJECT_DESCRIPTION_LENGTH: u32 = 512;
pub const host_security_MSG_COUNT: u32 = 2;
pub const processor_MSG_COUNT: u32 = 6;
pub const processor_set_MSG_COUNT: u32 = 11;
pub const SYNC_POLICY_FIFO: u32 = 0;
pub const SYNC_POLICY_FIXED_PRIORITY: u32 = 1;
pub const SYNC_POLICY_REVERSED: u32 = 2;
pub const SYNC_POLICY_ORDER_MASK: u32 = 3;
pub const SYNC_POLICY_LIFO: u32 = 2;
pub const task_MSG_COUNT: u32 = 66;
pub const thread_act_MSG_COUNT: u32 = 32;
pub const vm_map_MSG_COUNT: u32 = 33;
pub const mach_port_MSG_COUNT: u32 = 43;
pub const _MACH_INIT_: u32 = 1;
pub const _QUAD_HIGHWORD: u32 = 1;
pub const _QUAD_LOWWORD: u32 = 0;
pub const __DARWIN_LITTLE_ENDIAN: u32 = 1234;
pub const __DARWIN_BIG_ENDIAN: u32 = 4321;
pub const __DARWIN_PDP_ENDIAN: u32 = 3412;
pub const LITTLE_ENDIAN: u32 = 1234;
pub const BIG_ENDIAN: u32 = 4321;
pub const PDP_ENDIAN: u32 = 3412;
pub const __DARWIN_BYTE_ORDER: u32 = 1234;
pub const BYTE_ORDER: u32 = 1234;
pub const NAME_SERVER_SLOT: u32 = 0;
pub const ENVIRONMENT_SLOT: u32 = 1;
pub const SERVICE_SLOT: u32 = 2;
pub const MACH_PORTS_SLOTS_USED: u32 = 3;
pub const mach_host_MSG_COUNT: u32 = 35;
pub const SWITCH_OPTION_NONE: u32 = 0;
pub const SWITCH_OPTION_DEPRESS: u32 = 1;
pub const SWITCH_OPTION_WAIT: u32 = 2;
pub const RPC_SIGBUF_SIZE: u32 = 8;
pub const _MACH_ERROR_: u32 = 1;
pub const code_emask: u32 = 16383;
pub const err_max_system: u32 = 63;
pub const VOUCHER_MACH_MSG_API_VERSION: u32 = 20140205;
pub const DYLD_AOT_IMAGE_KEY_SIZE: u32 = 32;
pub const DYLD_MAX_PROCESS_INFO_NOTIFY_COUNT: u32 = 8;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::std::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::std::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::std::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::std::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::std::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::std::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type uuid_t = __darwin_uuid_t;
pub type uuid_string_t = __darwin_uuid_string_t;
extern "C" {
    pub static UUID_NULL: uuid_t;
}
extern "C" {
    pub fn uuid_clear(uu: *mut ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn uuid_compare(
        uu1: *const ::std::os::raw::c_uchar,
        uu2: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uuid_copy(dst: *mut ::std::os::raw::c_uchar, src: *const ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn uuid_generate(out: *mut ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn uuid_generate_random(out: *mut ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn uuid_generate_time(out: *mut ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn uuid_is_null(uu: *const ::std::os::raw::c_uchar) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uuid_parse(
        in_: *const ::std::os::raw::c_char,
        uu: *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn uuid_unparse(uu: *const ::std::os::raw::c_uchar, out: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn uuid_unparse_lower(uu: *const ::std::os::raw::c_uchar, out: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn uuid_unparse_upper(uu: *const ::std::os::raw::c_uchar, out: *mut ::std::os::raw::c_char);
}
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct accessx_descriptor {
    pub ad_name_offset: ::std::os::raw::c_uint,
    pub ad_flags: ::std::os::raw::c_int,
    pub ad_pad: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of accessx_descriptor"][::std::mem::size_of::<accessx_descriptor>() - 16usize];
    ["Alignment of accessx_descriptor"][::std::mem::align_of::<accessx_descriptor>() - 4usize];
    ["Offset of field: accessx_descriptor::ad_name_offset"]
        [::std::mem::offset_of!(accessx_descriptor, ad_name_offset) - 0usize];
    ["Offset of field: accessx_descriptor::ad_flags"]
        [::std::mem::offset_of!(accessx_descriptor, ad_flags) - 4usize];
    ["Offset of field: accessx_descriptor::ad_pad"]
        [::std::mem::offset_of!(accessx_descriptor, ad_pad) - 8usize];
};
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
extern "C" {
    pub fn getattrlistbulk(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
        arg4: usize,
        arg5: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getattrlistat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
        arg5: usize,
        arg6: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setattrlistat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_void,
        arg4: *mut ::std::os::raw::c_void,
        arg5: usize,
        arg6: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn freadlink(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> isize;
}
pub type uid_t = __darwin_uid_t;
pub type gid_t = __darwin_gid_t;
extern "C" {
    pub fn faccessat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchownat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: uid_t,
        arg4: gid_t,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn linkat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readlinkat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_char,
        arg4: usize,
    ) -> isize;
}
extern "C" {
    pub fn symlinkat(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlinkat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type off_t = __darwin_off_t;
pub type pid_t = __darwin_pid_t;
pub type useconds_t = __darwin_useconds_t;
extern "C" {
    pub fn _exit(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn access(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn alarm(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn chdir(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chown(
        arg1: *const ::std::os::raw::c_char,
        arg2: uid_t,
        arg3: gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn close(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dup(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dup2(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execl(
        __path: *const ::std::os::raw::c_char,
        __arg0: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execle(
        __path: *const ::std::os::raw::c_char,
        __arg0: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execlp(
        __file: *const ::std::os::raw::c_char,
        __arg0: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execv(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execve(
        __file: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execvp(
        __file: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fork() -> pid_t;
}
extern "C" {
    pub fn fpathconf(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn getcwd(arg1: *mut ::std::os::raw::c_char, arg2: usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getegid() -> gid_t;
}
extern "C" {
    pub fn geteuid() -> uid_t;
}
extern "C" {
    pub fn getgid() -> gid_t;
}
extern "C" {
    pub fn getgroups(arg1: ::std::os::raw::c_int, arg2: *mut gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getlogin() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getpgrp() -> pid_t;
}
extern "C" {
    pub fn getpid() -> pid_t;
}
extern "C" {
    pub fn getppid() -> pid_t;
}
extern "C" {
    pub fn getuid() -> uid_t;
}
extern "C" {
    pub fn isatty(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn link(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lseek(arg1: ::std::os::raw::c_int, arg2: off_t, arg3: ::std::os::raw::c_int) -> off_t;
}
extern "C" {
    pub fn pathconf(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn pause() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pipe(arg1: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn read(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
    ) -> isize;
}
extern "C" {
    pub fn rmdir(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setgid(arg1: gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setpgid(arg1: pid_t, arg2: pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsid() -> pid_t;
}
extern "C" {
    pub fn setuid(arg1: uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sleep(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn sysconf(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn tcgetpgrp(arg1: ::std::os::raw::c_int) -> pid_t;
}
extern "C" {
    pub fn tcsetpgrp(arg1: ::std::os::raw::c_int, arg2: pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ttyname(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ttyname_r(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlink(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn write(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __nbyte: usize,
    ) -> isize;
}
extern "C" {
    pub fn confstr(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> usize;
}
extern "C" {
    pub fn getopt(
        arg1: ::std::os::raw::c_int,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn brk(arg1: *const ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn chroot(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn crypt(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn encrypt(arg1: *mut ::std::os::raw::c_char, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn fchdir(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostid() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn getpgid(arg1: pid_t) -> pid_t;
}
extern "C" {
    pub fn getsid(arg1: pid_t) -> pid_t;
}
extern "C" {
    pub fn getdtablesize() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpagesize() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpass(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getwd(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn lchown(
        arg1: *const ::std::os::raw::c_char,
        arg2: uid_t,
        arg3: gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lockf(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: off_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nice(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pread(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbyte: usize,
        __offset: off_t,
    ) -> isize;
}
extern "C" {
    pub fn pwrite(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __nbyte: usize,
        __offset: off_t,
    ) -> isize;
}
extern "C" {
    pub fn sbrk(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn setpgrp() -> pid_t;
}
extern "C" {
    pub fn setregid(arg1: gid_t, arg2: gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setreuid(arg1: uid_t, arg2: uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn swab(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: isize,
    );
}
extern "C" {
    pub fn sync();
}
extern "C" {
    pub fn truncate(arg1: *const ::std::os::raw::c_char, arg2: off_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ualarm(arg1: useconds_t, arg2: useconds_t) -> useconds_t;
}
extern "C" {
    pub fn usleep(arg1: useconds_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfork() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsync(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftruncate(arg1: ::std::os::raw::c_int, arg2: off_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getlogin_r(arg1: *mut ::std::os::raw::c_char, arg2: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchown(arg1: ::std::os::raw::c_int, arg2: uid_t, arg3: gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostname(arg1: *mut ::std::os::raw::c_char, arg2: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readlink(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> isize;
}
extern "C" {
    pub fn setegid(arg1: gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seteuid(arg1: uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn symlink(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__int32_t; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 4usize];
    ["Offset of field: fd_set::fds_bits"][::std::mem::offset_of!(fd_set, fds_bits) - 0usize];
};
extern "C" {
    pub fn __darwin_check_fd_set_overflow(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __darwin_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __darwin_time_t,
    pub tv_usec: __darwin_suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
pub type time_t = __darwin_time_t;
pub type suseconds_t = __darwin_suseconds_t;
pub type sigset_t = __darwin_sigset_t;
extern "C" {
    pub fn pselect(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *const timespec,
        arg6: *const sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn select(
        arg1: ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut fd_set,
        arg4: *mut fd_set,
        arg5: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
pub type dev_t = __darwin_dev_t;
pub type mode_t = __darwin_mode_t;
extern "C" {
    pub fn _Exit(arg1: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn accessx_np(
        arg1: *const accessx_descriptor,
        arg2: usize,
        arg3: *mut ::std::os::raw::c_int,
        arg4: uid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acct(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn add_profil(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: ::std::os::raw::c_ulong,
        arg4: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn endusershell();
}
extern "C" {
    pub fn execvP(
        __file: *const ::std::os::raw::c_char,
        __searchpath: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflagstostr(arg1: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getdomainname(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getgrouplist(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostuuid(
        arg1: *mut ::std::os::raw::c_uchar,
        arg2: *const timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getmode(arg1: *const ::std::os::raw::c_void, arg2: mode_t) -> mode_t;
}
extern "C" {
    pub fn getpeereid(
        arg1: ::std::os::raw::c_int,
        arg2: *mut uid_t,
        arg3: *mut gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsgroups_np(
        arg1: *mut ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getusershell() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getwgroups_np(
        arg1: *mut ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initgroups(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn issetugid() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mknod(
        arg1: *const ::std::os::raw::c_char,
        arg2: mode_t,
        arg3: dev_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkpath_np(path: *const ::std::os::raw::c_char, omode: mode_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkpathat_np(
        dfd: ::std::os::raw::c_int,
        path: *const ::std::os::raw::c_char,
        omode: mode_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemp(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkostemp(
        path: *mut ::std::os::raw::c_char,
        oflags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps(
        path: *mut ::std::os::raw::c_char,
        slen: ::std::os::raw::c_int,
        oflags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemp_dprotected_np(
        path: *mut ::std::os::raw::c_char,
        dpclass: ::std::os::raw::c_int,
        dpflags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtempat_np(
        dfd: ::std::os::raw::c_int,
        path: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstempsat_np(
        dfd: ::std::os::raw::c_int,
        path: *mut ::std::os::raw::c_char,
        slen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostempsat_np(
        dfd: ::std::os::raw::c_int,
        path: *mut ::std::os::raw::c_char,
        slen: ::std::os::raw::c_int,
        oflags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nfssvc(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn profil(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: ::std::os::raw::c_ulong,
        arg4: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_setugid_np(arg1: uid_t, arg2: gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pthread_getugid_np(arg1: *mut uid_t, arg2: *mut gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn reboot(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn revoke(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rcmd(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const ::std::os::raw::c_char,
        arg5: *const ::std::os::raw::c_char,
        arg6: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rcmd_af(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const ::std::os::raw::c_char,
        arg5: *const ::std::os::raw::c_char,
        arg6: *mut ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rresvport(arg1: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rresvport_af(
        arg1: *mut ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iruserok(
        arg1: ::std::os::raw::c_ulong,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iruserok_sa(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ruserok(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setdomainname(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setgroups(arg1: ::std::os::raw::c_int, arg2: *const gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sethostid(arg1: ::std::os::raw::c_long);
}
extern "C" {
    pub fn sethostname(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setkey(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn setlogin(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setmode(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn setrgid(arg1: gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setruid(arg1: uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsgroups_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setusershell();
}
extern "C" {
    pub fn setwgroups_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strtofflags(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_ulong,
        arg3: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn swapon(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ttyslot() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn undelete(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unwhiteout(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn valloc(arg1: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn syscall(arg1: ::std::os::raw::c_int, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut suboptarg: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetattrlist(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
        arg4: usize,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetattrlist(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
        arg4: usize,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getattrlist(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
        arg4: usize,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setattrlist(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
        arg4: usize,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exchangedata(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdirentriesattr(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
        arg4: usize,
        arg5: *mut ::std::os::raw::c_uint,
        arg6: *mut ::std::os::raw::c_uint,
        arg7: *mut ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fssearchblock {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct searchstate {
    _unused: [u8; 0],
}
extern "C" {
    pub fn searchfs(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut fssearchblock,
        arg3: *mut ::std::os::raw::c_ulong,
        arg4: ::std::os::raw::c_uint,
        arg5: ::std::os::raw::c_uint,
        arg6: *mut searchstate,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsctl(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
        arg3: *mut ::std::os::raw::c_void,
        arg4: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsctl(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_ulong,
        arg3: *mut ::std::os::raw::c_void,
        arg4: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsync_volume_np(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sync_volume_np(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optreset: ::std::os::raw::c_int;
}
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type boolean_t = ::std::os::raw::c_int;
pub type kern_return_t = ::std::os::raw::c_int;
pub type natural_t = __darwin_natural_t;
pub type integer_t = ::std::os::raw::c_int;
pub type vm_offset_t = usize;
pub type vm_size_t = usize;
pub type mach_vm_address_t = u64;
pub type mach_vm_offset_t = u64;
pub type mach_vm_size_t = u64;
pub type vm_map_offset_t = u64;
pub type vm_map_address_t = u64;
pub type vm_map_size_t = u64;
pub type vm32_offset_t = u32;
pub type vm32_address_t = u32;
pub type vm32_size_t = u32;
pub type mach_port_context_t = vm_offset_t;
pub type mach_port_name_t = natural_t;
pub type mach_port_name_array_t = *mut mach_port_name_t;
pub type mach_port_t = __darwin_mach_port_t;
pub type mach_port_array_t = *mut mach_port_t;
pub type mach_port_right_t = natural_t;
pub type mach_port_type_t = natural_t;
pub type mach_port_type_array_t = *mut mach_port_type_t;
pub type mach_port_urefs_t = natural_t;
pub type mach_port_delta_t = integer_t;
pub type mach_port_seqno_t = natural_t;
pub type mach_port_mscount_t = natural_t;
pub type mach_port_msgcount_t = natural_t;
pub type mach_port_rights_t = natural_t;
pub type mach_port_srights_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_port_status {
    pub mps_pset: mach_port_rights_t,
    pub mps_seqno: mach_port_seqno_t,
    pub mps_mscount: mach_port_mscount_t,
    pub mps_qlimit: mach_port_msgcount_t,
    pub mps_msgcount: mach_port_msgcount_t,
    pub mps_sorights: mach_port_rights_t,
    pub mps_srights: boolean_t,
    pub mps_pdrequest: boolean_t,
    pub mps_nsrequest: boolean_t,
    pub mps_flags: natural_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_port_status"][::std::mem::size_of::<mach_port_status>() - 40usize];
    ["Alignment of mach_port_status"][::std::mem::align_of::<mach_port_status>() - 4usize];
    ["Offset of field: mach_port_status::mps_pset"]
        [::std::mem::offset_of!(mach_port_status, mps_pset) - 0usize];
    ["Offset of field: mach_port_status::mps_seqno"]
        [::std::mem::offset_of!(mach_port_status, mps_seqno) - 4usize];
    ["Offset of field: mach_port_status::mps_mscount"]
        [::std::mem::offset_of!(mach_port_status, mps_mscount) - 8usize];
    ["Offset of field: mach_port_status::mps_qlimit"]
        [::std::mem::offset_of!(mach_port_status, mps_qlimit) - 12usize];
    ["Offset of field: mach_port_status::mps_msgcount"]
        [::std::mem::offset_of!(mach_port_status, mps_msgcount) - 16usize];
    ["Offset of field: mach_port_status::mps_sorights"]
        [::std::mem::offset_of!(mach_port_status, mps_sorights) - 20usize];
    ["Offset of field: mach_port_status::mps_srights"]
        [::std::mem::offset_of!(mach_port_status, mps_srights) - 24usize];
    ["Offset of field: mach_port_status::mps_pdrequest"]
        [::std::mem::offset_of!(mach_port_status, mps_pdrequest) - 28usize];
    ["Offset of field: mach_port_status::mps_nsrequest"]
        [::std::mem::offset_of!(mach_port_status, mps_nsrequest) - 32usize];
    ["Offset of field: mach_port_status::mps_flags"]
        [::std::mem::offset_of!(mach_port_status, mps_flags) - 36usize];
};
pub type mach_port_status_t = mach_port_status;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_port_limits {
    pub mpl_qlimit: mach_port_msgcount_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_port_limits"][::std::mem::size_of::<mach_port_limits>() - 4usize];
    ["Alignment of mach_port_limits"][::std::mem::align_of::<mach_port_limits>() - 4usize];
    ["Offset of field: mach_port_limits::mpl_qlimit"]
        [::std::mem::offset_of!(mach_port_limits, mpl_qlimit) - 0usize];
};
pub type mach_port_limits_t = mach_port_limits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_port_info_ext {
    pub mpie_status: mach_port_status_t,
    pub mpie_boost_cnt: mach_port_msgcount_t,
    pub reserved: [u32; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_port_info_ext"][::std::mem::size_of::<mach_port_info_ext>() - 68usize];
    ["Alignment of mach_port_info_ext"][::std::mem::align_of::<mach_port_info_ext>() - 4usize];
    ["Offset of field: mach_port_info_ext::mpie_status"]
        [::std::mem::offset_of!(mach_port_info_ext, mpie_status) - 0usize];
    ["Offset of field: mach_port_info_ext::mpie_boost_cnt"]
        [::std::mem::offset_of!(mach_port_info_ext, mpie_boost_cnt) - 40usize];
    ["Offset of field: mach_port_info_ext::reserved"]
        [::std::mem::offset_of!(mach_port_info_ext, reserved) - 44usize];
};
pub type mach_port_info_ext_t = mach_port_info_ext;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_port_guard_info {
    pub mpgi_guard: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_port_guard_info"][::std::mem::size_of::<mach_port_guard_info>() - 8usize];
    ["Alignment of mach_port_guard_info"][::std::mem::align_of::<mach_port_guard_info>() - 8usize];
    ["Offset of field: mach_port_guard_info::mpgi_guard"]
        [::std::mem::offset_of!(mach_port_guard_info, mpgi_guard) - 0usize];
};
pub type mach_port_guard_info_t = mach_port_guard_info;
pub type mach_port_info_t = *mut integer_t;
pub type mach_port_flavor_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_port_qos {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub len: natural_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_port_qos"][::std::mem::size_of::<mach_port_qos>() - 8usize];
    ["Alignment of mach_port_qos"][::std::mem::align_of::<mach_port_qos>() - 4usize];
    ["Offset of field: mach_port_qos::len"][::std::mem::offset_of!(mach_port_qos, len) - 4usize];
};
impl mach_port_qos {
    #[inline]
    pub fn name(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_name(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn prealloc(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_prealloc(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pad1(&self) -> boolean_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_pad1(&mut self, val: boolean_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        name: ::std::os::raw::c_uint,
        prealloc: ::std::os::raw::c_uint,
        pad1: boolean_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let name: u32 = unsafe { ::std::mem::transmute(name) };
            name as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let prealloc: u32 = unsafe { ::std::mem::transmute(prealloc) };
            prealloc as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let pad1: u32 = unsafe { ::std::mem::transmute(pad1) };
            pad1 as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type mach_port_qos_t = mach_port_qos;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_service_port_info {
    pub mspi_string_name: [::std::os::raw::c_char; 255usize],
    pub mspi_domain_type: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_service_port_info"][::std::mem::size_of::<mach_service_port_info>() - 256usize];
    ["Alignment of mach_service_port_info"]
        [::std::mem::align_of::<mach_service_port_info>() - 1usize];
    ["Offset of field: mach_service_port_info::mspi_string_name"]
        [::std::mem::offset_of!(mach_service_port_info, mspi_string_name) - 0usize];
    ["Offset of field: mach_service_port_info::mspi_domain_type"]
        [::std::mem::offset_of!(mach_service_port_info, mspi_domain_type) - 255usize];
};
pub type mach_service_port_info_data_t = mach_service_port_info;
pub type mach_service_port_info_t = *mut mach_service_port_info;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mach_port_options {
    pub flags: u32,
    pub mpl: mach_port_limits_t,
    pub __bindgen_anon_1: mach_port_options__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mach_port_options__bindgen_ty_1 {
    pub reserved: [u64; 2usize],
    pub work_interval_port: mach_port_name_t,
    pub service_port_info: mach_service_port_info_t,
    pub service_port_name: mach_port_name_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_port_options__bindgen_ty_1"]
        [::std::mem::size_of::<mach_port_options__bindgen_ty_1>() - 16usize];
    ["Alignment of mach_port_options__bindgen_ty_1"]
        [::std::mem::align_of::<mach_port_options__bindgen_ty_1>() - 8usize];
    ["Offset of field: mach_port_options__bindgen_ty_1::reserved"]
        [::std::mem::offset_of!(mach_port_options__bindgen_ty_1, reserved) - 0usize];
    ["Offset of field: mach_port_options__bindgen_ty_1::work_interval_port"]
        [::std::mem::offset_of!(mach_port_options__bindgen_ty_1, work_interval_port) - 0usize];
    ["Offset of field: mach_port_options__bindgen_ty_1::service_port_info"]
        [::std::mem::offset_of!(mach_port_options__bindgen_ty_1, service_port_info) - 0usize];
    ["Offset of field: mach_port_options__bindgen_ty_1::service_port_name"]
        [::std::mem::offset_of!(mach_port_options__bindgen_ty_1, service_port_name) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_port_options"][::std::mem::size_of::<mach_port_options>() - 24usize];
    ["Alignment of mach_port_options"][::std::mem::align_of::<mach_port_options>() - 8usize];
    ["Offset of field: mach_port_options::flags"]
        [::std::mem::offset_of!(mach_port_options, flags) - 0usize];
    ["Offset of field: mach_port_options::mpl"]
        [::std::mem::offset_of!(mach_port_options, mpl) - 4usize];
};
pub type mach_port_options_t = mach_port_options;
pub type mach_port_options_ptr_t = *mut mach_port_options_t;
pub const mach_port_guard_exception_codes_kGUARD_EXC_DESTROY: mach_port_guard_exception_codes = 1;
pub const mach_port_guard_exception_codes_kGUARD_EXC_MOD_REFS: mach_port_guard_exception_codes = 2;
pub const mach_port_guard_exception_codes_kGUARD_EXC_INVALID_OPTIONS:
    mach_port_guard_exception_codes = 3;
pub const mach_port_guard_exception_codes_kGUARD_EXC_SET_CONTEXT: mach_port_guard_exception_codes =
    4;
pub const mach_port_guard_exception_codes_kGUARD_EXC_THREAD_SET_STATE:
    mach_port_guard_exception_codes = 5;
pub const mach_port_guard_exception_codes_kGUARD_EXC_EXCEPTION_BEHAVIOR_ENFORCE:
    mach_port_guard_exception_codes = 6;
pub const mach_port_guard_exception_codes_kGUARD_EXC_UNGUARDED: mach_port_guard_exception_codes = 8;
pub const mach_port_guard_exception_codes_kGUARD_EXC_INCORRECT_GUARD:
    mach_port_guard_exception_codes = 16;
pub const mach_port_guard_exception_codes_kGUARD_EXC_IMMOVABLE: mach_port_guard_exception_codes =
    32;
pub const mach_port_guard_exception_codes_kGUARD_EXC_STRICT_REPLY: mach_port_guard_exception_codes =
    64;
pub const mach_port_guard_exception_codes_kGUARD_EXC_MSG_FILTERED: mach_port_guard_exception_codes =
    128;
pub const mach_port_guard_exception_codes_kGUARD_EXC_INVALID_RIGHT:
    mach_port_guard_exception_codes = 256;
pub const mach_port_guard_exception_codes_kGUARD_EXC_INVALID_NAME: mach_port_guard_exception_codes =
    512;
pub const mach_port_guard_exception_codes_kGUARD_EXC_INVALID_VALUE:
    mach_port_guard_exception_codes = 1024;
pub const mach_port_guard_exception_codes_kGUARD_EXC_INVALID_ARGUMENT:
    mach_port_guard_exception_codes = 2048;
pub const mach_port_guard_exception_codes_kGUARD_EXC_RIGHT_EXISTS: mach_port_guard_exception_codes =
    4096;
pub const mach_port_guard_exception_codes_kGUARD_EXC_KERN_NO_SPACE:
    mach_port_guard_exception_codes = 8192;
pub const mach_port_guard_exception_codes_kGUARD_EXC_KERN_FAILURE: mach_port_guard_exception_codes =
    16384;
pub const mach_port_guard_exception_codes_kGUARD_EXC_KERN_RESOURCE:
    mach_port_guard_exception_codes = 32768;
pub const mach_port_guard_exception_codes_kGUARD_EXC_SEND_INVALID_REPLY:
    mach_port_guard_exception_codes = 65536;
pub const mach_port_guard_exception_codes_kGUARD_EXC_SEND_INVALID_VOUCHER:
    mach_port_guard_exception_codes = 131072;
pub const mach_port_guard_exception_codes_kGUARD_EXC_SEND_INVALID_RIGHT:
    mach_port_guard_exception_codes = 262144;
pub const mach_port_guard_exception_codes_kGUARD_EXC_RCV_INVALID_NAME:
    mach_port_guard_exception_codes = 524288;
pub const mach_port_guard_exception_codes_kGUARD_EXC_RCV_GUARDED_DESC:
    mach_port_guard_exception_codes = 1048576;
pub const mach_port_guard_exception_codes_kGUARD_EXC_MOD_REFS_NON_FATAL:
    mach_port_guard_exception_codes = 2097152;
pub const mach_port_guard_exception_codes_kGUARD_EXC_IMMOVABLE_NON_FATAL:
    mach_port_guard_exception_codes = 4194304;
pub const mach_port_guard_exception_codes_kGUARD_EXC_REQUIRE_REPLY_PORT_SEMANTICS:
    mach_port_guard_exception_codes = 8388608;
pub type mach_port_guard_exception_codes = ::std::os::raw::c_uint;
pub type pointer_t = vm_offset_t;
pub type vm_address_t = vm_offset_t;
pub type addr64_t = u64;
pub type reg64_t = u32;
pub type ppnum_t = u32;
pub type vm_map_t = mach_port_t;
pub type vm_map_read_t = mach_port_t;
pub type vm_map_inspect_t = mach_port_t;
pub type upl_t = mach_port_t;
pub type vm_named_entry_t = mach_port_t;
pub type vm_object_offset_t = u64;
pub type vm_object_size_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_vm_range {
    pub min_address: mach_vm_offset_t,
    pub max_address: mach_vm_offset_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_vm_range"][::std::mem::size_of::<mach_vm_range>() - 16usize];
    ["Alignment of mach_vm_range"][::std::mem::align_of::<mach_vm_range>() - 8usize];
    ["Offset of field: mach_vm_range::min_address"]
        [::std::mem::offset_of!(mach_vm_range, min_address) - 0usize];
    ["Offset of field: mach_vm_range::max_address"]
        [::std::mem::offset_of!(mach_vm_range, max_address) - 8usize];
};
pub type mach_vm_range_t = *mut mach_vm_range;
pub const mach_vm_range_flavor_t_MACH_VM_RANGE_FLAVOR_INVALID: mach_vm_range_flavor_t = 0;
pub const mach_vm_range_flavor_t_MACH_VM_RANGE_FLAVOR_V1: mach_vm_range_flavor_t = 1;
pub type mach_vm_range_flavor_t = u32;
pub const mach_vm_range_flags_t_MACH_VM_RANGE_NONE: mach_vm_range_flags_t = 0;
pub type mach_vm_range_flags_t = u64;
pub const mach_vm_range_tag_t_MACH_VM_RANGE_DEFAULT: mach_vm_range_tag_t = 0;
pub const mach_vm_range_tag_t_MACH_VM_RANGE_DATA: mach_vm_range_tag_t = 1;
pub const mach_vm_range_tag_t_MACH_VM_RANGE_FIXED: mach_vm_range_tag_t = 2;
pub type mach_vm_range_tag_t = u16;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct mach_vm_range_recipe_v1_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
    pub range: mach_vm_range,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_vm_range_recipe_v1_t"]
        [::std::mem::size_of::<mach_vm_range_recipe_v1_t>() - 24usize];
    ["Alignment of mach_vm_range_recipe_v1_t"]
        [::std::mem::align_of::<mach_vm_range_recipe_v1_t>() - 1usize];
    ["Offset of field: mach_vm_range_recipe_v1_t::range"]
        [::std::mem::offset_of!(mach_vm_range_recipe_v1_t, range) - 8usize];
};
impl mach_vm_range_recipe_v1_t {
    #[inline]
    pub fn flags(&self) -> mach_vm_range_flags_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 48u8) as u64) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: mach_vm_range_flags_t) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 48u8, val as u64)
        }
    }
    #[inline]
    pub fn range_tag(&self) -> mach_vm_range_tag_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 8u8) as u16) }
    }
    #[inline]
    pub fn set_range_tag(&mut self, val: mach_vm_range_tag_t) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn vm_tag(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(56usize, 8u8) as u8) }
    }
    #[inline]
    pub fn set_vm_tag(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(56usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        flags: mach_vm_range_flags_t,
        range_tag: mach_vm_range_tag_t,
        vm_tag: u8,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 48u8, {
            let flags: u64 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(48usize, 8u8, {
            let range_tag: u16 = unsafe { ::std::mem::transmute(range_tag) };
            range_tag as u64
        });
        __bindgen_bitfield_unit.set(56usize, 8u8, {
            let vm_tag: u8 = unsafe { ::std::mem::transmute(vm_tag) };
            vm_tag as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type mach_vm_range_recipe_t = mach_vm_range_recipe_v1_t;
pub type mach_vm_range_recipes_raw_t = *mut u8;
pub type rsize_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = f64;
pub type mach_msg_timeout_t = natural_t;
pub type mach_msg_bits_t = ::std::os::raw::c_uint;
pub type mach_msg_size_t = natural_t;
pub type mach_msg_id_t = integer_t;
pub type mach_msg_priority_t = ::std::os::raw::c_uint;
pub type mach_msg_type_name_t = ::std::os::raw::c_uint;
pub type mach_msg_copy_options_t = ::std::os::raw::c_uint;
pub type mach_msg_guard_flags_t = ::std::os::raw::c_uint;
pub type mach_msg_descriptor_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_type_descriptor_t {
    pub pad1: natural_t,
    pub pad2: mach_msg_size_t,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_type_descriptor_t"]
        [::std::mem::size_of::<mach_msg_type_descriptor_t>() - 12usize];
    ["Alignment of mach_msg_type_descriptor_t"]
        [::std::mem::align_of::<mach_msg_type_descriptor_t>() - 4usize];
    ["Offset of field: mach_msg_type_descriptor_t::pad1"]
        [::std::mem::offset_of!(mach_msg_type_descriptor_t, pad1) - 0usize];
    ["Offset of field: mach_msg_type_descriptor_t::pad2"]
        [::std::mem::offset_of!(mach_msg_type_descriptor_t, pad2) - 4usize];
};
impl mach_msg_type_descriptor_t {
    #[inline]
    pub fn pad3(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_pad3(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pad3: ::std::os::raw::c_uint,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 24u8, {
            let pad3: u32 = unsafe { ::std::mem::transmute(pad3) };
            pad3 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_port_descriptor_t {
    pub name: mach_port_t,
    pub pad1: mach_msg_size_t,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_port_descriptor_t"]
        [::std::mem::size_of::<mach_msg_port_descriptor_t>() - 12usize];
    ["Alignment of mach_msg_port_descriptor_t"]
        [::std::mem::align_of::<mach_msg_port_descriptor_t>() - 4usize];
    ["Offset of field: mach_msg_port_descriptor_t::name"]
        [::std::mem::offset_of!(mach_msg_port_descriptor_t, name) - 0usize];
    ["Offset of field: mach_msg_port_descriptor_t::pad1"]
        [::std::mem::offset_of!(mach_msg_port_descriptor_t, pad1) - 4usize];
};
impl mach_msg_port_descriptor_t {
    #[inline]
    pub fn pad2(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_pad2(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pad2: ::std::os::raw::c_uint,
        disposition: mach_msg_type_name_t,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let pad2: u32 = unsafe { ::std::mem::transmute(pad2) };
            pad2 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let disposition: u32 = unsafe { ::std::mem::transmute(disposition) };
            disposition as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_ool_descriptor32_t {
    pub address: u32,
    pub size: mach_msg_size_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_ool_descriptor32_t"]
        [::std::mem::size_of::<mach_msg_ool_descriptor32_t>() - 12usize];
    ["Alignment of mach_msg_ool_descriptor32_t"]
        [::std::mem::align_of::<mach_msg_ool_descriptor32_t>() - 4usize];
    ["Offset of field: mach_msg_ool_descriptor32_t::address"]
        [::std::mem::offset_of!(mach_msg_ool_descriptor32_t, address) - 0usize];
    ["Offset of field: mach_msg_ool_descriptor32_t::size"]
        [::std::mem::offset_of!(mach_msg_ool_descriptor32_t, size) - 4usize];
};
impl mach_msg_ool_descriptor32_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn pad1(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_pad1(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        deallocate: boolean_t,
        copy: mach_msg_copy_options_t,
        pad1: ::std::os::raw::c_uint,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let deallocate: u32 = unsafe { ::std::mem::transmute(deallocate) };
            deallocate as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let copy: u32 = unsafe { ::std::mem::transmute(copy) };
            copy as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let pad1: u32 = unsafe { ::std::mem::transmute(pad1) };
            pad1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_ool_descriptor64_t {
    pub address: u64,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub size: mach_msg_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_ool_descriptor64_t"]
        [::std::mem::size_of::<mach_msg_ool_descriptor64_t>() - 16usize];
    ["Alignment of mach_msg_ool_descriptor64_t"]
        [::std::mem::align_of::<mach_msg_ool_descriptor64_t>() - 4usize];
    ["Offset of field: mach_msg_ool_descriptor64_t::address"]
        [::std::mem::offset_of!(mach_msg_ool_descriptor64_t, address) - 0usize];
    ["Offset of field: mach_msg_ool_descriptor64_t::size"]
        [::std::mem::offset_of!(mach_msg_ool_descriptor64_t, size) - 12usize];
};
impl mach_msg_ool_descriptor64_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn pad1(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_pad1(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        deallocate: boolean_t,
        copy: mach_msg_copy_options_t,
        pad1: ::std::os::raw::c_uint,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let deallocate: u32 = unsafe { ::std::mem::transmute(deallocate) };
            deallocate as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let copy: u32 = unsafe { ::std::mem::transmute(copy) };
            copy as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let pad1: u32 = unsafe { ::std::mem::transmute(pad1) };
            pad1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_ool_descriptor_t {
    pub address: *mut ::std::os::raw::c_void,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub size: mach_msg_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_ool_descriptor_t"]
        [::std::mem::size_of::<mach_msg_ool_descriptor_t>() - 16usize];
    ["Alignment of mach_msg_ool_descriptor_t"]
        [::std::mem::align_of::<mach_msg_ool_descriptor_t>() - 4usize];
    ["Offset of field: mach_msg_ool_descriptor_t::address"]
        [::std::mem::offset_of!(mach_msg_ool_descriptor_t, address) - 0usize];
    ["Offset of field: mach_msg_ool_descriptor_t::size"]
        [::std::mem::offset_of!(mach_msg_ool_descriptor_t, size) - 12usize];
};
impl mach_msg_ool_descriptor_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn pad1(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_pad1(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        deallocate: boolean_t,
        copy: mach_msg_copy_options_t,
        pad1: ::std::os::raw::c_uint,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let deallocate: u32 = unsafe { ::std::mem::transmute(deallocate) };
            deallocate as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let copy: u32 = unsafe { ::std::mem::transmute(copy) };
            copy as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let pad1: u32 = unsafe { ::std::mem::transmute(pad1) };
            pad1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_ool_ports_descriptor32_t {
    pub address: u32,
    pub count: mach_msg_size_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_ool_ports_descriptor32_t"]
        [::std::mem::size_of::<mach_msg_ool_ports_descriptor32_t>() - 12usize];
    ["Alignment of mach_msg_ool_ports_descriptor32_t"]
        [::std::mem::align_of::<mach_msg_ool_ports_descriptor32_t>() - 4usize];
    ["Offset of field: mach_msg_ool_ports_descriptor32_t::address"]
        [::std::mem::offset_of!(mach_msg_ool_ports_descriptor32_t, address) - 0usize];
    ["Offset of field: mach_msg_ool_ports_descriptor32_t::count"]
        [::std::mem::offset_of!(mach_msg_ool_ports_descriptor32_t, count) - 4usize];
};
impl mach_msg_ool_ports_descriptor32_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        deallocate: boolean_t,
        copy: mach_msg_copy_options_t,
        disposition: mach_msg_type_name_t,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let deallocate: u32 = unsafe { ::std::mem::transmute(deallocate) };
            deallocate as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let copy: u32 = unsafe { ::std::mem::transmute(copy) };
            copy as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let disposition: u32 = unsafe { ::std::mem::transmute(disposition) };
            disposition as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_ool_ports_descriptor64_t {
    pub address: u64,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub count: mach_msg_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_ool_ports_descriptor64_t"]
        [::std::mem::size_of::<mach_msg_ool_ports_descriptor64_t>() - 16usize];
    ["Alignment of mach_msg_ool_ports_descriptor64_t"]
        [::std::mem::align_of::<mach_msg_ool_ports_descriptor64_t>() - 4usize];
    ["Offset of field: mach_msg_ool_ports_descriptor64_t::address"]
        [::std::mem::offset_of!(mach_msg_ool_ports_descriptor64_t, address) - 0usize];
    ["Offset of field: mach_msg_ool_ports_descriptor64_t::count"]
        [::std::mem::offset_of!(mach_msg_ool_ports_descriptor64_t, count) - 12usize];
};
impl mach_msg_ool_ports_descriptor64_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        deallocate: boolean_t,
        copy: mach_msg_copy_options_t,
        disposition: mach_msg_type_name_t,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let deallocate: u32 = unsafe { ::std::mem::transmute(deallocate) };
            deallocate as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let copy: u32 = unsafe { ::std::mem::transmute(copy) };
            copy as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let disposition: u32 = unsafe { ::std::mem::transmute(disposition) };
            disposition as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_ool_ports_descriptor_t {
    pub address: *mut ::std::os::raw::c_void,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub count: mach_msg_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_ool_ports_descriptor_t"]
        [::std::mem::size_of::<mach_msg_ool_ports_descriptor_t>() - 16usize];
    ["Alignment of mach_msg_ool_ports_descriptor_t"]
        [::std::mem::align_of::<mach_msg_ool_ports_descriptor_t>() - 4usize];
    ["Offset of field: mach_msg_ool_ports_descriptor_t::address"]
        [::std::mem::offset_of!(mach_msg_ool_ports_descriptor_t, address) - 0usize];
    ["Offset of field: mach_msg_ool_ports_descriptor_t::count"]
        [::std::mem::offset_of!(mach_msg_ool_ports_descriptor_t, count) - 12usize];
};
impl mach_msg_ool_ports_descriptor_t {
    #[inline]
    pub fn deallocate(&self) -> boolean_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_deallocate(&mut self, val: boolean_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn copy(&self) -> mach_msg_copy_options_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_copy(&mut self, val: mach_msg_copy_options_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        deallocate: boolean_t,
        copy: mach_msg_copy_options_t,
        disposition: mach_msg_type_name_t,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let deallocate: u32 = unsafe { ::std::mem::transmute(deallocate) };
            deallocate as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let copy: u32 = unsafe { ::std::mem::transmute(copy) };
            copy as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let disposition: u32 = unsafe { ::std::mem::transmute(disposition) };
            disposition as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_guarded_port_descriptor32_t {
    pub context: u32,
    pub name: mach_port_name_t,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_guarded_port_descriptor32_t"]
        [::std::mem::size_of::<mach_msg_guarded_port_descriptor32_t>() - 12usize];
    ["Alignment of mach_msg_guarded_port_descriptor32_t"]
        [::std::mem::align_of::<mach_msg_guarded_port_descriptor32_t>() - 4usize];
    ["Offset of field: mach_msg_guarded_port_descriptor32_t::context"]
        [::std::mem::offset_of!(mach_msg_guarded_port_descriptor32_t, context) - 0usize];
    ["Offset of field: mach_msg_guarded_port_descriptor32_t::name"]
        [::std::mem::offset_of!(mach_msg_guarded_port_descriptor32_t, name) - 4usize];
};
impl mach_msg_guarded_port_descriptor32_t {
    #[inline]
    pub fn flags(&self) -> mach_msg_guard_flags_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: mach_msg_guard_flags_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        flags: mach_msg_guard_flags_t,
        disposition: mach_msg_type_name_t,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let disposition: u32 = unsafe { ::std::mem::transmute(disposition) };
            disposition as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_guarded_port_descriptor64_t {
    pub context: u64,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub name: mach_port_name_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_guarded_port_descriptor64_t"]
        [::std::mem::size_of::<mach_msg_guarded_port_descriptor64_t>() - 16usize];
    ["Alignment of mach_msg_guarded_port_descriptor64_t"]
        [::std::mem::align_of::<mach_msg_guarded_port_descriptor64_t>() - 4usize];
    ["Offset of field: mach_msg_guarded_port_descriptor64_t::context"]
        [::std::mem::offset_of!(mach_msg_guarded_port_descriptor64_t, context) - 0usize];
    ["Offset of field: mach_msg_guarded_port_descriptor64_t::name"]
        [::std::mem::offset_of!(mach_msg_guarded_port_descriptor64_t, name) - 12usize];
};
impl mach_msg_guarded_port_descriptor64_t {
    #[inline]
    pub fn flags(&self) -> mach_msg_guard_flags_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: mach_msg_guard_flags_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        flags: mach_msg_guard_flags_t,
        disposition: mach_msg_type_name_t,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let disposition: u32 = unsafe { ::std::mem::transmute(disposition) };
            disposition as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_guarded_port_descriptor_t {
    pub context: mach_port_context_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub name: mach_port_name_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_guarded_port_descriptor_t"]
        [::std::mem::size_of::<mach_msg_guarded_port_descriptor_t>() - 16usize];
    ["Alignment of mach_msg_guarded_port_descriptor_t"]
        [::std::mem::align_of::<mach_msg_guarded_port_descriptor_t>() - 4usize];
    ["Offset of field: mach_msg_guarded_port_descriptor_t::context"]
        [::std::mem::offset_of!(mach_msg_guarded_port_descriptor_t, context) - 0usize];
    ["Offset of field: mach_msg_guarded_port_descriptor_t::name"]
        [::std::mem::offset_of!(mach_msg_guarded_port_descriptor_t, name) - 12usize];
};
impl mach_msg_guarded_port_descriptor_t {
    #[inline]
    pub fn flags(&self) -> mach_msg_guard_flags_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_flags(&mut self, val: mach_msg_guard_flags_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn disposition(&self) -> mach_msg_type_name_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_disposition(&mut self, val: mach_msg_type_name_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> mach_msg_descriptor_type_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: mach_msg_descriptor_type_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        flags: mach_msg_guard_flags_t,
        disposition: mach_msg_type_name_t,
        type_: mach_msg_descriptor_type_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let flags: u32 = unsafe { ::std::mem::transmute(flags) };
            flags as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let disposition: u32 = unsafe { ::std::mem::transmute(disposition) };
            disposition as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mach_msg_descriptor_t {
    pub port: mach_msg_port_descriptor_t,
    pub out_of_line: mach_msg_ool_descriptor_t,
    pub ool_ports: mach_msg_ool_ports_descriptor_t,
    pub type_: mach_msg_type_descriptor_t,
    pub guarded_port: mach_msg_guarded_port_descriptor_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_descriptor_t"][::std::mem::size_of::<mach_msg_descriptor_t>() - 16usize];
    ["Alignment of mach_msg_descriptor_t"]
        [::std::mem::align_of::<mach_msg_descriptor_t>() - 4usize];
    ["Offset of field: mach_msg_descriptor_t::port"]
        [::std::mem::offset_of!(mach_msg_descriptor_t, port) - 0usize];
    ["Offset of field: mach_msg_descriptor_t::out_of_line"]
        [::std::mem::offset_of!(mach_msg_descriptor_t, out_of_line) - 0usize];
    ["Offset of field: mach_msg_descriptor_t::ool_ports"]
        [::std::mem::offset_of!(mach_msg_descriptor_t, ool_ports) - 0usize];
    ["Offset of field: mach_msg_descriptor_t::type_"]
        [::std::mem::offset_of!(mach_msg_descriptor_t, type_) - 0usize];
    ["Offset of field: mach_msg_descriptor_t::guarded_port"]
        [::std::mem::offset_of!(mach_msg_descriptor_t, guarded_port) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_body_t {
    pub msgh_descriptor_count: mach_msg_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_body_t"][::std::mem::size_of::<mach_msg_body_t>() - 4usize];
    ["Alignment of mach_msg_body_t"][::std::mem::align_of::<mach_msg_body_t>() - 4usize];
    ["Offset of field: mach_msg_body_t::msgh_descriptor_count"]
        [::std::mem::offset_of!(mach_msg_body_t, msgh_descriptor_count) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_header_t {
    pub msgh_bits: mach_msg_bits_t,
    pub msgh_size: mach_msg_size_t,
    pub msgh_remote_port: mach_port_t,
    pub msgh_local_port: mach_port_t,
    pub msgh_voucher_port: mach_port_name_t,
    pub msgh_id: mach_msg_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_header_t"][::std::mem::size_of::<mach_msg_header_t>() - 24usize];
    ["Alignment of mach_msg_header_t"][::std::mem::align_of::<mach_msg_header_t>() - 4usize];
    ["Offset of field: mach_msg_header_t::msgh_bits"]
        [::std::mem::offset_of!(mach_msg_header_t, msgh_bits) - 0usize];
    ["Offset of field: mach_msg_header_t::msgh_size"]
        [::std::mem::offset_of!(mach_msg_header_t, msgh_size) - 4usize];
    ["Offset of field: mach_msg_header_t::msgh_remote_port"]
        [::std::mem::offset_of!(mach_msg_header_t, msgh_remote_port) - 8usize];
    ["Offset of field: mach_msg_header_t::msgh_local_port"]
        [::std::mem::offset_of!(mach_msg_header_t, msgh_local_port) - 12usize];
    ["Offset of field: mach_msg_header_t::msgh_voucher_port"]
        [::std::mem::offset_of!(mach_msg_header_t, msgh_voucher_port) - 16usize];
    ["Offset of field: mach_msg_header_t::msgh_id"]
        [::std::mem::offset_of!(mach_msg_header_t, msgh_id) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_base_t {
    pub header: mach_msg_header_t,
    pub body: mach_msg_body_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_base_t"][::std::mem::size_of::<mach_msg_base_t>() - 28usize];
    ["Alignment of mach_msg_base_t"][::std::mem::align_of::<mach_msg_base_t>() - 4usize];
    ["Offset of field: mach_msg_base_t::header"]
        [::std::mem::offset_of!(mach_msg_base_t, header) - 0usize];
    ["Offset of field: mach_msg_base_t::body"]
        [::std::mem::offset_of!(mach_msg_base_t, body) - 24usize];
};
pub type mach_msg_trailer_type_t = ::std::os::raw::c_uint;
pub type mach_msg_trailer_size_t = ::std::os::raw::c_uint;
pub type mach_msg_trailer_info_t = *mut ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_trailer_t"][::std::mem::size_of::<mach_msg_trailer_t>() - 8usize];
    ["Alignment of mach_msg_trailer_t"][::std::mem::align_of::<mach_msg_trailer_t>() - 4usize];
    ["Offset of field: mach_msg_trailer_t::msgh_trailer_type"]
        [::std::mem::offset_of!(mach_msg_trailer_t, msgh_trailer_type) - 0usize];
    ["Offset of field: mach_msg_trailer_t::msgh_trailer_size"]
        [::std::mem::offset_of!(mach_msg_trailer_t, msgh_trailer_size) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_seqno_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_seqno_trailer_t"]
        [::std::mem::size_of::<mach_msg_seqno_trailer_t>() - 12usize];
    ["Alignment of mach_msg_seqno_trailer_t"]
        [::std::mem::align_of::<mach_msg_seqno_trailer_t>() - 4usize];
    ["Offset of field: mach_msg_seqno_trailer_t::msgh_trailer_type"]
        [::std::mem::offset_of!(mach_msg_seqno_trailer_t, msgh_trailer_type) - 0usize];
    ["Offset of field: mach_msg_seqno_trailer_t::msgh_trailer_size"]
        [::std::mem::offset_of!(mach_msg_seqno_trailer_t, msgh_trailer_size) - 4usize];
    ["Offset of field: mach_msg_seqno_trailer_t::msgh_seqno"]
        [::std::mem::offset_of!(mach_msg_seqno_trailer_t, msgh_seqno) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct security_token_t {
    pub val: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of security_token_t"][::std::mem::size_of::<security_token_t>() - 8usize];
    ["Alignment of security_token_t"][::std::mem::align_of::<security_token_t>() - 4usize];
    ["Offset of field: security_token_t::val"]
        [::std::mem::offset_of!(security_token_t, val) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_security_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
    pub msgh_sender: security_token_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_security_trailer_t"]
        [::std::mem::size_of::<mach_msg_security_trailer_t>() - 20usize];
    ["Alignment of mach_msg_security_trailer_t"]
        [::std::mem::align_of::<mach_msg_security_trailer_t>() - 4usize];
    ["Offset of field: mach_msg_security_trailer_t::msgh_trailer_type"]
        [::std::mem::offset_of!(mach_msg_security_trailer_t, msgh_trailer_type) - 0usize];
    ["Offset of field: mach_msg_security_trailer_t::msgh_trailer_size"]
        [::std::mem::offset_of!(mach_msg_security_trailer_t, msgh_trailer_size) - 4usize];
    ["Offset of field: mach_msg_security_trailer_t::msgh_seqno"]
        [::std::mem::offset_of!(mach_msg_security_trailer_t, msgh_seqno) - 8usize];
    ["Offset of field: mach_msg_security_trailer_t::msgh_sender"]
        [::std::mem::offset_of!(mach_msg_security_trailer_t, msgh_sender) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct audit_token_t {
    pub val: [::std::os::raw::c_uint; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of audit_token_t"][::std::mem::size_of::<audit_token_t>() - 32usize];
    ["Alignment of audit_token_t"][::std::mem::align_of::<audit_token_t>() - 4usize];
    ["Offset of field: audit_token_t::val"][::std::mem::offset_of!(audit_token_t, val) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_audit_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
    pub msgh_sender: security_token_t,
    pub msgh_audit: audit_token_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_audit_trailer_t"]
        [::std::mem::size_of::<mach_msg_audit_trailer_t>() - 52usize];
    ["Alignment of mach_msg_audit_trailer_t"]
        [::std::mem::align_of::<mach_msg_audit_trailer_t>() - 4usize];
    ["Offset of field: mach_msg_audit_trailer_t::msgh_trailer_type"]
        [::std::mem::offset_of!(mach_msg_audit_trailer_t, msgh_trailer_type) - 0usize];
    ["Offset of field: mach_msg_audit_trailer_t::msgh_trailer_size"]
        [::std::mem::offset_of!(mach_msg_audit_trailer_t, msgh_trailer_size) - 4usize];
    ["Offset of field: mach_msg_audit_trailer_t::msgh_seqno"]
        [::std::mem::offset_of!(mach_msg_audit_trailer_t, msgh_seqno) - 8usize];
    ["Offset of field: mach_msg_audit_trailer_t::msgh_sender"]
        [::std::mem::offset_of!(mach_msg_audit_trailer_t, msgh_sender) - 12usize];
    ["Offset of field: mach_msg_audit_trailer_t::msgh_audit"]
        [::std::mem::offset_of!(mach_msg_audit_trailer_t, msgh_audit) - 20usize];
};
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_context_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
    pub msgh_sender: security_token_t,
    pub msgh_audit: audit_token_t,
    pub msgh_context: mach_port_context_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_context_trailer_t"]
        [::std::mem::size_of::<mach_msg_context_trailer_t>() - 60usize];
    ["Alignment of mach_msg_context_trailer_t"]
        [::std::mem::align_of::<mach_msg_context_trailer_t>() - 4usize];
    ["Offset of field: mach_msg_context_trailer_t::msgh_trailer_type"]
        [::std::mem::offset_of!(mach_msg_context_trailer_t, msgh_trailer_type) - 0usize];
    ["Offset of field: mach_msg_context_trailer_t::msgh_trailer_size"]
        [::std::mem::offset_of!(mach_msg_context_trailer_t, msgh_trailer_size) - 4usize];
    ["Offset of field: mach_msg_context_trailer_t::msgh_seqno"]
        [::std::mem::offset_of!(mach_msg_context_trailer_t, msgh_seqno) - 8usize];
    ["Offset of field: mach_msg_context_trailer_t::msgh_sender"]
        [::std::mem::offset_of!(mach_msg_context_trailer_t, msgh_sender) - 12usize];
    ["Offset of field: mach_msg_context_trailer_t::msgh_audit"]
        [::std::mem::offset_of!(mach_msg_context_trailer_t, msgh_audit) - 20usize];
    ["Offset of field: mach_msg_context_trailer_t::msgh_context"]
        [::std::mem::offset_of!(mach_msg_context_trailer_t, msgh_context) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msg_labels_t {
    pub sender: mach_port_name_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msg_labels_t"][::std::mem::size_of::<msg_labels_t>() - 4usize];
    ["Alignment of msg_labels_t"][::std::mem::align_of::<msg_labels_t>() - 4usize];
    ["Offset of field: msg_labels_t::sender"]
        [::std::mem::offset_of!(msg_labels_t, sender) - 0usize];
};
pub type mach_msg_filter_id = ::std::os::raw::c_int;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_mac_trailer_t {
    pub msgh_trailer_type: mach_msg_trailer_type_t,
    pub msgh_trailer_size: mach_msg_trailer_size_t,
    pub msgh_seqno: mach_port_seqno_t,
    pub msgh_sender: security_token_t,
    pub msgh_audit: audit_token_t,
    pub msgh_context: mach_port_context_t,
    pub msgh_ad: mach_msg_filter_id,
    pub msgh_labels: msg_labels_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_mac_trailer_t"][::std::mem::size_of::<mach_msg_mac_trailer_t>() - 68usize];
    ["Alignment of mach_msg_mac_trailer_t"]
        [::std::mem::align_of::<mach_msg_mac_trailer_t>() - 4usize];
    ["Offset of field: mach_msg_mac_trailer_t::msgh_trailer_type"]
        [::std::mem::offset_of!(mach_msg_mac_trailer_t, msgh_trailer_type) - 0usize];
    ["Offset of field: mach_msg_mac_trailer_t::msgh_trailer_size"]
        [::std::mem::offset_of!(mach_msg_mac_trailer_t, msgh_trailer_size) - 4usize];
    ["Offset of field: mach_msg_mac_trailer_t::msgh_seqno"]
        [::std::mem::offset_of!(mach_msg_mac_trailer_t, msgh_seqno) - 8usize];
    ["Offset of field: mach_msg_mac_trailer_t::msgh_sender"]
        [::std::mem::offset_of!(mach_msg_mac_trailer_t, msgh_sender) - 12usize];
    ["Offset of field: mach_msg_mac_trailer_t::msgh_audit"]
        [::std::mem::offset_of!(mach_msg_mac_trailer_t, msgh_audit) - 20usize];
    ["Offset of field: mach_msg_mac_trailer_t::msgh_context"]
        [::std::mem::offset_of!(mach_msg_mac_trailer_t, msgh_context) - 52usize];
    ["Offset of field: mach_msg_mac_trailer_t::msgh_ad"]
        [::std::mem::offset_of!(mach_msg_mac_trailer_t, msgh_ad) - 60usize];
    ["Offset of field: mach_msg_mac_trailer_t::msgh_labels"]
        [::std::mem::offset_of!(mach_msg_mac_trailer_t, msgh_labels) - 64usize];
};
pub type mach_msg_max_trailer_t = mach_msg_mac_trailer_t;
pub type mach_msg_format_0_trailer_t = mach_msg_security_trailer_t;
extern "C" {
    pub static KERNEL_SECURITY_TOKEN: security_token_t;
}
extern "C" {
    pub static KERNEL_AUDIT_TOKEN: audit_token_t;
}
pub type mach_msg_options_t = integer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_empty_send_t {
    pub header: mach_msg_header_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_empty_send_t"][::std::mem::size_of::<mach_msg_empty_send_t>() - 24usize];
    ["Alignment of mach_msg_empty_send_t"]
        [::std::mem::align_of::<mach_msg_empty_send_t>() - 4usize];
    ["Offset of field: mach_msg_empty_send_t::header"]
        [::std::mem::offset_of!(mach_msg_empty_send_t, header) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_msg_empty_rcv_t {
    pub header: mach_msg_header_t,
    pub trailer: mach_msg_trailer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_empty_rcv_t"][::std::mem::size_of::<mach_msg_empty_rcv_t>() - 32usize];
    ["Alignment of mach_msg_empty_rcv_t"][::std::mem::align_of::<mach_msg_empty_rcv_t>() - 4usize];
    ["Offset of field: mach_msg_empty_rcv_t::header"]
        [::std::mem::offset_of!(mach_msg_empty_rcv_t, header) - 0usize];
    ["Offset of field: mach_msg_empty_rcv_t::trailer"]
        [::std::mem::offset_of!(mach_msg_empty_rcv_t, trailer) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union mach_msg_empty_t {
    pub send: mach_msg_empty_send_t,
    pub rcv: mach_msg_empty_rcv_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_msg_empty_t"][::std::mem::size_of::<mach_msg_empty_t>() - 32usize];
    ["Alignment of mach_msg_empty_t"][::std::mem::align_of::<mach_msg_empty_t>() - 4usize];
    ["Offset of field: mach_msg_empty_t::send"]
        [::std::mem::offset_of!(mach_msg_empty_t, send) - 0usize];
    ["Offset of field: mach_msg_empty_t::rcv"]
        [::std::mem::offset_of!(mach_msg_empty_t, rcv) - 0usize];
};
pub type mach_msg_type_size_t = natural_t;
pub type mach_msg_type_number_t = natural_t;
pub type mach_msg_option_t = integer_t;
pub type mach_msg_return_t = kern_return_t;
extern "C" {
    pub fn mach_msg_overwrite(
        msg: *mut mach_msg_header_t,
        option: mach_msg_option_t,
        send_size: mach_msg_size_t,
        rcv_size: mach_msg_size_t,
        rcv_name: mach_port_name_t,
        timeout: mach_msg_timeout_t,
        notify: mach_port_name_t,
        rcv_msg: *mut mach_msg_header_t,
        rcv_limit: mach_msg_size_t,
    ) -> mach_msg_return_t;
}
extern "C" {
    pub fn mach_msg(
        msg: *mut mach_msg_header_t,
        option: mach_msg_option_t,
        send_size: mach_msg_size_t,
        rcv_size: mach_msg_size_t,
        rcv_name: mach_port_name_t,
        timeout: mach_msg_timeout_t,
        notify: mach_port_name_t,
    ) -> mach_msg_return_t;
}
extern "C" {
    pub fn mach_voucher_deallocate(voucher: mach_port_name_t) -> kern_return_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_statistics {
    pub free_count: natural_t,
    pub active_count: natural_t,
    pub inactive_count: natural_t,
    pub wire_count: natural_t,
    pub zero_fill_count: natural_t,
    pub reactivations: natural_t,
    pub pageins: natural_t,
    pub pageouts: natural_t,
    pub faults: natural_t,
    pub cow_faults: natural_t,
    pub lookups: natural_t,
    pub hits: natural_t,
    pub purgeable_count: natural_t,
    pub purges: natural_t,
    pub speculative_count: natural_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_statistics"][::std::mem::size_of::<vm_statistics>() - 60usize];
    ["Alignment of vm_statistics"][::std::mem::align_of::<vm_statistics>() - 4usize];
    ["Offset of field: vm_statistics::free_count"]
        [::std::mem::offset_of!(vm_statistics, free_count) - 0usize];
    ["Offset of field: vm_statistics::active_count"]
        [::std::mem::offset_of!(vm_statistics, active_count) - 4usize];
    ["Offset of field: vm_statistics::inactive_count"]
        [::std::mem::offset_of!(vm_statistics, inactive_count) - 8usize];
    ["Offset of field: vm_statistics::wire_count"]
        [::std::mem::offset_of!(vm_statistics, wire_count) - 12usize];
    ["Offset of field: vm_statistics::zero_fill_count"]
        [::std::mem::offset_of!(vm_statistics, zero_fill_count) - 16usize];
    ["Offset of field: vm_statistics::reactivations"]
        [::std::mem::offset_of!(vm_statistics, reactivations) - 20usize];
    ["Offset of field: vm_statistics::pageins"]
        [::std::mem::offset_of!(vm_statistics, pageins) - 24usize];
    ["Offset of field: vm_statistics::pageouts"]
        [::std::mem::offset_of!(vm_statistics, pageouts) - 28usize];
    ["Offset of field: vm_statistics::faults"]
        [::std::mem::offset_of!(vm_statistics, faults) - 32usize];
    ["Offset of field: vm_statistics::cow_faults"]
        [::std::mem::offset_of!(vm_statistics, cow_faults) - 36usize];
    ["Offset of field: vm_statistics::lookups"]
        [::std::mem::offset_of!(vm_statistics, lookups) - 40usize];
    ["Offset of field: vm_statistics::hits"][::std::mem::offset_of!(vm_statistics, hits) - 44usize];
    ["Offset of field: vm_statistics::purgeable_count"]
        [::std::mem::offset_of!(vm_statistics, purgeable_count) - 48usize];
    ["Offset of field: vm_statistics::purges"]
        [::std::mem::offset_of!(vm_statistics, purges) - 52usize];
    ["Offset of field: vm_statistics::speculative_count"]
        [::std::mem::offset_of!(vm_statistics, speculative_count) - 56usize];
};
pub type vm_statistics_t = *mut vm_statistics;
pub type vm_statistics_data_t = vm_statistics;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_statistics64 {
    pub free_count: natural_t,
    pub active_count: natural_t,
    pub inactive_count: natural_t,
    pub wire_count: natural_t,
    pub zero_fill_count: u64,
    pub reactivations: u64,
    pub pageins: u64,
    pub pageouts: u64,
    pub faults: u64,
    pub cow_faults: u64,
    pub lookups: u64,
    pub hits: u64,
    pub purges: u64,
    pub purgeable_count: natural_t,
    pub speculative_count: natural_t,
    pub decompressions: u64,
    pub compressions: u64,
    pub swapins: u64,
    pub swapouts: u64,
    pub compressor_page_count: natural_t,
    pub throttled_count: natural_t,
    pub external_page_count: natural_t,
    pub internal_page_count: natural_t,
    pub total_uncompressed_pages_in_compressor: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_statistics64"][::std::mem::size_of::<vm_statistics64>() - 152usize];
    ["Alignment of vm_statistics64"][::std::mem::align_of::<vm_statistics64>() - 8usize];
    ["Offset of field: vm_statistics64::free_count"]
        [::std::mem::offset_of!(vm_statistics64, free_count) - 0usize];
    ["Offset of field: vm_statistics64::active_count"]
        [::std::mem::offset_of!(vm_statistics64, active_count) - 4usize];
    ["Offset of field: vm_statistics64::inactive_count"]
        [::std::mem::offset_of!(vm_statistics64, inactive_count) - 8usize];
    ["Offset of field: vm_statistics64::wire_count"]
        [::std::mem::offset_of!(vm_statistics64, wire_count) - 12usize];
    ["Offset of field: vm_statistics64::zero_fill_count"]
        [::std::mem::offset_of!(vm_statistics64, zero_fill_count) - 16usize];
    ["Offset of field: vm_statistics64::reactivations"]
        [::std::mem::offset_of!(vm_statistics64, reactivations) - 24usize];
    ["Offset of field: vm_statistics64::pageins"]
        [::std::mem::offset_of!(vm_statistics64, pageins) - 32usize];
    ["Offset of field: vm_statistics64::pageouts"]
        [::std::mem::offset_of!(vm_statistics64, pageouts) - 40usize];
    ["Offset of field: vm_statistics64::faults"]
        [::std::mem::offset_of!(vm_statistics64, faults) - 48usize];
    ["Offset of field: vm_statistics64::cow_faults"]
        [::std::mem::offset_of!(vm_statistics64, cow_faults) - 56usize];
    ["Offset of field: vm_statistics64::lookups"]
        [::std::mem::offset_of!(vm_statistics64, lookups) - 64usize];
    ["Offset of field: vm_statistics64::hits"]
        [::std::mem::offset_of!(vm_statistics64, hits) - 72usize];
    ["Offset of field: vm_statistics64::purges"]
        [::std::mem::offset_of!(vm_statistics64, purges) - 80usize];
    ["Offset of field: vm_statistics64::purgeable_count"]
        [::std::mem::offset_of!(vm_statistics64, purgeable_count) - 88usize];
    ["Offset of field: vm_statistics64::speculative_count"]
        [::std::mem::offset_of!(vm_statistics64, speculative_count) - 92usize];
    ["Offset of field: vm_statistics64::decompressions"]
        [::std::mem::offset_of!(vm_statistics64, decompressions) - 96usize];
    ["Offset of field: vm_statistics64::compressions"]
        [::std::mem::offset_of!(vm_statistics64, compressions) - 104usize];
    ["Offset of field: vm_statistics64::swapins"]
        [::std::mem::offset_of!(vm_statistics64, swapins) - 112usize];
    ["Offset of field: vm_statistics64::swapouts"]
        [::std::mem::offset_of!(vm_statistics64, swapouts) - 120usize];
    ["Offset of field: vm_statistics64::compressor_page_count"]
        [::std::mem::offset_of!(vm_statistics64, compressor_page_count) - 128usize];
    ["Offset of field: vm_statistics64::throttled_count"]
        [::std::mem::offset_of!(vm_statistics64, throttled_count) - 132usize];
    ["Offset of field: vm_statistics64::external_page_count"]
        [::std::mem::offset_of!(vm_statistics64, external_page_count) - 136usize];
    ["Offset of field: vm_statistics64::internal_page_count"]
        [::std::mem::offset_of!(vm_statistics64, internal_page_count) - 140usize];
    ["Offset of field: vm_statistics64::total_uncompressed_pages_in_compressor"][::std::mem::offset_of!(
        vm_statistics64,
        total_uncompressed_pages_in_compressor
    ) - 144usize];
};
pub type vm_statistics64_t = *mut vm_statistics64;
pub type vm_statistics64_data_t = vm_statistics64;
extern "C" {
    pub fn vm_stats(
        info: *mut ::std::os::raw::c_void,
        count: *mut ::std::os::raw::c_uint,
    ) -> kern_return_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_extmod_statistics {
    pub task_for_pid_count: i64,
    pub task_for_pid_caller_count: i64,
    pub thread_creation_count: i64,
    pub thread_creation_caller_count: i64,
    pub thread_set_state_count: i64,
    pub thread_set_state_caller_count: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_extmod_statistics"][::std::mem::size_of::<vm_extmod_statistics>() - 48usize];
    ["Alignment of vm_extmod_statistics"][::std::mem::align_of::<vm_extmod_statistics>() - 8usize];
    ["Offset of field: vm_extmod_statistics::task_for_pid_count"]
        [::std::mem::offset_of!(vm_extmod_statistics, task_for_pid_count) - 0usize];
    ["Offset of field: vm_extmod_statistics::task_for_pid_caller_count"]
        [::std::mem::offset_of!(vm_extmod_statistics, task_for_pid_caller_count) - 8usize];
    ["Offset of field: vm_extmod_statistics::thread_creation_count"]
        [::std::mem::offset_of!(vm_extmod_statistics, thread_creation_count) - 16usize];
    ["Offset of field: vm_extmod_statistics::thread_creation_caller_count"]
        [::std::mem::offset_of!(vm_extmod_statistics, thread_creation_caller_count) - 24usize];
    ["Offset of field: vm_extmod_statistics::thread_set_state_count"]
        [::std::mem::offset_of!(vm_extmod_statistics, thread_set_state_count) - 32usize];
    ["Offset of field: vm_extmod_statistics::thread_set_state_caller_count"]
        [::std::mem::offset_of!(vm_extmod_statistics, thread_set_state_caller_count) - 40usize];
};
pub type vm_extmod_statistics_t = *mut vm_extmod_statistics;
pub type vm_extmod_statistics_data_t = vm_extmod_statistics;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_purgeable_stat {
    pub count: u64,
    pub size: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_purgeable_stat"][::std::mem::size_of::<vm_purgeable_stat>() - 16usize];
    ["Alignment of vm_purgeable_stat"][::std::mem::align_of::<vm_purgeable_stat>() - 8usize];
    ["Offset of field: vm_purgeable_stat::count"]
        [::std::mem::offset_of!(vm_purgeable_stat, count) - 0usize];
    ["Offset of field: vm_purgeable_stat::size"]
        [::std::mem::offset_of!(vm_purgeable_stat, size) - 8usize];
};
pub type vm_purgeable_stat_t = vm_purgeable_stat;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_purgeable_info {
    pub fifo_data: [vm_purgeable_stat_t; 8usize],
    pub obsolete_data: vm_purgeable_stat_t,
    pub lifo_data: [vm_purgeable_stat_t; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_purgeable_info"][::std::mem::size_of::<vm_purgeable_info>() - 272usize];
    ["Alignment of vm_purgeable_info"][::std::mem::align_of::<vm_purgeable_info>() - 8usize];
    ["Offset of field: vm_purgeable_info::fifo_data"]
        [::std::mem::offset_of!(vm_purgeable_info, fifo_data) - 0usize];
    ["Offset of field: vm_purgeable_info::obsolete_data"]
        [::std::mem::offset_of!(vm_purgeable_info, obsolete_data) - 128usize];
    ["Offset of field: vm_purgeable_info::lifo_data"]
        [::std::mem::offset_of!(vm_purgeable_info, lifo_data) - 144usize];
};
pub type vm_purgeable_info_t = *mut vm_purgeable_info;
pub const virtual_memory_guard_exception_codes_kGUARD_EXC_DEALLOC_GAP:
    virtual_memory_guard_exception_codes = 1;
pub const virtual_memory_guard_exception_codes_kGUARD_EXC_RECLAIM_COPYIO_FAILURE:
    virtual_memory_guard_exception_codes = 2;
pub const virtual_memory_guard_exception_codes_kGUARD_EXC_RECLAIM_INDEX_FAILURE:
    virtual_memory_guard_exception_codes = 4;
pub const virtual_memory_guard_exception_codes_kGUARD_EXC_RECLAIM_DEALLOCATE_FAILURE:
    virtual_memory_guard_exception_codes = 8;
pub type virtual_memory_guard_exception_codes = ::std::os::raw::c_uint;
pub type cpu_type_t = integer_t;
pub type cpu_subtype_t = integer_t;
pub type cpu_threadtype_t = integer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct time_value {
    pub seconds: integer_t,
    pub microseconds: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of time_value"][::std::mem::size_of::<time_value>() - 8usize];
    ["Alignment of time_value"][::std::mem::align_of::<time_value>() - 4usize];
    ["Offset of field: time_value::seconds"][::std::mem::offset_of!(time_value, seconds) - 0usize];
    ["Offset of field: time_value::microseconds"]
        [::std::mem::offset_of!(time_value, microseconds) - 4usize];
};
pub type time_value_t = time_value;
pub type host_info_t = *mut integer_t;
pub type host_info64_t = *mut integer_t;
pub type host_info_data_t = [integer_t; 1024usize];
pub type kernel_version_t = [::std::os::raw::c_char; 512usize];
pub type kernel_boot_info_t = [::std::os::raw::c_char; 4096usize];
pub type host_flavor_t = integer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct host_can_has_debugger_info {
    pub can_has_debugger: boolean_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of host_can_has_debugger_info"]
        [::std::mem::size_of::<host_can_has_debugger_info>() - 4usize];
    ["Alignment of host_can_has_debugger_info"]
        [::std::mem::align_of::<host_can_has_debugger_info>() - 4usize];
    ["Offset of field: host_can_has_debugger_info::can_has_debugger"]
        [::std::mem::offset_of!(host_can_has_debugger_info, can_has_debugger) - 0usize];
};
pub type host_can_has_debugger_info_data_t = host_can_has_debugger_info;
pub type host_can_has_debugger_info_t = *mut host_can_has_debugger_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct host_basic_info {
    pub max_cpus: integer_t,
    pub avail_cpus: integer_t,
    pub memory_size: natural_t,
    pub cpu_type: cpu_type_t,
    pub cpu_subtype: cpu_subtype_t,
    pub cpu_threadtype: cpu_threadtype_t,
    pub physical_cpu: integer_t,
    pub physical_cpu_max: integer_t,
    pub logical_cpu: integer_t,
    pub logical_cpu_max: integer_t,
    pub max_mem: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of host_basic_info"][::std::mem::size_of::<host_basic_info>() - 48usize];
    ["Alignment of host_basic_info"][::std::mem::align_of::<host_basic_info>() - 4usize];
    ["Offset of field: host_basic_info::max_cpus"]
        [::std::mem::offset_of!(host_basic_info, max_cpus) - 0usize];
    ["Offset of field: host_basic_info::avail_cpus"]
        [::std::mem::offset_of!(host_basic_info, avail_cpus) - 4usize];
    ["Offset of field: host_basic_info::memory_size"]
        [::std::mem::offset_of!(host_basic_info, memory_size) - 8usize];
    ["Offset of field: host_basic_info::cpu_type"]
        [::std::mem::offset_of!(host_basic_info, cpu_type) - 12usize];
    ["Offset of field: host_basic_info::cpu_subtype"]
        [::std::mem::offset_of!(host_basic_info, cpu_subtype) - 16usize];
    ["Offset of field: host_basic_info::cpu_threadtype"]
        [::std::mem::offset_of!(host_basic_info, cpu_threadtype) - 20usize];
    ["Offset of field: host_basic_info::physical_cpu"]
        [::std::mem::offset_of!(host_basic_info, physical_cpu) - 24usize];
    ["Offset of field: host_basic_info::physical_cpu_max"]
        [::std::mem::offset_of!(host_basic_info, physical_cpu_max) - 28usize];
    ["Offset of field: host_basic_info::logical_cpu"]
        [::std::mem::offset_of!(host_basic_info, logical_cpu) - 32usize];
    ["Offset of field: host_basic_info::logical_cpu_max"]
        [::std::mem::offset_of!(host_basic_info, logical_cpu_max) - 36usize];
    ["Offset of field: host_basic_info::max_mem"]
        [::std::mem::offset_of!(host_basic_info, max_mem) - 40usize];
};
pub type host_basic_info_data_t = host_basic_info;
pub type host_basic_info_t = *mut host_basic_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct host_sched_info {
    pub min_timeout: integer_t,
    pub min_quantum: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of host_sched_info"][::std::mem::size_of::<host_sched_info>() - 8usize];
    ["Alignment of host_sched_info"][::std::mem::align_of::<host_sched_info>() - 4usize];
    ["Offset of field: host_sched_info::min_timeout"]
        [::std::mem::offset_of!(host_sched_info, min_timeout) - 0usize];
    ["Offset of field: host_sched_info::min_quantum"]
        [::std::mem::offset_of!(host_sched_info, min_quantum) - 4usize];
};
pub type host_sched_info_data_t = host_sched_info;
pub type host_sched_info_t = *mut host_sched_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kernel_resource_sizes {
    pub task: natural_t,
    pub thread: natural_t,
    pub port: natural_t,
    pub memory_region: natural_t,
    pub memory_object: natural_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kernel_resource_sizes"][::std::mem::size_of::<kernel_resource_sizes>() - 20usize];
    ["Alignment of kernel_resource_sizes"]
        [::std::mem::align_of::<kernel_resource_sizes>() - 4usize];
    ["Offset of field: kernel_resource_sizes::task"]
        [::std::mem::offset_of!(kernel_resource_sizes, task) - 0usize];
    ["Offset of field: kernel_resource_sizes::thread"]
        [::std::mem::offset_of!(kernel_resource_sizes, thread) - 4usize];
    ["Offset of field: kernel_resource_sizes::port"]
        [::std::mem::offset_of!(kernel_resource_sizes, port) - 8usize];
    ["Offset of field: kernel_resource_sizes::memory_region"]
        [::std::mem::offset_of!(kernel_resource_sizes, memory_region) - 12usize];
    ["Offset of field: kernel_resource_sizes::memory_object"]
        [::std::mem::offset_of!(kernel_resource_sizes, memory_object) - 16usize];
};
pub type kernel_resource_sizes_data_t = kernel_resource_sizes;
pub type kernel_resource_sizes_t = *mut kernel_resource_sizes;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct host_priority_info {
    pub kernel_priority: integer_t,
    pub system_priority: integer_t,
    pub server_priority: integer_t,
    pub user_priority: integer_t,
    pub depress_priority: integer_t,
    pub idle_priority: integer_t,
    pub minimum_priority: integer_t,
    pub maximum_priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of host_priority_info"][::std::mem::size_of::<host_priority_info>() - 32usize];
    ["Alignment of host_priority_info"][::std::mem::align_of::<host_priority_info>() - 4usize];
    ["Offset of field: host_priority_info::kernel_priority"]
        [::std::mem::offset_of!(host_priority_info, kernel_priority) - 0usize];
    ["Offset of field: host_priority_info::system_priority"]
        [::std::mem::offset_of!(host_priority_info, system_priority) - 4usize];
    ["Offset of field: host_priority_info::server_priority"]
        [::std::mem::offset_of!(host_priority_info, server_priority) - 8usize];
    ["Offset of field: host_priority_info::user_priority"]
        [::std::mem::offset_of!(host_priority_info, user_priority) - 12usize];
    ["Offset of field: host_priority_info::depress_priority"]
        [::std::mem::offset_of!(host_priority_info, depress_priority) - 16usize];
    ["Offset of field: host_priority_info::idle_priority"]
        [::std::mem::offset_of!(host_priority_info, idle_priority) - 20usize];
    ["Offset of field: host_priority_info::minimum_priority"]
        [::std::mem::offset_of!(host_priority_info, minimum_priority) - 24usize];
    ["Offset of field: host_priority_info::maximum_priority"]
        [::std::mem::offset_of!(host_priority_info, maximum_priority) - 28usize];
};
pub type host_priority_info_data_t = host_priority_info;
pub type host_priority_info_t = *mut host_priority_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct host_load_info {
    pub avenrun: [integer_t; 3usize],
    pub mach_factor: [integer_t; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of host_load_info"][::std::mem::size_of::<host_load_info>() - 24usize];
    ["Alignment of host_load_info"][::std::mem::align_of::<host_load_info>() - 4usize];
    ["Offset of field: host_load_info::avenrun"]
        [::std::mem::offset_of!(host_load_info, avenrun) - 0usize];
    ["Offset of field: host_load_info::mach_factor"]
        [::std::mem::offset_of!(host_load_info, mach_factor) - 12usize];
};
pub type host_load_info_data_t = host_load_info;
pub type host_load_info_t = *mut host_load_info;
pub type host_purgable_info_data_t = vm_purgeable_info;
pub type host_purgable_info_t = *mut vm_purgeable_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct host_cpu_load_info {
    pub cpu_ticks: [natural_t; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of host_cpu_load_info"][::std::mem::size_of::<host_cpu_load_info>() - 16usize];
    ["Alignment of host_cpu_load_info"][::std::mem::align_of::<host_cpu_load_info>() - 4usize];
    ["Offset of field: host_cpu_load_info::cpu_ticks"]
        [::std::mem::offset_of!(host_cpu_load_info, cpu_ticks) - 0usize];
};
pub type host_cpu_load_info_data_t = host_cpu_load_info;
pub type host_cpu_load_info_t = *mut host_cpu_load_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct host_preferred_user_arch {
    pub cpu_type: cpu_type_t,
    pub cpu_subtype: cpu_subtype_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of host_preferred_user_arch"]
        [::std::mem::size_of::<host_preferred_user_arch>() - 8usize];
    ["Alignment of host_preferred_user_arch"]
        [::std::mem::align_of::<host_preferred_user_arch>() - 4usize];
    ["Offset of field: host_preferred_user_arch::cpu_type"]
        [::std::mem::offset_of!(host_preferred_user_arch, cpu_type) - 0usize];
    ["Offset of field: host_preferred_user_arch::cpu_subtype"]
        [::std::mem::offset_of!(host_preferred_user_arch, cpu_subtype) - 4usize];
};
pub type host_preferred_user_arch_data_t = host_preferred_user_arch;
pub type host_preferred_user_arch_t = *mut host_preferred_user_arch;
pub type vm_prot_t = ::std::os::raw::c_int;
pub type vm_sync_t = ::std::os::raw::c_uint;
pub type memory_object_offset_t = ::std::os::raw::c_ulonglong;
pub type memory_object_size_t = ::std::os::raw::c_ulonglong;
pub type memory_object_cluster_size_t = natural_t;
pub type memory_object_fault_info_t = *mut natural_t;
pub type vm_object_id_t = ::std::os::raw::c_ulonglong;
pub type memory_object_t = mach_port_t;
pub type memory_object_control_t = mach_port_t;
pub type memory_object_array_t = *mut memory_object_t;
pub type memory_object_name_t = mach_port_t;
pub type memory_object_default_t = mach_port_t;
pub type memory_object_copy_strategy_t = ::std::os::raw::c_int;
pub type memory_object_return_t = ::std::os::raw::c_int;
pub type memory_object_info_t = *mut ::std::os::raw::c_int;
pub type memory_object_flavor_t = ::std::os::raw::c_int;
pub type memory_object_info_data_t = [::std::os::raw::c_int; 1024usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct memory_object_perf_info {
    pub cluster_size: memory_object_cluster_size_t,
    pub may_cache: boolean_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of memory_object_perf_info"][::std::mem::size_of::<memory_object_perf_info>() - 8usize];
    ["Alignment of memory_object_perf_info"]
        [::std::mem::align_of::<memory_object_perf_info>() - 4usize];
    ["Offset of field: memory_object_perf_info::cluster_size"]
        [::std::mem::offset_of!(memory_object_perf_info, cluster_size) - 0usize];
    ["Offset of field: memory_object_perf_info::may_cache"]
        [::std::mem::offset_of!(memory_object_perf_info, may_cache) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct memory_object_attr_info {
    pub copy_strategy: memory_object_copy_strategy_t,
    pub cluster_size: memory_object_cluster_size_t,
    pub may_cache_object: boolean_t,
    pub temporary: boolean_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of memory_object_attr_info"][::std::mem::size_of::<memory_object_attr_info>() - 16usize];
    ["Alignment of memory_object_attr_info"]
        [::std::mem::align_of::<memory_object_attr_info>() - 4usize];
    ["Offset of field: memory_object_attr_info::copy_strategy"]
        [::std::mem::offset_of!(memory_object_attr_info, copy_strategy) - 0usize];
    ["Offset of field: memory_object_attr_info::cluster_size"]
        [::std::mem::offset_of!(memory_object_attr_info, cluster_size) - 4usize];
    ["Offset of field: memory_object_attr_info::may_cache_object"]
        [::std::mem::offset_of!(memory_object_attr_info, may_cache_object) - 8usize];
    ["Offset of field: memory_object_attr_info::temporary"]
        [::std::mem::offset_of!(memory_object_attr_info, temporary) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct memory_object_behave_info {
    pub copy_strategy: memory_object_copy_strategy_t,
    pub temporary: boolean_t,
    pub invalidate: boolean_t,
    pub silent_overwrite: boolean_t,
    pub advisory_pageout: boolean_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of memory_object_behave_info"]
        [::std::mem::size_of::<memory_object_behave_info>() - 20usize];
    ["Alignment of memory_object_behave_info"]
        [::std::mem::align_of::<memory_object_behave_info>() - 4usize];
    ["Offset of field: memory_object_behave_info::copy_strategy"]
        [::std::mem::offset_of!(memory_object_behave_info, copy_strategy) - 0usize];
    ["Offset of field: memory_object_behave_info::temporary"]
        [::std::mem::offset_of!(memory_object_behave_info, temporary) - 4usize];
    ["Offset of field: memory_object_behave_info::invalidate"]
        [::std::mem::offset_of!(memory_object_behave_info, invalidate) - 8usize];
    ["Offset of field: memory_object_behave_info::silent_overwrite"]
        [::std::mem::offset_of!(memory_object_behave_info, silent_overwrite) - 12usize];
    ["Offset of field: memory_object_behave_info::advisory_pageout"]
        [::std::mem::offset_of!(memory_object_behave_info, advisory_pageout) - 16usize];
};
pub type memory_object_behave_info_t = *mut memory_object_behave_info;
pub type memory_object_behave_info_data_t = memory_object_behave_info;
pub type memory_object_perf_info_t = *mut memory_object_perf_info;
pub type memory_object_perf_info_data_t = memory_object_perf_info;
pub type memory_object_attr_info_t = *mut memory_object_attr_info;
pub type memory_object_attr_info_data_t = memory_object_attr_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state {
    pub __exception: __uint32_t,
    pub __fsr: __uint32_t,
    pub __far: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state"]
        [::std::mem::size_of::<__darwin_arm_exception_state>() - 12usize];
    ["Alignment of __darwin_arm_exception_state"]
        [::std::mem::align_of::<__darwin_arm_exception_state>() - 4usize];
    ["Offset of field: __darwin_arm_exception_state::__exception"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __exception) - 0usize];
    ["Offset of field: __darwin_arm_exception_state::__fsr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __fsr) - 4usize];
    ["Offset of field: __darwin_arm_exception_state::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __far) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state64 {
    pub __far: __uint64_t,
    pub __esr: __uint32_t,
    pub __exception: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state64"]
        [::std::mem::size_of::<__darwin_arm_exception_state64>() - 16usize];
    ["Alignment of __darwin_arm_exception_state64"]
        [::std::mem::align_of::<__darwin_arm_exception_state64>() - 8usize];
    ["Offset of field: __darwin_arm_exception_state64::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __far) - 0usize];
    ["Offset of field: __darwin_arm_exception_state64::__esr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __esr) - 8usize];
    ["Offset of field: __darwin_arm_exception_state64::__exception"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __exception) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state64_v2 {
    pub __far: __uint64_t,
    pub __esr: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state64_v2"]
        [::std::mem::size_of::<__darwin_arm_exception_state64_v2>() - 16usize];
    ["Alignment of __darwin_arm_exception_state64_v2"]
        [::std::mem::align_of::<__darwin_arm_exception_state64_v2>() - 8usize];
    ["Offset of field: __darwin_arm_exception_state64_v2::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64_v2, __far) - 0usize];
    ["Offset of field: __darwin_arm_exception_state64_v2::__esr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64_v2, __esr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_thread_state {
    pub __r: [__uint32_t; 13usize],
    pub __sp: __uint32_t,
    pub __lr: __uint32_t,
    pub __pc: __uint32_t,
    pub __cpsr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_thread_state"]
        [::std::mem::size_of::<__darwin_arm_thread_state>() - 68usize];
    ["Alignment of __darwin_arm_thread_state"]
        [::std::mem::align_of::<__darwin_arm_thread_state>() - 4usize];
    ["Offset of field: __darwin_arm_thread_state::__r"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __r) - 0usize];
    ["Offset of field: __darwin_arm_thread_state::__sp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __sp) - 52usize];
    ["Offset of field: __darwin_arm_thread_state::__lr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __lr) - 56usize];
    ["Offset of field: __darwin_arm_thread_state::__pc"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __pc) - 60usize];
    ["Offset of field: __darwin_arm_thread_state::__cpsr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __cpsr) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_thread_state64 {
    pub __x: [__uint64_t; 29usize],
    pub __fp: __uint64_t,
    pub __lr: __uint64_t,
    pub __sp: __uint64_t,
    pub __pc: __uint64_t,
    pub __cpsr: __uint32_t,
    pub __pad: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_thread_state64"]
        [::std::mem::size_of::<__darwin_arm_thread_state64>() - 272usize];
    ["Alignment of __darwin_arm_thread_state64"]
        [::std::mem::align_of::<__darwin_arm_thread_state64>() - 8usize];
    ["Offset of field: __darwin_arm_thread_state64::__x"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __x) - 0usize];
    ["Offset of field: __darwin_arm_thread_state64::__fp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __fp) - 232usize];
    ["Offset of field: __darwin_arm_thread_state64::__lr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __lr) - 240usize];
    ["Offset of field: __darwin_arm_thread_state64::__sp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __sp) - 248usize];
    ["Offset of field: __darwin_arm_thread_state64::__pc"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __pc) - 256usize];
    ["Offset of field: __darwin_arm_thread_state64::__cpsr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __cpsr) - 264usize];
    ["Offset of field: __darwin_arm_thread_state64::__pad"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __pad) - 268usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_vfp_state {
    pub __r: [__uint32_t; 64usize],
    pub __fpscr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_vfp_state"][::std::mem::size_of::<__darwin_arm_vfp_state>() - 260usize];
    ["Alignment of __darwin_arm_vfp_state"]
        [::std::mem::align_of::<__darwin_arm_vfp_state>() - 4usize];
    ["Offset of field: __darwin_arm_vfp_state::__r"]
        [::std::mem::offset_of!(__darwin_arm_vfp_state, __r) - 0usize];
    ["Offset of field: __darwin_arm_vfp_state::__fpscr"]
        [::std::mem::offset_of!(__darwin_arm_vfp_state, __fpscr) - 256usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_neon_state64 {
    pub __v: [__uint128_t; 32usize],
    pub __fpsr: __uint32_t,
    pub __fpcr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_neon_state64"]
        [::std::mem::size_of::<__darwin_arm_neon_state64>() - 528usize];
    ["Alignment of __darwin_arm_neon_state64"]
        [::std::mem::align_of::<__darwin_arm_neon_state64>() - 16usize];
    ["Offset of field: __darwin_arm_neon_state64::__v"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __v) - 0usize];
    ["Offset of field: __darwin_arm_neon_state64::__fpsr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpsr) - 512usize];
    ["Offset of field: __darwin_arm_neon_state64::__fpcr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpcr) - 516usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_neon_state {
    pub __v: [__uint128_t; 16usize],
    pub __fpsr: __uint32_t,
    pub __fpcr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_neon_state"]
        [::std::mem::size_of::<__darwin_arm_neon_state>() - 272usize];
    ["Alignment of __darwin_arm_neon_state"]
        [::std::mem::align_of::<__darwin_arm_neon_state>() - 16usize];
    ["Offset of field: __darwin_arm_neon_state::__v"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __v) - 0usize];
    ["Offset of field: __darwin_arm_neon_state::__fpsr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __fpsr) - 256usize];
    ["Offset of field: __darwin_arm_neon_state::__fpcr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __fpcr) - 260usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __arm_pagein_state {
    pub __pagein_error: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __arm_pagein_state"][::std::mem::size_of::<__arm_pagein_state>() - 4usize];
    ["Alignment of __arm_pagein_state"][::std::mem::align_of::<__arm_pagein_state>() - 4usize];
    ["Offset of field: __arm_pagein_state::__pagein_error"]
        [::std::mem::offset_of!(__arm_pagein_state, __pagein_error) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __arm_legacy_debug_state {
    pub __bvr: [__uint32_t; 16usize],
    pub __bcr: [__uint32_t; 16usize],
    pub __wvr: [__uint32_t; 16usize],
    pub __wcr: [__uint32_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __arm_legacy_debug_state"]
        [::std::mem::size_of::<__arm_legacy_debug_state>() - 256usize];
    ["Alignment of __arm_legacy_debug_state"]
        [::std::mem::align_of::<__arm_legacy_debug_state>() - 4usize];
    ["Offset of field: __arm_legacy_debug_state::__bvr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __bvr) - 0usize];
    ["Offset of field: __arm_legacy_debug_state::__bcr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __bcr) - 64usize];
    ["Offset of field: __arm_legacy_debug_state::__wvr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __wvr) - 128usize];
    ["Offset of field: __arm_legacy_debug_state::__wcr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __wcr) - 192usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_debug_state32 {
    pub __bvr: [__uint32_t; 16usize],
    pub __bcr: [__uint32_t; 16usize],
    pub __wvr: [__uint32_t; 16usize],
    pub __wcr: [__uint32_t; 16usize],
    pub __mdscr_el1: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_debug_state32"]
        [::std::mem::size_of::<__darwin_arm_debug_state32>() - 264usize];
    ["Alignment of __darwin_arm_debug_state32"]
        [::std::mem::align_of::<__darwin_arm_debug_state32>() - 8usize];
    ["Offset of field: __darwin_arm_debug_state32::__bvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __bvr) - 0usize];
    ["Offset of field: __darwin_arm_debug_state32::__bcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __bcr) - 64usize];
    ["Offset of field: __darwin_arm_debug_state32::__wvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __wvr) - 128usize];
    ["Offset of field: __darwin_arm_debug_state32::__wcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __wcr) - 192usize];
    ["Offset of field: __darwin_arm_debug_state32::__mdscr_el1"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __mdscr_el1) - 256usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_debug_state64 {
    pub __bvr: [__uint64_t; 16usize],
    pub __bcr: [__uint64_t; 16usize],
    pub __wvr: [__uint64_t; 16usize],
    pub __wcr: [__uint64_t; 16usize],
    pub __mdscr_el1: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_debug_state64"]
        [::std::mem::size_of::<__darwin_arm_debug_state64>() - 520usize];
    ["Alignment of __darwin_arm_debug_state64"]
        [::std::mem::align_of::<__darwin_arm_debug_state64>() - 8usize];
    ["Offset of field: __darwin_arm_debug_state64::__bvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __bvr) - 0usize];
    ["Offset of field: __darwin_arm_debug_state64::__bcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __bcr) - 128usize];
    ["Offset of field: __darwin_arm_debug_state64::__wvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __wvr) - 256usize];
    ["Offset of field: __darwin_arm_debug_state64::__wcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __wcr) - 384usize];
    ["Offset of field: __darwin_arm_debug_state64::__mdscr_el1"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __mdscr_el1) - 512usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_cpmu_state64 {
    pub __ctrs: [__uint64_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_cpmu_state64"]
        [::std::mem::size_of::<__darwin_arm_cpmu_state64>() - 128usize];
    ["Alignment of __darwin_arm_cpmu_state64"]
        [::std::mem::align_of::<__darwin_arm_cpmu_state64>() - 8usize];
    ["Offset of field: __darwin_arm_cpmu_state64::__ctrs"]
        [::std::mem::offset_of!(__darwin_arm_cpmu_state64, __ctrs) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arm_state_hdr {
    pub flavor: u32,
    pub count: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arm_state_hdr"][::std::mem::size_of::<arm_state_hdr>() - 8usize];
    ["Alignment of arm_state_hdr"][::std::mem::align_of::<arm_state_hdr>() - 4usize];
    ["Offset of field: arm_state_hdr::flavor"]
        [::std::mem::offset_of!(arm_state_hdr, flavor) - 0usize];
    ["Offset of field: arm_state_hdr::count"]
        [::std::mem::offset_of!(arm_state_hdr, count) - 4usize];
};
pub type arm_state_hdr_t = arm_state_hdr;
pub type arm_thread_state_t = __darwin_arm_thread_state;
pub type arm_thread_state32_t = __darwin_arm_thread_state;
pub type arm_thread_state64_t = __darwin_arm_thread_state64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct arm_unified_thread_state {
    pub ash: arm_state_hdr_t,
    pub uts: arm_unified_thread_state__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union arm_unified_thread_state__bindgen_ty_1 {
    pub ts_32: arm_thread_state32_t,
    pub ts_64: arm_thread_state64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arm_unified_thread_state__bindgen_ty_1"]
        [::std::mem::size_of::<arm_unified_thread_state__bindgen_ty_1>() - 272usize];
    ["Alignment of arm_unified_thread_state__bindgen_ty_1"]
        [::std::mem::align_of::<arm_unified_thread_state__bindgen_ty_1>() - 8usize];
    ["Offset of field: arm_unified_thread_state__bindgen_ty_1::ts_32"]
        [::std::mem::offset_of!(arm_unified_thread_state__bindgen_ty_1, ts_32) - 0usize];
    ["Offset of field: arm_unified_thread_state__bindgen_ty_1::ts_64"]
        [::std::mem::offset_of!(arm_unified_thread_state__bindgen_ty_1, ts_64) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of arm_unified_thread_state"]
        [::std::mem::size_of::<arm_unified_thread_state>() - 280usize];
    ["Alignment of arm_unified_thread_state"]
        [::std::mem::align_of::<arm_unified_thread_state>() - 8usize];
    ["Offset of field: arm_unified_thread_state::ash"]
        [::std::mem::offset_of!(arm_unified_thread_state, ash) - 0usize];
    ["Offset of field: arm_unified_thread_state::uts"]
        [::std::mem::offset_of!(arm_unified_thread_state, uts) - 8usize];
};
pub type arm_unified_thread_state_t = arm_unified_thread_state;
pub type arm_vfp_state_t = __darwin_arm_vfp_state;
pub type arm_neon_state_t = __darwin_arm_neon_state;
pub type arm_neon_state32_t = __darwin_arm_neon_state;
pub type arm_neon_state64_t = __darwin_arm_neon_state64;
pub type arm_exception_state_t = __darwin_arm_exception_state;
pub type arm_exception_state32_t = __darwin_arm_exception_state;
pub type arm_exception_state64_t = __darwin_arm_exception_state64;
pub type arm_exception_state64_v2_t = __darwin_arm_exception_state64_v2;
pub type arm_debug_state32_t = __darwin_arm_debug_state32;
pub type arm_debug_state64_t = __darwin_arm_debug_state64;
pub type arm_pagein_state_t = __arm_pagein_state;
pub type arm_debug_state_t = __arm_legacy_debug_state;
pub type thread_state_t = *mut natural_t;
pub type thread_state_data_t = [natural_t; 1296usize];
pub type thread_state_flavor_t = ::std::os::raw::c_int;
pub type thread_state_flavor_array_t = *mut thread_state_flavor_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipc_info_space {
    pub iis_genno_mask: natural_t,
    pub iis_table_size: natural_t,
    pub iis_table_next: natural_t,
    pub iis_tree_size: natural_t,
    pub iis_tree_small: natural_t,
    pub iis_tree_hash: natural_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipc_info_space"][::std::mem::size_of::<ipc_info_space>() - 24usize];
    ["Alignment of ipc_info_space"][::std::mem::align_of::<ipc_info_space>() - 4usize];
    ["Offset of field: ipc_info_space::iis_genno_mask"]
        [::std::mem::offset_of!(ipc_info_space, iis_genno_mask) - 0usize];
    ["Offset of field: ipc_info_space::iis_table_size"]
        [::std::mem::offset_of!(ipc_info_space, iis_table_size) - 4usize];
    ["Offset of field: ipc_info_space::iis_table_next"]
        [::std::mem::offset_of!(ipc_info_space, iis_table_next) - 8usize];
    ["Offset of field: ipc_info_space::iis_tree_size"]
        [::std::mem::offset_of!(ipc_info_space, iis_tree_size) - 12usize];
    ["Offset of field: ipc_info_space::iis_tree_small"]
        [::std::mem::offset_of!(ipc_info_space, iis_tree_small) - 16usize];
    ["Offset of field: ipc_info_space::iis_tree_hash"]
        [::std::mem::offset_of!(ipc_info_space, iis_tree_hash) - 20usize];
};
pub type ipc_info_space_t = ipc_info_space;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipc_info_space_basic {
    pub iisb_genno_mask: natural_t,
    pub iisb_table_size: natural_t,
    pub iisb_table_next: natural_t,
    pub iisb_table_inuse: natural_t,
    pub iisb_reserved: [natural_t; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipc_info_space_basic"][::std::mem::size_of::<ipc_info_space_basic>() - 24usize];
    ["Alignment of ipc_info_space_basic"][::std::mem::align_of::<ipc_info_space_basic>() - 4usize];
    ["Offset of field: ipc_info_space_basic::iisb_genno_mask"]
        [::std::mem::offset_of!(ipc_info_space_basic, iisb_genno_mask) - 0usize];
    ["Offset of field: ipc_info_space_basic::iisb_table_size"]
        [::std::mem::offset_of!(ipc_info_space_basic, iisb_table_size) - 4usize];
    ["Offset of field: ipc_info_space_basic::iisb_table_next"]
        [::std::mem::offset_of!(ipc_info_space_basic, iisb_table_next) - 8usize];
    ["Offset of field: ipc_info_space_basic::iisb_table_inuse"]
        [::std::mem::offset_of!(ipc_info_space_basic, iisb_table_inuse) - 12usize];
    ["Offset of field: ipc_info_space_basic::iisb_reserved"]
        [::std::mem::offset_of!(ipc_info_space_basic, iisb_reserved) - 16usize];
};
pub type ipc_info_space_basic_t = ipc_info_space_basic;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipc_info_name {
    pub iin_name: mach_port_name_t,
    pub iin_collision: integer_t,
    pub iin_type: mach_port_type_t,
    pub iin_urefs: mach_port_urefs_t,
    pub iin_object: natural_t,
    pub iin_next: natural_t,
    pub iin_hash: natural_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipc_info_name"][::std::mem::size_of::<ipc_info_name>() - 28usize];
    ["Alignment of ipc_info_name"][::std::mem::align_of::<ipc_info_name>() - 4usize];
    ["Offset of field: ipc_info_name::iin_name"]
        [::std::mem::offset_of!(ipc_info_name, iin_name) - 0usize];
    ["Offset of field: ipc_info_name::iin_collision"]
        [::std::mem::offset_of!(ipc_info_name, iin_collision) - 4usize];
    ["Offset of field: ipc_info_name::iin_type"]
        [::std::mem::offset_of!(ipc_info_name, iin_type) - 8usize];
    ["Offset of field: ipc_info_name::iin_urefs"]
        [::std::mem::offset_of!(ipc_info_name, iin_urefs) - 12usize];
    ["Offset of field: ipc_info_name::iin_object"]
        [::std::mem::offset_of!(ipc_info_name, iin_object) - 16usize];
    ["Offset of field: ipc_info_name::iin_next"]
        [::std::mem::offset_of!(ipc_info_name, iin_next) - 20usize];
    ["Offset of field: ipc_info_name::iin_hash"]
        [::std::mem::offset_of!(ipc_info_name, iin_hash) - 24usize];
};
pub type ipc_info_name_t = ipc_info_name;
pub type ipc_info_name_array_t = *mut ipc_info_name_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipc_info_tree_name {
    pub iitn_name: ipc_info_name_t,
    pub iitn_lchild: mach_port_name_t,
    pub iitn_rchild: mach_port_name_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipc_info_tree_name"][::std::mem::size_of::<ipc_info_tree_name>() - 36usize];
    ["Alignment of ipc_info_tree_name"][::std::mem::align_of::<ipc_info_tree_name>() - 4usize];
    ["Offset of field: ipc_info_tree_name::iitn_name"]
        [::std::mem::offset_of!(ipc_info_tree_name, iitn_name) - 0usize];
    ["Offset of field: ipc_info_tree_name::iitn_lchild"]
        [::std::mem::offset_of!(ipc_info_tree_name, iitn_lchild) - 28usize];
    ["Offset of field: ipc_info_tree_name::iitn_rchild"]
        [::std::mem::offset_of!(ipc_info_tree_name, iitn_rchild) - 32usize];
};
pub type ipc_info_tree_name_t = ipc_info_tree_name;
pub type ipc_info_tree_name_array_t = *mut ipc_info_tree_name_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipc_info_port {
    pub iip_port_object: natural_t,
    pub iip_receiver_object: natural_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ipc_info_port"][::std::mem::size_of::<ipc_info_port>() - 8usize];
    ["Alignment of ipc_info_port"][::std::mem::align_of::<ipc_info_port>() - 4usize];
    ["Offset of field: ipc_info_port::iip_port_object"]
        [::std::mem::offset_of!(ipc_info_port, iip_port_object) - 0usize];
    ["Offset of field: ipc_info_port::iip_receiver_object"]
        [::std::mem::offset_of!(ipc_info_port, iip_receiver_object) - 4usize];
};
pub type ipc_info_port_t = ipc_info_port;
pub type exception_handler_info_array_t = *mut ipc_info_port_t;
pub type exception_type_t = ::std::os::raw::c_int;
pub type exception_data_type_t = integer_t;
pub type mach_exception_data_type_t = i64;
pub type exception_behavior_t = ::std::os::raw::c_int;
pub type exception_data_t = *mut exception_data_type_t;
pub type mach_exception_data_t = *mut mach_exception_data_type_t;
pub type exception_mask_t = ::std::os::raw::c_uint;
pub type exception_mask_array_t = *mut exception_mask_t;
pub type exception_behavior_array_t = *mut exception_behavior_t;
pub type exception_flavor_array_t = *mut thread_state_flavor_t;
pub type exception_port_array_t = *mut mach_port_t;
pub type exception_port_info_array_t = *mut ipc_info_port_t;
pub type mach_exception_code_t = mach_exception_data_type_t;
pub type mach_exception_subcode_t = mach_exception_data_type_t;
pub type mach_voucher_t = mach_port_t;
pub type mach_voucher_name_t = mach_port_name_t;
pub type mach_voucher_name_array_t = *mut mach_voucher_name_t;
pub type ipc_voucher_t = mach_voucher_t;
pub type mach_voucher_selector_t = u32;
pub type mach_voucher_attr_key_t = u32;
pub type mach_voucher_attr_key_array_t = *mut mach_voucher_attr_key_t;
pub type mach_voucher_attr_content_t = *mut u8;
pub type mach_voucher_attr_content_size_t = u32;
pub type mach_voucher_attr_command_t = u32;
pub type mach_voucher_attr_recipe_command_t = u32;
pub type mach_voucher_attr_recipe_command_array_t = *mut mach_voucher_attr_recipe_command_t;
#[repr(C, packed)]
pub struct mach_voucher_attr_recipe_data {
    pub key: mach_voucher_attr_key_t,
    pub command: mach_voucher_attr_recipe_command_t,
    pub previous_voucher: mach_voucher_name_t,
    pub content_size: mach_voucher_attr_content_size_t,
    pub content: __IncompleteArrayField<u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_voucher_attr_recipe_data"]
        [::std::mem::size_of::<mach_voucher_attr_recipe_data>() - 16usize];
    ["Alignment of mach_voucher_attr_recipe_data"]
        [::std::mem::align_of::<mach_voucher_attr_recipe_data>() - 1usize];
    ["Offset of field: mach_voucher_attr_recipe_data::key"]
        [::std::mem::offset_of!(mach_voucher_attr_recipe_data, key) - 0usize];
    ["Offset of field: mach_voucher_attr_recipe_data::command"]
        [::std::mem::offset_of!(mach_voucher_attr_recipe_data, command) - 4usize];
    ["Offset of field: mach_voucher_attr_recipe_data::previous_voucher"]
        [::std::mem::offset_of!(mach_voucher_attr_recipe_data, previous_voucher) - 8usize];
    ["Offset of field: mach_voucher_attr_recipe_data::content_size"]
        [::std::mem::offset_of!(mach_voucher_attr_recipe_data, content_size) - 12usize];
    ["Offset of field: mach_voucher_attr_recipe_data::content"]
        [::std::mem::offset_of!(mach_voucher_attr_recipe_data, content) - 16usize];
};
pub type mach_voucher_attr_recipe_data_t = mach_voucher_attr_recipe_data;
pub type mach_voucher_attr_recipe_t = *mut mach_voucher_attr_recipe_data_t;
pub type mach_voucher_attr_recipe_size_t = mach_msg_type_number_t;
pub type mach_voucher_attr_raw_recipe_t = *mut u8;
pub type mach_voucher_attr_raw_recipe_array_t = mach_voucher_attr_raw_recipe_t;
pub type mach_voucher_attr_raw_recipe_size_t = mach_msg_type_number_t;
pub type mach_voucher_attr_raw_recipe_array_size_t = mach_msg_type_number_t;
pub type mach_voucher_attr_manager_t = mach_port_t;
pub type mach_voucher_attr_control_t = mach_port_t;
pub type ipc_voucher_attr_manager_t = mach_port_t;
pub type ipc_voucher_attr_control_t = mach_port_t;
pub type mach_voucher_attr_value_handle_t = u64;
pub type mach_voucher_attr_value_handle_array_t = *mut mach_voucher_attr_value_handle_t;
pub type mach_voucher_attr_value_handle_array_size_t = mach_msg_type_number_t;
pub type mach_voucher_attr_value_reference_t = u32;
pub type mach_voucher_attr_value_flags_t = u32;
pub type mach_voucher_attr_control_flags_t = u32;
pub type mach_voucher_attr_importance_refs = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct processor_cpu_stat {
    pub irq_ex_cnt: u32,
    pub ipi_cnt: u32,
    pub timer_cnt: u32,
    pub undef_ex_cnt: u32,
    pub unaligned_cnt: u32,
    pub vfp_cnt: u32,
    pub vfp_shortv_cnt: u32,
    pub data_ex_cnt: u32,
    pub instr_ex_cnt: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of processor_cpu_stat"][::std::mem::size_of::<processor_cpu_stat>() - 36usize];
    ["Alignment of processor_cpu_stat"][::std::mem::align_of::<processor_cpu_stat>() - 4usize];
    ["Offset of field: processor_cpu_stat::irq_ex_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat, irq_ex_cnt) - 0usize];
    ["Offset of field: processor_cpu_stat::ipi_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat, ipi_cnt) - 4usize];
    ["Offset of field: processor_cpu_stat::timer_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat, timer_cnt) - 8usize];
    ["Offset of field: processor_cpu_stat::undef_ex_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat, undef_ex_cnt) - 12usize];
    ["Offset of field: processor_cpu_stat::unaligned_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat, unaligned_cnt) - 16usize];
    ["Offset of field: processor_cpu_stat::vfp_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat, vfp_cnt) - 20usize];
    ["Offset of field: processor_cpu_stat::vfp_shortv_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat, vfp_shortv_cnt) - 24usize];
    ["Offset of field: processor_cpu_stat::data_ex_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat, data_ex_cnt) - 28usize];
    ["Offset of field: processor_cpu_stat::instr_ex_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat, instr_ex_cnt) - 32usize];
};
pub type processor_cpu_stat_data_t = processor_cpu_stat;
pub type processor_cpu_stat_t = *mut processor_cpu_stat;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct processor_cpu_stat64 {
    pub irq_ex_cnt: u64,
    pub ipi_cnt: u64,
    pub timer_cnt: u64,
    pub undef_ex_cnt: u64,
    pub unaligned_cnt: u64,
    pub vfp_cnt: u64,
    pub vfp_shortv_cnt: u64,
    pub data_ex_cnt: u64,
    pub instr_ex_cnt: u64,
    pub pmi_cnt: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of processor_cpu_stat64"][::std::mem::size_of::<processor_cpu_stat64>() - 80usize];
    ["Alignment of processor_cpu_stat64"][::std::mem::align_of::<processor_cpu_stat64>() - 4usize];
    ["Offset of field: processor_cpu_stat64::irq_ex_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, irq_ex_cnt) - 0usize];
    ["Offset of field: processor_cpu_stat64::ipi_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, ipi_cnt) - 8usize];
    ["Offset of field: processor_cpu_stat64::timer_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, timer_cnt) - 16usize];
    ["Offset of field: processor_cpu_stat64::undef_ex_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, undef_ex_cnt) - 24usize];
    ["Offset of field: processor_cpu_stat64::unaligned_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, unaligned_cnt) - 32usize];
    ["Offset of field: processor_cpu_stat64::vfp_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, vfp_cnt) - 40usize];
    ["Offset of field: processor_cpu_stat64::vfp_shortv_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, vfp_shortv_cnt) - 48usize];
    ["Offset of field: processor_cpu_stat64::data_ex_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, data_ex_cnt) - 56usize];
    ["Offset of field: processor_cpu_stat64::instr_ex_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, instr_ex_cnt) - 64usize];
    ["Offset of field: processor_cpu_stat64::pmi_cnt"]
        [::std::mem::offset_of!(processor_cpu_stat64, pmi_cnt) - 72usize];
};
pub type processor_cpu_stat64_data_t = processor_cpu_stat64;
pub type processor_cpu_stat64_t = *mut processor_cpu_stat64;
pub type processor_info_t = *mut integer_t;
pub type processor_info_array_t = *mut integer_t;
pub type processor_info_data_t = [integer_t; 1024usize];
pub type processor_set_info_t = *mut integer_t;
pub type processor_set_info_data_t = [integer_t; 1024usize];
pub type processor_flavor_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct processor_basic_info {
    pub cpu_type: cpu_type_t,
    pub cpu_subtype: cpu_subtype_t,
    pub running: boolean_t,
    pub slot_num: ::std::os::raw::c_int,
    pub __bindgen_anon_1: processor_basic_info__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union processor_basic_info__bindgen_ty_1 {
    pub is_master: boolean_t,
    pub is_main: boolean_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of processor_basic_info__bindgen_ty_1"]
        [::std::mem::size_of::<processor_basic_info__bindgen_ty_1>() - 4usize];
    ["Alignment of processor_basic_info__bindgen_ty_1"]
        [::std::mem::align_of::<processor_basic_info__bindgen_ty_1>() - 4usize];
    ["Offset of field: processor_basic_info__bindgen_ty_1::is_master"]
        [::std::mem::offset_of!(processor_basic_info__bindgen_ty_1, is_master) - 0usize];
    ["Offset of field: processor_basic_info__bindgen_ty_1::is_main"]
        [::std::mem::offset_of!(processor_basic_info__bindgen_ty_1, is_main) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of processor_basic_info"][::std::mem::size_of::<processor_basic_info>() - 20usize];
    ["Alignment of processor_basic_info"][::std::mem::align_of::<processor_basic_info>() - 4usize];
    ["Offset of field: processor_basic_info::cpu_type"]
        [::std::mem::offset_of!(processor_basic_info, cpu_type) - 0usize];
    ["Offset of field: processor_basic_info::cpu_subtype"]
        [::std::mem::offset_of!(processor_basic_info, cpu_subtype) - 4usize];
    ["Offset of field: processor_basic_info::running"]
        [::std::mem::offset_of!(processor_basic_info, running) - 8usize];
    ["Offset of field: processor_basic_info::slot_num"]
        [::std::mem::offset_of!(processor_basic_info, slot_num) - 12usize];
};
pub type processor_basic_info_data_t = processor_basic_info;
pub type processor_basic_info_t = *mut processor_basic_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct processor_cpu_load_info {
    pub cpu_ticks: [::std::os::raw::c_uint; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of processor_cpu_load_info"][::std::mem::size_of::<processor_cpu_load_info>() - 16usize];
    ["Alignment of processor_cpu_load_info"]
        [::std::mem::align_of::<processor_cpu_load_info>() - 4usize];
    ["Offset of field: processor_cpu_load_info::cpu_ticks"]
        [::std::mem::offset_of!(processor_cpu_load_info, cpu_ticks) - 0usize];
};
pub type processor_cpu_load_info_data_t = processor_cpu_load_info;
pub type processor_cpu_load_info_t = *mut processor_cpu_load_info;
pub type processor_set_flavor_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct processor_set_basic_info {
    pub processor_count: ::std::os::raw::c_int,
    pub default_policy: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of processor_set_basic_info"]
        [::std::mem::size_of::<processor_set_basic_info>() - 8usize];
    ["Alignment of processor_set_basic_info"]
        [::std::mem::align_of::<processor_set_basic_info>() - 4usize];
    ["Offset of field: processor_set_basic_info::processor_count"]
        [::std::mem::offset_of!(processor_set_basic_info, processor_count) - 0usize];
    ["Offset of field: processor_set_basic_info::default_policy"]
        [::std::mem::offset_of!(processor_set_basic_info, default_policy) - 4usize];
};
pub type processor_set_basic_info_data_t = processor_set_basic_info;
pub type processor_set_basic_info_t = *mut processor_set_basic_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct processor_set_load_info {
    pub task_count: ::std::os::raw::c_int,
    pub thread_count: ::std::os::raw::c_int,
    pub load_average: integer_t,
    pub mach_factor: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of processor_set_load_info"][::std::mem::size_of::<processor_set_load_info>() - 16usize];
    ["Alignment of processor_set_load_info"]
        [::std::mem::align_of::<processor_set_load_info>() - 4usize];
    ["Offset of field: processor_set_load_info::task_count"]
        [::std::mem::offset_of!(processor_set_load_info, task_count) - 0usize];
    ["Offset of field: processor_set_load_info::thread_count"]
        [::std::mem::offset_of!(processor_set_load_info, thread_count) - 4usize];
    ["Offset of field: processor_set_load_info::load_average"]
        [::std::mem::offset_of!(processor_set_load_info, load_average) - 8usize];
    ["Offset of field: processor_set_load_info::mach_factor"]
        [::std::mem::offset_of!(processor_set_load_info, mach_factor) - 12usize];
};
pub type processor_set_load_info_data_t = processor_set_load_info;
pub type processor_set_load_info_t = *mut processor_set_load_info;
pub type policy_t = ::std::os::raw::c_int;
pub type policy_info_t = *mut integer_t;
pub type policy_base_t = *mut integer_t;
pub type policy_limit_t = *mut integer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_timeshare_base {
    pub base_priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_timeshare_base"][::std::mem::size_of::<policy_timeshare_base>() - 4usize];
    ["Alignment of policy_timeshare_base"]
        [::std::mem::align_of::<policy_timeshare_base>() - 4usize];
    ["Offset of field: policy_timeshare_base::base_priority"]
        [::std::mem::offset_of!(policy_timeshare_base, base_priority) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_timeshare_limit {
    pub max_priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_timeshare_limit"][::std::mem::size_of::<policy_timeshare_limit>() - 4usize];
    ["Alignment of policy_timeshare_limit"]
        [::std::mem::align_of::<policy_timeshare_limit>() - 4usize];
    ["Offset of field: policy_timeshare_limit::max_priority"]
        [::std::mem::offset_of!(policy_timeshare_limit, max_priority) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_timeshare_info {
    pub max_priority: integer_t,
    pub base_priority: integer_t,
    pub cur_priority: integer_t,
    pub depressed: boolean_t,
    pub depress_priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_timeshare_info"][::std::mem::size_of::<policy_timeshare_info>() - 20usize];
    ["Alignment of policy_timeshare_info"]
        [::std::mem::align_of::<policy_timeshare_info>() - 4usize];
    ["Offset of field: policy_timeshare_info::max_priority"]
        [::std::mem::offset_of!(policy_timeshare_info, max_priority) - 0usize];
    ["Offset of field: policy_timeshare_info::base_priority"]
        [::std::mem::offset_of!(policy_timeshare_info, base_priority) - 4usize];
    ["Offset of field: policy_timeshare_info::cur_priority"]
        [::std::mem::offset_of!(policy_timeshare_info, cur_priority) - 8usize];
    ["Offset of field: policy_timeshare_info::depressed"]
        [::std::mem::offset_of!(policy_timeshare_info, depressed) - 12usize];
    ["Offset of field: policy_timeshare_info::depress_priority"]
        [::std::mem::offset_of!(policy_timeshare_info, depress_priority) - 16usize];
};
pub type policy_timeshare_base_t = *mut policy_timeshare_base;
pub type policy_timeshare_limit_t = *mut policy_timeshare_limit;
pub type policy_timeshare_info_t = *mut policy_timeshare_info;
pub type policy_timeshare_base_data_t = policy_timeshare_base;
pub type policy_timeshare_limit_data_t = policy_timeshare_limit;
pub type policy_timeshare_info_data_t = policy_timeshare_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_rr_base {
    pub base_priority: integer_t,
    pub quantum: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_rr_base"][::std::mem::size_of::<policy_rr_base>() - 8usize];
    ["Alignment of policy_rr_base"][::std::mem::align_of::<policy_rr_base>() - 4usize];
    ["Offset of field: policy_rr_base::base_priority"]
        [::std::mem::offset_of!(policy_rr_base, base_priority) - 0usize];
    ["Offset of field: policy_rr_base::quantum"]
        [::std::mem::offset_of!(policy_rr_base, quantum) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_rr_limit {
    pub max_priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_rr_limit"][::std::mem::size_of::<policy_rr_limit>() - 4usize];
    ["Alignment of policy_rr_limit"][::std::mem::align_of::<policy_rr_limit>() - 4usize];
    ["Offset of field: policy_rr_limit::max_priority"]
        [::std::mem::offset_of!(policy_rr_limit, max_priority) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_rr_info {
    pub max_priority: integer_t,
    pub base_priority: integer_t,
    pub quantum: integer_t,
    pub depressed: boolean_t,
    pub depress_priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_rr_info"][::std::mem::size_of::<policy_rr_info>() - 20usize];
    ["Alignment of policy_rr_info"][::std::mem::align_of::<policy_rr_info>() - 4usize];
    ["Offset of field: policy_rr_info::max_priority"]
        [::std::mem::offset_of!(policy_rr_info, max_priority) - 0usize];
    ["Offset of field: policy_rr_info::base_priority"]
        [::std::mem::offset_of!(policy_rr_info, base_priority) - 4usize];
    ["Offset of field: policy_rr_info::quantum"]
        [::std::mem::offset_of!(policy_rr_info, quantum) - 8usize];
    ["Offset of field: policy_rr_info::depressed"]
        [::std::mem::offset_of!(policy_rr_info, depressed) - 12usize];
    ["Offset of field: policy_rr_info::depress_priority"]
        [::std::mem::offset_of!(policy_rr_info, depress_priority) - 16usize];
};
pub type policy_rr_base_t = *mut policy_rr_base;
pub type policy_rr_limit_t = *mut policy_rr_limit;
pub type policy_rr_info_t = *mut policy_rr_info;
pub type policy_rr_base_data_t = policy_rr_base;
pub type policy_rr_limit_data_t = policy_rr_limit;
pub type policy_rr_info_data_t = policy_rr_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_fifo_base {
    pub base_priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_fifo_base"][::std::mem::size_of::<policy_fifo_base>() - 4usize];
    ["Alignment of policy_fifo_base"][::std::mem::align_of::<policy_fifo_base>() - 4usize];
    ["Offset of field: policy_fifo_base::base_priority"]
        [::std::mem::offset_of!(policy_fifo_base, base_priority) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_fifo_limit {
    pub max_priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_fifo_limit"][::std::mem::size_of::<policy_fifo_limit>() - 4usize];
    ["Alignment of policy_fifo_limit"][::std::mem::align_of::<policy_fifo_limit>() - 4usize];
    ["Offset of field: policy_fifo_limit::max_priority"]
        [::std::mem::offset_of!(policy_fifo_limit, max_priority) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_fifo_info {
    pub max_priority: integer_t,
    pub base_priority: integer_t,
    pub depressed: boolean_t,
    pub depress_priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_fifo_info"][::std::mem::size_of::<policy_fifo_info>() - 16usize];
    ["Alignment of policy_fifo_info"][::std::mem::align_of::<policy_fifo_info>() - 4usize];
    ["Offset of field: policy_fifo_info::max_priority"]
        [::std::mem::offset_of!(policy_fifo_info, max_priority) - 0usize];
    ["Offset of field: policy_fifo_info::base_priority"]
        [::std::mem::offset_of!(policy_fifo_info, base_priority) - 4usize];
    ["Offset of field: policy_fifo_info::depressed"]
        [::std::mem::offset_of!(policy_fifo_info, depressed) - 8usize];
    ["Offset of field: policy_fifo_info::depress_priority"]
        [::std::mem::offset_of!(policy_fifo_info, depress_priority) - 12usize];
};
pub type policy_fifo_base_t = *mut policy_fifo_base;
pub type policy_fifo_limit_t = *mut policy_fifo_limit;
pub type policy_fifo_info_t = *mut policy_fifo_info;
pub type policy_fifo_base_data_t = policy_fifo_base;
pub type policy_fifo_limit_data_t = policy_fifo_limit;
pub type policy_fifo_info_data_t = policy_fifo_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_bases {
    pub ts: policy_timeshare_base_data_t,
    pub rr: policy_rr_base_data_t,
    pub fifo: policy_fifo_base_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_bases"][::std::mem::size_of::<policy_bases>() - 16usize];
    ["Alignment of policy_bases"][::std::mem::align_of::<policy_bases>() - 4usize];
    ["Offset of field: policy_bases::ts"][::std::mem::offset_of!(policy_bases, ts) - 0usize];
    ["Offset of field: policy_bases::rr"][::std::mem::offset_of!(policy_bases, rr) - 4usize];
    ["Offset of field: policy_bases::fifo"][::std::mem::offset_of!(policy_bases, fifo) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_limits {
    pub ts: policy_timeshare_limit_data_t,
    pub rr: policy_rr_limit_data_t,
    pub fifo: policy_fifo_limit_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_limits"][::std::mem::size_of::<policy_limits>() - 12usize];
    ["Alignment of policy_limits"][::std::mem::align_of::<policy_limits>() - 4usize];
    ["Offset of field: policy_limits::ts"][::std::mem::offset_of!(policy_limits, ts) - 0usize];
    ["Offset of field: policy_limits::rr"][::std::mem::offset_of!(policy_limits, rr) - 4usize];
    ["Offset of field: policy_limits::fifo"][::std::mem::offset_of!(policy_limits, fifo) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct policy_infos {
    pub ts: policy_timeshare_info_data_t,
    pub rr: policy_rr_info_data_t,
    pub fifo: policy_fifo_info_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of policy_infos"][::std::mem::size_of::<policy_infos>() - 56usize];
    ["Alignment of policy_infos"][::std::mem::align_of::<policy_infos>() - 4usize];
    ["Offset of field: policy_infos::ts"][::std::mem::offset_of!(policy_infos, ts) - 0usize];
    ["Offset of field: policy_infos::rr"][::std::mem::offset_of!(policy_infos, rr) - 20usize];
    ["Offset of field: policy_infos::fifo"][::std::mem::offset_of!(policy_infos, fifo) - 40usize];
};
pub type policy_base_data_t = policy_bases;
pub type policy_limit_data_t = policy_limits;
pub type policy_info_data_t = policy_infos;
pub type task_flavor_t = natural_t;
pub type task_info_t = *mut integer_t;
pub type task_info_data_t = [integer_t; 1024usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_basic_info_32 {
    pub suspend_count: integer_t,
    pub virtual_size: natural_t,
    pub resident_size: natural_t,
    pub user_time: time_value_t,
    pub system_time: time_value_t,
    pub policy: policy_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_basic_info_32"][::std::mem::size_of::<task_basic_info_32>() - 32usize];
    ["Alignment of task_basic_info_32"][::std::mem::align_of::<task_basic_info_32>() - 4usize];
    ["Offset of field: task_basic_info_32::suspend_count"]
        [::std::mem::offset_of!(task_basic_info_32, suspend_count) - 0usize];
    ["Offset of field: task_basic_info_32::virtual_size"]
        [::std::mem::offset_of!(task_basic_info_32, virtual_size) - 4usize];
    ["Offset of field: task_basic_info_32::resident_size"]
        [::std::mem::offset_of!(task_basic_info_32, resident_size) - 8usize];
    ["Offset of field: task_basic_info_32::user_time"]
        [::std::mem::offset_of!(task_basic_info_32, user_time) - 12usize];
    ["Offset of field: task_basic_info_32::system_time"]
        [::std::mem::offset_of!(task_basic_info_32, system_time) - 20usize];
    ["Offset of field: task_basic_info_32::policy"]
        [::std::mem::offset_of!(task_basic_info_32, policy) - 28usize];
};
pub type task_basic_info_32_data_t = task_basic_info_32;
pub type task_basic_info_32_t = *mut task_basic_info_32;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_basic_info_64 {
    pub suspend_count: integer_t,
    pub virtual_size: mach_vm_size_t,
    pub resident_size: mach_vm_size_t,
    pub user_time: time_value_t,
    pub system_time: time_value_t,
    pub policy: policy_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_basic_info_64"][::std::mem::size_of::<task_basic_info_64>() - 40usize];
    ["Alignment of task_basic_info_64"][::std::mem::align_of::<task_basic_info_64>() - 4usize];
    ["Offset of field: task_basic_info_64::suspend_count"]
        [::std::mem::offset_of!(task_basic_info_64, suspend_count) - 0usize];
    ["Offset of field: task_basic_info_64::virtual_size"]
        [::std::mem::offset_of!(task_basic_info_64, virtual_size) - 4usize];
    ["Offset of field: task_basic_info_64::resident_size"]
        [::std::mem::offset_of!(task_basic_info_64, resident_size) - 12usize];
    ["Offset of field: task_basic_info_64::user_time"]
        [::std::mem::offset_of!(task_basic_info_64, user_time) - 20usize];
    ["Offset of field: task_basic_info_64::system_time"]
        [::std::mem::offset_of!(task_basic_info_64, system_time) - 28usize];
    ["Offset of field: task_basic_info_64::policy"]
        [::std::mem::offset_of!(task_basic_info_64, policy) - 36usize];
};
pub type task_basic_info_64_data_t = task_basic_info_64;
pub type task_basic_info_64_t = *mut task_basic_info_64;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_basic_info {
    pub suspend_count: integer_t,
    pub virtual_size: vm_size_t,
    pub resident_size: vm_size_t,
    pub user_time: time_value_t,
    pub system_time: time_value_t,
    pub policy: policy_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_basic_info"][::std::mem::size_of::<task_basic_info>() - 40usize];
    ["Alignment of task_basic_info"][::std::mem::align_of::<task_basic_info>() - 4usize];
    ["Offset of field: task_basic_info::suspend_count"]
        [::std::mem::offset_of!(task_basic_info, suspend_count) - 0usize];
    ["Offset of field: task_basic_info::virtual_size"]
        [::std::mem::offset_of!(task_basic_info, virtual_size) - 4usize];
    ["Offset of field: task_basic_info::resident_size"]
        [::std::mem::offset_of!(task_basic_info, resident_size) - 12usize];
    ["Offset of field: task_basic_info::user_time"]
        [::std::mem::offset_of!(task_basic_info, user_time) - 20usize];
    ["Offset of field: task_basic_info::system_time"]
        [::std::mem::offset_of!(task_basic_info, system_time) - 28usize];
    ["Offset of field: task_basic_info::policy"]
        [::std::mem::offset_of!(task_basic_info, policy) - 36usize];
};
pub type task_basic_info_data_t = task_basic_info;
pub type task_basic_info_t = *mut task_basic_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_events_info {
    pub faults: integer_t,
    pub pageins: integer_t,
    pub cow_faults: integer_t,
    pub messages_sent: integer_t,
    pub messages_received: integer_t,
    pub syscalls_mach: integer_t,
    pub syscalls_unix: integer_t,
    pub csw: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_events_info"][::std::mem::size_of::<task_events_info>() - 32usize];
    ["Alignment of task_events_info"][::std::mem::align_of::<task_events_info>() - 4usize];
    ["Offset of field: task_events_info::faults"]
        [::std::mem::offset_of!(task_events_info, faults) - 0usize];
    ["Offset of field: task_events_info::pageins"]
        [::std::mem::offset_of!(task_events_info, pageins) - 4usize];
    ["Offset of field: task_events_info::cow_faults"]
        [::std::mem::offset_of!(task_events_info, cow_faults) - 8usize];
    ["Offset of field: task_events_info::messages_sent"]
        [::std::mem::offset_of!(task_events_info, messages_sent) - 12usize];
    ["Offset of field: task_events_info::messages_received"]
        [::std::mem::offset_of!(task_events_info, messages_received) - 16usize];
    ["Offset of field: task_events_info::syscalls_mach"]
        [::std::mem::offset_of!(task_events_info, syscalls_mach) - 20usize];
    ["Offset of field: task_events_info::syscalls_unix"]
        [::std::mem::offset_of!(task_events_info, syscalls_unix) - 24usize];
    ["Offset of field: task_events_info::csw"]
        [::std::mem::offset_of!(task_events_info, csw) - 28usize];
};
pub type task_events_info_data_t = task_events_info;
pub type task_events_info_t = *mut task_events_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_thread_times_info {
    pub user_time: time_value_t,
    pub system_time: time_value_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_thread_times_info"][::std::mem::size_of::<task_thread_times_info>() - 16usize];
    ["Alignment of task_thread_times_info"]
        [::std::mem::align_of::<task_thread_times_info>() - 4usize];
    ["Offset of field: task_thread_times_info::user_time"]
        [::std::mem::offset_of!(task_thread_times_info, user_time) - 0usize];
    ["Offset of field: task_thread_times_info::system_time"]
        [::std::mem::offset_of!(task_thread_times_info, system_time) - 8usize];
};
pub type task_thread_times_info_data_t = task_thread_times_info;
pub type task_thread_times_info_t = *mut task_thread_times_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_absolutetime_info {
    pub total_user: u64,
    pub total_system: u64,
    pub threads_user: u64,
    pub threads_system: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_absolutetime_info"][::std::mem::size_of::<task_absolutetime_info>() - 32usize];
    ["Alignment of task_absolutetime_info"]
        [::std::mem::align_of::<task_absolutetime_info>() - 4usize];
    ["Offset of field: task_absolutetime_info::total_user"]
        [::std::mem::offset_of!(task_absolutetime_info, total_user) - 0usize];
    ["Offset of field: task_absolutetime_info::total_system"]
        [::std::mem::offset_of!(task_absolutetime_info, total_system) - 8usize];
    ["Offset of field: task_absolutetime_info::threads_user"]
        [::std::mem::offset_of!(task_absolutetime_info, threads_user) - 16usize];
    ["Offset of field: task_absolutetime_info::threads_system"]
        [::std::mem::offset_of!(task_absolutetime_info, threads_system) - 24usize];
};
pub type task_absolutetime_info_data_t = task_absolutetime_info;
pub type task_absolutetime_info_t = *mut task_absolutetime_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_kernelmemory_info {
    pub total_palloc: u64,
    pub total_pfree: u64,
    pub total_salloc: u64,
    pub total_sfree: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_kernelmemory_info"][::std::mem::size_of::<task_kernelmemory_info>() - 32usize];
    ["Alignment of task_kernelmemory_info"]
        [::std::mem::align_of::<task_kernelmemory_info>() - 4usize];
    ["Offset of field: task_kernelmemory_info::total_palloc"]
        [::std::mem::offset_of!(task_kernelmemory_info, total_palloc) - 0usize];
    ["Offset of field: task_kernelmemory_info::total_pfree"]
        [::std::mem::offset_of!(task_kernelmemory_info, total_pfree) - 8usize];
    ["Offset of field: task_kernelmemory_info::total_salloc"]
        [::std::mem::offset_of!(task_kernelmemory_info, total_salloc) - 16usize];
    ["Offset of field: task_kernelmemory_info::total_sfree"]
        [::std::mem::offset_of!(task_kernelmemory_info, total_sfree) - 24usize];
};
pub type task_kernelmemory_info_data_t = task_kernelmemory_info;
pub type task_kernelmemory_info_t = *mut task_kernelmemory_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_affinity_tag_info {
    pub set_count: integer_t,
    pub min: integer_t,
    pub max: integer_t,
    pub task_count: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_affinity_tag_info"][::std::mem::size_of::<task_affinity_tag_info>() - 16usize];
    ["Alignment of task_affinity_tag_info"]
        [::std::mem::align_of::<task_affinity_tag_info>() - 4usize];
    ["Offset of field: task_affinity_tag_info::set_count"]
        [::std::mem::offset_of!(task_affinity_tag_info, set_count) - 0usize];
    ["Offset of field: task_affinity_tag_info::min"]
        [::std::mem::offset_of!(task_affinity_tag_info, min) - 4usize];
    ["Offset of field: task_affinity_tag_info::max"]
        [::std::mem::offset_of!(task_affinity_tag_info, max) - 8usize];
    ["Offset of field: task_affinity_tag_info::task_count"]
        [::std::mem::offset_of!(task_affinity_tag_info, task_count) - 12usize];
};
pub type task_affinity_tag_info_data_t = task_affinity_tag_info;
pub type task_affinity_tag_info_t = *mut task_affinity_tag_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_dyld_info {
    pub all_image_info_addr: mach_vm_address_t,
    pub all_image_info_size: mach_vm_size_t,
    pub all_image_info_format: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_dyld_info"][::std::mem::size_of::<task_dyld_info>() - 20usize];
    ["Alignment of task_dyld_info"][::std::mem::align_of::<task_dyld_info>() - 4usize];
    ["Offset of field: task_dyld_info::all_image_info_addr"]
        [::std::mem::offset_of!(task_dyld_info, all_image_info_addr) - 0usize];
    ["Offset of field: task_dyld_info::all_image_info_size"]
        [::std::mem::offset_of!(task_dyld_info, all_image_info_size) - 8usize];
    ["Offset of field: task_dyld_info::all_image_info_format"]
        [::std::mem::offset_of!(task_dyld_info, all_image_info_format) - 16usize];
};
pub type task_dyld_info_data_t = task_dyld_info;
pub type task_dyld_info_t = *mut task_dyld_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_basic_info_64_2 {
    pub suspend_count: integer_t,
    pub virtual_size: mach_vm_size_t,
    pub resident_size: mach_vm_size_t,
    pub user_time: time_value_t,
    pub system_time: time_value_t,
    pub policy: policy_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_basic_info_64_2"][::std::mem::size_of::<task_basic_info_64_2>() - 40usize];
    ["Alignment of task_basic_info_64_2"][::std::mem::align_of::<task_basic_info_64_2>() - 4usize];
    ["Offset of field: task_basic_info_64_2::suspend_count"]
        [::std::mem::offset_of!(task_basic_info_64_2, suspend_count) - 0usize];
    ["Offset of field: task_basic_info_64_2::virtual_size"]
        [::std::mem::offset_of!(task_basic_info_64_2, virtual_size) - 4usize];
    ["Offset of field: task_basic_info_64_2::resident_size"]
        [::std::mem::offset_of!(task_basic_info_64_2, resident_size) - 12usize];
    ["Offset of field: task_basic_info_64_2::user_time"]
        [::std::mem::offset_of!(task_basic_info_64_2, user_time) - 20usize];
    ["Offset of field: task_basic_info_64_2::system_time"]
        [::std::mem::offset_of!(task_basic_info_64_2, system_time) - 28usize];
    ["Offset of field: task_basic_info_64_2::policy"]
        [::std::mem::offset_of!(task_basic_info_64_2, policy) - 36usize];
};
pub type task_basic_info_64_2_data_t = task_basic_info_64_2;
pub type task_basic_info_64_2_t = *mut task_basic_info_64_2;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_extmod_info {
    pub task_uuid: [::std::os::raw::c_uchar; 16usize],
    pub extmod_statistics: vm_extmod_statistics_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_extmod_info"][::std::mem::size_of::<task_extmod_info>() - 64usize];
    ["Alignment of task_extmod_info"][::std::mem::align_of::<task_extmod_info>() - 4usize];
    ["Offset of field: task_extmod_info::task_uuid"]
        [::std::mem::offset_of!(task_extmod_info, task_uuid) - 0usize];
    ["Offset of field: task_extmod_info::extmod_statistics"]
        [::std::mem::offset_of!(task_extmod_info, extmod_statistics) - 16usize];
};
pub type task_extmod_info_data_t = task_extmod_info;
pub type task_extmod_info_t = *mut task_extmod_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_task_basic_info {
    pub virtual_size: mach_vm_size_t,
    pub resident_size: mach_vm_size_t,
    pub resident_size_max: mach_vm_size_t,
    pub user_time: time_value_t,
    pub system_time: time_value_t,
    pub policy: policy_t,
    pub suspend_count: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_task_basic_info"][::std::mem::size_of::<mach_task_basic_info>() - 48usize];
    ["Alignment of mach_task_basic_info"][::std::mem::align_of::<mach_task_basic_info>() - 4usize];
    ["Offset of field: mach_task_basic_info::virtual_size"]
        [::std::mem::offset_of!(mach_task_basic_info, virtual_size) - 0usize];
    ["Offset of field: mach_task_basic_info::resident_size"]
        [::std::mem::offset_of!(mach_task_basic_info, resident_size) - 8usize];
    ["Offset of field: mach_task_basic_info::resident_size_max"]
        [::std::mem::offset_of!(mach_task_basic_info, resident_size_max) - 16usize];
    ["Offset of field: mach_task_basic_info::user_time"]
        [::std::mem::offset_of!(mach_task_basic_info, user_time) - 24usize];
    ["Offset of field: mach_task_basic_info::system_time"]
        [::std::mem::offset_of!(mach_task_basic_info, system_time) - 32usize];
    ["Offset of field: mach_task_basic_info::policy"]
        [::std::mem::offset_of!(mach_task_basic_info, policy) - 40usize];
    ["Offset of field: mach_task_basic_info::suspend_count"]
        [::std::mem::offset_of!(mach_task_basic_info, suspend_count) - 44usize];
};
pub type mach_task_basic_info_data_t = mach_task_basic_info;
pub type mach_task_basic_info_t = *mut mach_task_basic_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_power_info {
    pub total_user: u64,
    pub total_system: u64,
    pub task_interrupt_wakeups: u64,
    pub task_platform_idle_wakeups: u64,
    pub task_timer_wakeups_bin_1: u64,
    pub task_timer_wakeups_bin_2: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_power_info"][::std::mem::size_of::<task_power_info>() - 48usize];
    ["Alignment of task_power_info"][::std::mem::align_of::<task_power_info>() - 4usize];
    ["Offset of field: task_power_info::total_user"]
        [::std::mem::offset_of!(task_power_info, total_user) - 0usize];
    ["Offset of field: task_power_info::total_system"]
        [::std::mem::offset_of!(task_power_info, total_system) - 8usize];
    ["Offset of field: task_power_info::task_interrupt_wakeups"]
        [::std::mem::offset_of!(task_power_info, task_interrupt_wakeups) - 16usize];
    ["Offset of field: task_power_info::task_platform_idle_wakeups"]
        [::std::mem::offset_of!(task_power_info, task_platform_idle_wakeups) - 24usize];
    ["Offset of field: task_power_info::task_timer_wakeups_bin_1"]
        [::std::mem::offset_of!(task_power_info, task_timer_wakeups_bin_1) - 32usize];
    ["Offset of field: task_power_info::task_timer_wakeups_bin_2"]
        [::std::mem::offset_of!(task_power_info, task_timer_wakeups_bin_2) - 40usize];
};
pub type task_power_info_data_t = task_power_info;
pub type task_power_info_t = *mut task_power_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_vm_info {
    pub virtual_size: mach_vm_size_t,
    pub region_count: integer_t,
    pub page_size: integer_t,
    pub resident_size: mach_vm_size_t,
    pub resident_size_peak: mach_vm_size_t,
    pub device: mach_vm_size_t,
    pub device_peak: mach_vm_size_t,
    pub internal: mach_vm_size_t,
    pub internal_peak: mach_vm_size_t,
    pub external: mach_vm_size_t,
    pub external_peak: mach_vm_size_t,
    pub reusable: mach_vm_size_t,
    pub reusable_peak: mach_vm_size_t,
    pub purgeable_volatile_pmap: mach_vm_size_t,
    pub purgeable_volatile_resident: mach_vm_size_t,
    pub purgeable_volatile_virtual: mach_vm_size_t,
    pub compressed: mach_vm_size_t,
    pub compressed_peak: mach_vm_size_t,
    pub compressed_lifetime: mach_vm_size_t,
    pub phys_footprint: mach_vm_size_t,
    pub min_address: mach_vm_address_t,
    pub max_address: mach_vm_address_t,
    pub ledger_phys_footprint_peak: i64,
    pub ledger_purgeable_nonvolatile: i64,
    pub ledger_purgeable_novolatile_compressed: i64,
    pub ledger_purgeable_volatile: i64,
    pub ledger_purgeable_volatile_compressed: i64,
    pub ledger_tag_network_nonvolatile: i64,
    pub ledger_tag_network_nonvolatile_compressed: i64,
    pub ledger_tag_network_volatile: i64,
    pub ledger_tag_network_volatile_compressed: i64,
    pub ledger_tag_media_footprint: i64,
    pub ledger_tag_media_footprint_compressed: i64,
    pub ledger_tag_media_nofootprint: i64,
    pub ledger_tag_media_nofootprint_compressed: i64,
    pub ledger_tag_graphics_footprint: i64,
    pub ledger_tag_graphics_footprint_compressed: i64,
    pub ledger_tag_graphics_nofootprint: i64,
    pub ledger_tag_graphics_nofootprint_compressed: i64,
    pub ledger_tag_neural_footprint: i64,
    pub ledger_tag_neural_footprint_compressed: i64,
    pub ledger_tag_neural_nofootprint: i64,
    pub ledger_tag_neural_nofootprint_compressed: i64,
    pub limit_bytes_remaining: u64,
    pub decompressions: integer_t,
    pub ledger_swapins: i64,
    pub ledger_tag_neural_nofootprint_total: i64,
    pub ledger_tag_neural_nofootprint_peak: i64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_vm_info"][::std::mem::size_of::<task_vm_info>() - 372usize];
    ["Alignment of task_vm_info"][::std::mem::align_of::<task_vm_info>() - 4usize];
    ["Offset of field: task_vm_info::virtual_size"]
        [::std::mem::offset_of!(task_vm_info, virtual_size) - 0usize];
    ["Offset of field: task_vm_info::region_count"]
        [::std::mem::offset_of!(task_vm_info, region_count) - 8usize];
    ["Offset of field: task_vm_info::page_size"]
        [::std::mem::offset_of!(task_vm_info, page_size) - 12usize];
    ["Offset of field: task_vm_info::resident_size"]
        [::std::mem::offset_of!(task_vm_info, resident_size) - 16usize];
    ["Offset of field: task_vm_info::resident_size_peak"]
        [::std::mem::offset_of!(task_vm_info, resident_size_peak) - 24usize];
    ["Offset of field: task_vm_info::device"]
        [::std::mem::offset_of!(task_vm_info, device) - 32usize];
    ["Offset of field: task_vm_info::device_peak"]
        [::std::mem::offset_of!(task_vm_info, device_peak) - 40usize];
    ["Offset of field: task_vm_info::internal"]
        [::std::mem::offset_of!(task_vm_info, internal) - 48usize];
    ["Offset of field: task_vm_info::internal_peak"]
        [::std::mem::offset_of!(task_vm_info, internal_peak) - 56usize];
    ["Offset of field: task_vm_info::external"]
        [::std::mem::offset_of!(task_vm_info, external) - 64usize];
    ["Offset of field: task_vm_info::external_peak"]
        [::std::mem::offset_of!(task_vm_info, external_peak) - 72usize];
    ["Offset of field: task_vm_info::reusable"]
        [::std::mem::offset_of!(task_vm_info, reusable) - 80usize];
    ["Offset of field: task_vm_info::reusable_peak"]
        [::std::mem::offset_of!(task_vm_info, reusable_peak) - 88usize];
    ["Offset of field: task_vm_info::purgeable_volatile_pmap"]
        [::std::mem::offset_of!(task_vm_info, purgeable_volatile_pmap) - 96usize];
    ["Offset of field: task_vm_info::purgeable_volatile_resident"]
        [::std::mem::offset_of!(task_vm_info, purgeable_volatile_resident) - 104usize];
    ["Offset of field: task_vm_info::purgeable_volatile_virtual"]
        [::std::mem::offset_of!(task_vm_info, purgeable_volatile_virtual) - 112usize];
    ["Offset of field: task_vm_info::compressed"]
        [::std::mem::offset_of!(task_vm_info, compressed) - 120usize];
    ["Offset of field: task_vm_info::compressed_peak"]
        [::std::mem::offset_of!(task_vm_info, compressed_peak) - 128usize];
    ["Offset of field: task_vm_info::compressed_lifetime"]
        [::std::mem::offset_of!(task_vm_info, compressed_lifetime) - 136usize];
    ["Offset of field: task_vm_info::phys_footprint"]
        [::std::mem::offset_of!(task_vm_info, phys_footprint) - 144usize];
    ["Offset of field: task_vm_info::min_address"]
        [::std::mem::offset_of!(task_vm_info, min_address) - 152usize];
    ["Offset of field: task_vm_info::max_address"]
        [::std::mem::offset_of!(task_vm_info, max_address) - 160usize];
    ["Offset of field: task_vm_info::ledger_phys_footprint_peak"]
        [::std::mem::offset_of!(task_vm_info, ledger_phys_footprint_peak) - 168usize];
    ["Offset of field: task_vm_info::ledger_purgeable_nonvolatile"]
        [::std::mem::offset_of!(task_vm_info, ledger_purgeable_nonvolatile) - 176usize];
    ["Offset of field: task_vm_info::ledger_purgeable_novolatile_compressed"]
        [::std::mem::offset_of!(task_vm_info, ledger_purgeable_novolatile_compressed) - 184usize];
    ["Offset of field: task_vm_info::ledger_purgeable_volatile"]
        [::std::mem::offset_of!(task_vm_info, ledger_purgeable_volatile) - 192usize];
    ["Offset of field: task_vm_info::ledger_purgeable_volatile_compressed"]
        [::std::mem::offset_of!(task_vm_info, ledger_purgeable_volatile_compressed) - 200usize];
    ["Offset of field: task_vm_info::ledger_tag_network_nonvolatile"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_network_nonvolatile) - 208usize];
    ["Offset of field: task_vm_info::ledger_tag_network_nonvolatile_compressed"][::std::mem::offset_of!(
        task_vm_info,
        ledger_tag_network_nonvolatile_compressed
    ) - 216usize];
    ["Offset of field: task_vm_info::ledger_tag_network_volatile"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_network_volatile) - 224usize];
    ["Offset of field: task_vm_info::ledger_tag_network_volatile_compressed"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_network_volatile_compressed) - 232usize];
    ["Offset of field: task_vm_info::ledger_tag_media_footprint"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_media_footprint) - 240usize];
    ["Offset of field: task_vm_info::ledger_tag_media_footprint_compressed"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_media_footprint_compressed) - 248usize];
    ["Offset of field: task_vm_info::ledger_tag_media_nofootprint"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_media_nofootprint) - 256usize];
    ["Offset of field: task_vm_info::ledger_tag_media_nofootprint_compressed"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_media_nofootprint_compressed) - 264usize];
    ["Offset of field: task_vm_info::ledger_tag_graphics_footprint"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_graphics_footprint) - 272usize];
    ["Offset of field: task_vm_info::ledger_tag_graphics_footprint_compressed"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_graphics_footprint_compressed) - 280usize];
    ["Offset of field: task_vm_info::ledger_tag_graphics_nofootprint"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_graphics_nofootprint) - 288usize];
    ["Offset of field: task_vm_info::ledger_tag_graphics_nofootprint_compressed"][::std::mem::offset_of!(
        task_vm_info,
        ledger_tag_graphics_nofootprint_compressed
    ) - 296usize];
    ["Offset of field: task_vm_info::ledger_tag_neural_footprint"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_neural_footprint) - 304usize];
    ["Offset of field: task_vm_info::ledger_tag_neural_footprint_compressed"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_neural_footprint_compressed) - 312usize];
    ["Offset of field: task_vm_info::ledger_tag_neural_nofootprint"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_neural_nofootprint) - 320usize];
    ["Offset of field: task_vm_info::ledger_tag_neural_nofootprint_compressed"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_neural_nofootprint_compressed) - 328usize];
    ["Offset of field: task_vm_info::limit_bytes_remaining"]
        [::std::mem::offset_of!(task_vm_info, limit_bytes_remaining) - 336usize];
    ["Offset of field: task_vm_info::decompressions"]
        [::std::mem::offset_of!(task_vm_info, decompressions) - 344usize];
    ["Offset of field: task_vm_info::ledger_swapins"]
        [::std::mem::offset_of!(task_vm_info, ledger_swapins) - 348usize];
    ["Offset of field: task_vm_info::ledger_tag_neural_nofootprint_total"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_neural_nofootprint_total) - 356usize];
    ["Offset of field: task_vm_info::ledger_tag_neural_nofootprint_peak"]
        [::std::mem::offset_of!(task_vm_info, ledger_tag_neural_nofootprint_peak) - 364usize];
};
pub type task_vm_info_data_t = task_vm_info;
pub type task_vm_info_t = *mut task_vm_info;
pub type task_purgable_info_t = vm_purgeable_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_trace_memory_info {
    pub user_memory_address: u64,
    pub buffer_size: u64,
    pub mailbox_array_size: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_trace_memory_info"][::std::mem::size_of::<task_trace_memory_info>() - 24usize];
    ["Alignment of task_trace_memory_info"]
        [::std::mem::align_of::<task_trace_memory_info>() - 4usize];
    ["Offset of field: task_trace_memory_info::user_memory_address"]
        [::std::mem::offset_of!(task_trace_memory_info, user_memory_address) - 0usize];
    ["Offset of field: task_trace_memory_info::buffer_size"]
        [::std::mem::offset_of!(task_trace_memory_info, buffer_size) - 8usize];
    ["Offset of field: task_trace_memory_info::mailbox_array_size"]
        [::std::mem::offset_of!(task_trace_memory_info, mailbox_array_size) - 16usize];
};
pub type task_trace_memory_info_data_t = task_trace_memory_info;
pub type task_trace_memory_info_t = *mut task_trace_memory_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_wait_state_info {
    pub total_wait_state_time: u64,
    pub total_wait_sfi_state_time: u64,
    pub _reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_wait_state_info"][::std::mem::size_of::<task_wait_state_info>() - 32usize];
    ["Alignment of task_wait_state_info"][::std::mem::align_of::<task_wait_state_info>() - 4usize];
    ["Offset of field: task_wait_state_info::total_wait_state_time"]
        [::std::mem::offset_of!(task_wait_state_info, total_wait_state_time) - 0usize];
    ["Offset of field: task_wait_state_info::total_wait_sfi_state_time"]
        [::std::mem::offset_of!(task_wait_state_info, total_wait_sfi_state_time) - 8usize];
    ["Offset of field: task_wait_state_info::_reserved"]
        [::std::mem::offset_of!(task_wait_state_info, _reserved) - 16usize];
};
pub type task_wait_state_info_data_t = task_wait_state_info;
pub type task_wait_state_info_t = *mut task_wait_state_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct gpu_energy_data {
    pub task_gpu_utilisation: u64,
    pub task_gpu_stat_reserved0: u64,
    pub task_gpu_stat_reserved1: u64,
    pub task_gpu_stat_reserved2: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gpu_energy_data"][::std::mem::size_of::<gpu_energy_data>() - 32usize];
    ["Alignment of gpu_energy_data"][::std::mem::align_of::<gpu_energy_data>() - 4usize];
    ["Offset of field: gpu_energy_data::task_gpu_utilisation"]
        [::std::mem::offset_of!(gpu_energy_data, task_gpu_utilisation) - 0usize];
    ["Offset of field: gpu_energy_data::task_gpu_stat_reserved0"]
        [::std::mem::offset_of!(gpu_energy_data, task_gpu_stat_reserved0) - 8usize];
    ["Offset of field: gpu_energy_data::task_gpu_stat_reserved1"]
        [::std::mem::offset_of!(gpu_energy_data, task_gpu_stat_reserved1) - 16usize];
    ["Offset of field: gpu_energy_data::task_gpu_stat_reserved2"]
        [::std::mem::offset_of!(gpu_energy_data, task_gpu_stat_reserved2) - 24usize];
};
pub type gpu_energy_data_t = *mut gpu_energy_data;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct task_power_info_v2 {
    pub cpu_energy: task_power_info_data_t,
    pub gpu_energy: gpu_energy_data,
    pub task_energy: u64,
    pub task_ptime: u64,
    pub task_pset_switches: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_power_info_v2"][::std::mem::size_of::<task_power_info_v2>() - 104usize];
    ["Alignment of task_power_info_v2"][::std::mem::align_of::<task_power_info_v2>() - 4usize];
    ["Offset of field: task_power_info_v2::cpu_energy"]
        [::std::mem::offset_of!(task_power_info_v2, cpu_energy) - 0usize];
    ["Offset of field: task_power_info_v2::gpu_energy"]
        [::std::mem::offset_of!(task_power_info_v2, gpu_energy) - 48usize];
    ["Offset of field: task_power_info_v2::task_energy"]
        [::std::mem::offset_of!(task_power_info_v2, task_energy) - 80usize];
    ["Offset of field: task_power_info_v2::task_ptime"]
        [::std::mem::offset_of!(task_power_info_v2, task_ptime) - 88usize];
    ["Offset of field: task_power_info_v2::task_pset_switches"]
        [::std::mem::offset_of!(task_power_info_v2, task_pset_switches) - 96usize];
};
pub type task_power_info_v2_data_t = task_power_info_v2;
pub type task_power_info_v2_t = *mut task_power_info_v2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_flags_info {
    pub flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_flags_info"][::std::mem::size_of::<task_flags_info>() - 4usize];
    ["Alignment of task_flags_info"][::std::mem::align_of::<task_flags_info>() - 4usize];
    ["Offset of field: task_flags_info::flags"]
        [::std::mem::offset_of!(task_flags_info, flags) - 0usize];
};
pub type task_flags_info_data_t = task_flags_info;
pub type task_flags_info_t = *mut task_flags_info;
pub type task_exc_guard_behavior_t = u32;
pub type task_corpse_forking_behavior_t = u32;
pub type task_inspect_flavor_t = natural_t;
pub const task_inspect_flavor_TASK_INSPECT_BASIC_COUNTS: task_inspect_flavor = 1;
pub type task_inspect_flavor = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_inspect_basic_counts {
    pub instructions: u64,
    pub cycles: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_inspect_basic_counts"]
        [::std::mem::size_of::<task_inspect_basic_counts>() - 16usize];
    ["Alignment of task_inspect_basic_counts"]
        [::std::mem::align_of::<task_inspect_basic_counts>() - 8usize];
    ["Offset of field: task_inspect_basic_counts::instructions"]
        [::std::mem::offset_of!(task_inspect_basic_counts, instructions) - 0usize];
    ["Offset of field: task_inspect_basic_counts::cycles"]
        [::std::mem::offset_of!(task_inspect_basic_counts, cycles) - 8usize];
};
pub type task_inspect_basic_counts_data_t = task_inspect_basic_counts;
pub type task_inspect_basic_counts_t = *mut task_inspect_basic_counts;
pub type task_inspect_info_t = *mut integer_t;
pub type task_policy_flavor_t = natural_t;
pub type task_policy_t = *mut integer_t;
pub const task_role_TASK_RENICED: task_role = -1;
pub const task_role_TASK_UNSPECIFIED: task_role = 0;
pub const task_role_TASK_FOREGROUND_APPLICATION: task_role = 1;
pub const task_role_TASK_BACKGROUND_APPLICATION: task_role = 2;
pub const task_role_TASK_CONTROL_APPLICATION: task_role = 3;
pub const task_role_TASK_GRAPHICS_SERVER: task_role = 4;
pub const task_role_TASK_THROTTLE_APPLICATION: task_role = 5;
pub const task_role_TASK_NONUI_APPLICATION: task_role = 6;
pub const task_role_TASK_DEFAULT_APPLICATION: task_role = 7;
pub const task_role_TASK_DARWINBG_APPLICATION: task_role = 8;
pub type task_role = ::std::os::raw::c_int;
pub use self::task_role as task_role_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_category_policy {
    pub role: task_role_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_category_policy"][::std::mem::size_of::<task_category_policy>() - 4usize];
    ["Alignment of task_category_policy"][::std::mem::align_of::<task_category_policy>() - 4usize];
    ["Offset of field: task_category_policy::role"]
        [::std::mem::offset_of!(task_category_policy, role) - 0usize];
};
pub type task_category_policy_data_t = task_category_policy;
pub type task_category_policy_t = *mut task_category_policy;
pub const task_latency_qos_LATENCY_QOS_TIER_UNSPECIFIED: task_latency_qos = 0;
pub const task_latency_qos_LATENCY_QOS_TIER_0: task_latency_qos = 16711681;
pub const task_latency_qos_LATENCY_QOS_TIER_1: task_latency_qos = 16711682;
pub const task_latency_qos_LATENCY_QOS_TIER_2: task_latency_qos = 16711683;
pub const task_latency_qos_LATENCY_QOS_TIER_3: task_latency_qos = 16711684;
pub const task_latency_qos_LATENCY_QOS_TIER_4: task_latency_qos = 16711685;
pub const task_latency_qos_LATENCY_QOS_TIER_5: task_latency_qos = 16711686;
pub type task_latency_qos = ::std::os::raw::c_uint;
pub type task_latency_qos_t = integer_t;
pub const task_throughput_qos_THROUGHPUT_QOS_TIER_UNSPECIFIED: task_throughput_qos = 0;
pub const task_throughput_qos_THROUGHPUT_QOS_TIER_0: task_throughput_qos = 16646145;
pub const task_throughput_qos_THROUGHPUT_QOS_TIER_1: task_throughput_qos = 16646146;
pub const task_throughput_qos_THROUGHPUT_QOS_TIER_2: task_throughput_qos = 16646147;
pub const task_throughput_qos_THROUGHPUT_QOS_TIER_3: task_throughput_qos = 16646148;
pub const task_throughput_qos_THROUGHPUT_QOS_TIER_4: task_throughput_qos = 16646149;
pub const task_throughput_qos_THROUGHPUT_QOS_TIER_5: task_throughput_qos = 16646150;
pub type task_throughput_qos = ::std::os::raw::c_uint;
pub type task_throughput_qos_t = integer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_qos_policy {
    pub task_latency_qos_tier: task_latency_qos_t,
    pub task_throughput_qos_tier: task_throughput_qos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_qos_policy"][::std::mem::size_of::<task_qos_policy>() - 8usize];
    ["Alignment of task_qos_policy"][::std::mem::align_of::<task_qos_policy>() - 4usize];
    ["Offset of field: task_qos_policy::task_latency_qos_tier"]
        [::std::mem::offset_of!(task_qos_policy, task_latency_qos_tier) - 0usize];
    ["Offset of field: task_qos_policy::task_throughput_qos_tier"]
        [::std::mem::offset_of!(task_qos_policy, task_throughput_qos_tier) - 4usize];
};
pub type task_qos_policy_t = *mut task_qos_policy;
pub type task_special_port_t = ::std::os::raw::c_int;
pub type thread_flavor_t = natural_t;
pub type thread_info_t = *mut integer_t;
pub type thread_info_data_t = [integer_t; 32usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_basic_info {
    pub user_time: time_value_t,
    pub system_time: time_value_t,
    pub cpu_usage: integer_t,
    pub policy: policy_t,
    pub run_state: integer_t,
    pub flags: integer_t,
    pub suspend_count: integer_t,
    pub sleep_time: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_basic_info"][::std::mem::size_of::<thread_basic_info>() - 40usize];
    ["Alignment of thread_basic_info"][::std::mem::align_of::<thread_basic_info>() - 4usize];
    ["Offset of field: thread_basic_info::user_time"]
        [::std::mem::offset_of!(thread_basic_info, user_time) - 0usize];
    ["Offset of field: thread_basic_info::system_time"]
        [::std::mem::offset_of!(thread_basic_info, system_time) - 8usize];
    ["Offset of field: thread_basic_info::cpu_usage"]
        [::std::mem::offset_of!(thread_basic_info, cpu_usage) - 16usize];
    ["Offset of field: thread_basic_info::policy"]
        [::std::mem::offset_of!(thread_basic_info, policy) - 20usize];
    ["Offset of field: thread_basic_info::run_state"]
        [::std::mem::offset_of!(thread_basic_info, run_state) - 24usize];
    ["Offset of field: thread_basic_info::flags"]
        [::std::mem::offset_of!(thread_basic_info, flags) - 28usize];
    ["Offset of field: thread_basic_info::suspend_count"]
        [::std::mem::offset_of!(thread_basic_info, suspend_count) - 32usize];
    ["Offset of field: thread_basic_info::sleep_time"]
        [::std::mem::offset_of!(thread_basic_info, sleep_time) - 36usize];
};
pub type thread_basic_info_data_t = thread_basic_info;
pub type thread_basic_info_t = *mut thread_basic_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_identifier_info {
    pub thread_id: u64,
    pub thread_handle: u64,
    pub dispatch_qaddr: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_identifier_info"][::std::mem::size_of::<thread_identifier_info>() - 24usize];
    ["Alignment of thread_identifier_info"]
        [::std::mem::align_of::<thread_identifier_info>() - 8usize];
    ["Offset of field: thread_identifier_info::thread_id"]
        [::std::mem::offset_of!(thread_identifier_info, thread_id) - 0usize];
    ["Offset of field: thread_identifier_info::thread_handle"]
        [::std::mem::offset_of!(thread_identifier_info, thread_handle) - 8usize];
    ["Offset of field: thread_identifier_info::dispatch_qaddr"]
        [::std::mem::offset_of!(thread_identifier_info, dispatch_qaddr) - 16usize];
};
pub type thread_identifier_info_data_t = thread_identifier_info;
pub type thread_identifier_info_t = *mut thread_identifier_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_extended_info {
    pub pth_user_time: u64,
    pub pth_system_time: u64,
    pub pth_cpu_usage: i32,
    pub pth_policy: i32,
    pub pth_run_state: i32,
    pub pth_flags: i32,
    pub pth_sleep_time: i32,
    pub pth_curpri: i32,
    pub pth_priority: i32,
    pub pth_maxpriority: i32,
    pub pth_name: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_extended_info"][::std::mem::size_of::<thread_extended_info>() - 112usize];
    ["Alignment of thread_extended_info"][::std::mem::align_of::<thread_extended_info>() - 8usize];
    ["Offset of field: thread_extended_info::pth_user_time"]
        [::std::mem::offset_of!(thread_extended_info, pth_user_time) - 0usize];
    ["Offset of field: thread_extended_info::pth_system_time"]
        [::std::mem::offset_of!(thread_extended_info, pth_system_time) - 8usize];
    ["Offset of field: thread_extended_info::pth_cpu_usage"]
        [::std::mem::offset_of!(thread_extended_info, pth_cpu_usage) - 16usize];
    ["Offset of field: thread_extended_info::pth_policy"]
        [::std::mem::offset_of!(thread_extended_info, pth_policy) - 20usize];
    ["Offset of field: thread_extended_info::pth_run_state"]
        [::std::mem::offset_of!(thread_extended_info, pth_run_state) - 24usize];
    ["Offset of field: thread_extended_info::pth_flags"]
        [::std::mem::offset_of!(thread_extended_info, pth_flags) - 28usize];
    ["Offset of field: thread_extended_info::pth_sleep_time"]
        [::std::mem::offset_of!(thread_extended_info, pth_sleep_time) - 32usize];
    ["Offset of field: thread_extended_info::pth_curpri"]
        [::std::mem::offset_of!(thread_extended_info, pth_curpri) - 36usize];
    ["Offset of field: thread_extended_info::pth_priority"]
        [::std::mem::offset_of!(thread_extended_info, pth_priority) - 40usize];
    ["Offset of field: thread_extended_info::pth_maxpriority"]
        [::std::mem::offset_of!(thread_extended_info, pth_maxpriority) - 44usize];
    ["Offset of field: thread_extended_info::pth_name"]
        [::std::mem::offset_of!(thread_extended_info, pth_name) - 48usize];
};
pub type thread_extended_info_data_t = thread_extended_info;
pub type thread_extended_info_t = *mut thread_extended_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct io_stat_entry {
    pub count: u64,
    pub size: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_stat_entry"][::std::mem::size_of::<io_stat_entry>() - 16usize];
    ["Alignment of io_stat_entry"][::std::mem::align_of::<io_stat_entry>() - 8usize];
    ["Offset of field: io_stat_entry::count"]
        [::std::mem::offset_of!(io_stat_entry, count) - 0usize];
    ["Offset of field: io_stat_entry::size"][::std::mem::offset_of!(io_stat_entry, size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct io_stat_info {
    pub disk_reads: io_stat_entry,
    pub io_priority: [io_stat_entry; 4usize],
    pub paging: io_stat_entry,
    pub metadata: io_stat_entry,
    pub total_io: io_stat_entry,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_stat_info"][::std::mem::size_of::<io_stat_info>() - 128usize];
    ["Alignment of io_stat_info"][::std::mem::align_of::<io_stat_info>() - 8usize];
    ["Offset of field: io_stat_info::disk_reads"]
        [::std::mem::offset_of!(io_stat_info, disk_reads) - 0usize];
    ["Offset of field: io_stat_info::io_priority"]
        [::std::mem::offset_of!(io_stat_info, io_priority) - 16usize];
    ["Offset of field: io_stat_info::paging"]
        [::std::mem::offset_of!(io_stat_info, paging) - 80usize];
    ["Offset of field: io_stat_info::metadata"]
        [::std::mem::offset_of!(io_stat_info, metadata) - 96usize];
    ["Offset of field: io_stat_info::total_io"]
        [::std::mem::offset_of!(io_stat_info, total_io) - 112usize];
};
pub type io_stat_info_t = *mut io_stat_info;
pub type thread_policy_flavor_t = natural_t;
pub type thread_policy_t = *mut integer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_standard_policy {
    pub no_data: natural_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_standard_policy"][::std::mem::size_of::<thread_standard_policy>() - 4usize];
    ["Alignment of thread_standard_policy"]
        [::std::mem::align_of::<thread_standard_policy>() - 4usize];
    ["Offset of field: thread_standard_policy::no_data"]
        [::std::mem::offset_of!(thread_standard_policy, no_data) - 0usize];
};
pub type thread_standard_policy_data_t = thread_standard_policy;
pub type thread_standard_policy_t = *mut thread_standard_policy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_extended_policy {
    pub timeshare: boolean_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_extended_policy"][::std::mem::size_of::<thread_extended_policy>() - 4usize];
    ["Alignment of thread_extended_policy"]
        [::std::mem::align_of::<thread_extended_policy>() - 4usize];
    ["Offset of field: thread_extended_policy::timeshare"]
        [::std::mem::offset_of!(thread_extended_policy, timeshare) - 0usize];
};
pub type thread_extended_policy_data_t = thread_extended_policy;
pub type thread_extended_policy_t = *mut thread_extended_policy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_time_constraint_policy {
    pub period: u32,
    pub computation: u32,
    pub constraint: u32,
    pub preemptible: boolean_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_time_constraint_policy"]
        [::std::mem::size_of::<thread_time_constraint_policy>() - 16usize];
    ["Alignment of thread_time_constraint_policy"]
        [::std::mem::align_of::<thread_time_constraint_policy>() - 4usize];
    ["Offset of field: thread_time_constraint_policy::period"]
        [::std::mem::offset_of!(thread_time_constraint_policy, period) - 0usize];
    ["Offset of field: thread_time_constraint_policy::computation"]
        [::std::mem::offset_of!(thread_time_constraint_policy, computation) - 4usize];
    ["Offset of field: thread_time_constraint_policy::constraint"]
        [::std::mem::offset_of!(thread_time_constraint_policy, constraint) - 8usize];
    ["Offset of field: thread_time_constraint_policy::preemptible"]
        [::std::mem::offset_of!(thread_time_constraint_policy, preemptible) - 12usize];
};
pub type thread_time_constraint_policy_data_t = thread_time_constraint_policy;
pub type thread_time_constraint_policy_t = *mut thread_time_constraint_policy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_precedence_policy {
    pub importance: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_precedence_policy"]
        [::std::mem::size_of::<thread_precedence_policy>() - 4usize];
    ["Alignment of thread_precedence_policy"]
        [::std::mem::align_of::<thread_precedence_policy>() - 4usize];
    ["Offset of field: thread_precedence_policy::importance"]
        [::std::mem::offset_of!(thread_precedence_policy, importance) - 0usize];
};
pub type thread_precedence_policy_data_t = thread_precedence_policy;
pub type thread_precedence_policy_t = *mut thread_precedence_policy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_affinity_policy {
    pub affinity_tag: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_affinity_policy"][::std::mem::size_of::<thread_affinity_policy>() - 4usize];
    ["Alignment of thread_affinity_policy"]
        [::std::mem::align_of::<thread_affinity_policy>() - 4usize];
    ["Offset of field: thread_affinity_policy::affinity_tag"]
        [::std::mem::offset_of!(thread_affinity_policy, affinity_tag) - 0usize];
};
pub type thread_affinity_policy_data_t = thread_affinity_policy;
pub type thread_affinity_policy_t = *mut thread_affinity_policy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_background_policy {
    pub priority: integer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_background_policy"]
        [::std::mem::size_of::<thread_background_policy>() - 4usize];
    ["Alignment of thread_background_policy"]
        [::std::mem::align_of::<thread_background_policy>() - 4usize];
    ["Offset of field: thread_background_policy::priority"]
        [::std::mem::offset_of!(thread_background_policy, priority) - 0usize];
};
pub type thread_background_policy_data_t = thread_background_policy;
pub type thread_background_policy_t = *mut thread_background_policy;
pub type thread_latency_qos_t = integer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_latency_qos_policy {
    pub thread_latency_qos_tier: thread_latency_qos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_latency_qos_policy"]
        [::std::mem::size_of::<thread_latency_qos_policy>() - 4usize];
    ["Alignment of thread_latency_qos_policy"]
        [::std::mem::align_of::<thread_latency_qos_policy>() - 4usize];
    ["Offset of field: thread_latency_qos_policy::thread_latency_qos_tier"]
        [::std::mem::offset_of!(thread_latency_qos_policy, thread_latency_qos_tier) - 0usize];
};
pub type thread_latency_qos_policy_data_t = thread_latency_qos_policy;
pub type thread_latency_qos_policy_t = *mut thread_latency_qos_policy;
pub type thread_throughput_qos_t = integer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct thread_throughput_qos_policy {
    pub thread_throughput_qos_tier: thread_throughput_qos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of thread_throughput_qos_policy"]
        [::std::mem::size_of::<thread_throughput_qos_policy>() - 4usize];
    ["Alignment of thread_throughput_qos_policy"]
        [::std::mem::align_of::<thread_throughput_qos_policy>() - 4usize];
    ["Offset of field: thread_throughput_qos_policy::thread_throughput_qos_tier"]
        [::std::mem::offset_of!(thread_throughput_qos_policy, thread_throughput_qos_tier) - 0usize];
};
pub type thread_throughput_qos_policy_data_t = thread_throughput_qos_policy;
pub type thread_throughput_qos_policy_t = *mut thread_throughput_qos_policy;
pub type alarm_type_t = ::std::os::raw::c_int;
pub type sleep_type_t = ::std::os::raw::c_int;
pub type clock_id_t = ::std::os::raw::c_int;
pub type clock_flavor_t = ::std::os::raw::c_int;
pub type clock_attr_t = *mut ::std::os::raw::c_int;
pub type clock_res_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_timespec {
    pub tv_sec: ::std::os::raw::c_uint,
    pub tv_nsec: clock_res_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_timespec"][::std::mem::size_of::<mach_timespec>() - 8usize];
    ["Alignment of mach_timespec"][::std::mem::align_of::<mach_timespec>() - 4usize];
    ["Offset of field: mach_timespec::tv_sec"]
        [::std::mem::offset_of!(mach_timespec, tv_sec) - 0usize];
    ["Offset of field: mach_timespec::tv_nsec"]
        [::std::mem::offset_of!(mach_timespec, tv_nsec) - 4usize];
};
pub type mach_timespec_t = mach_timespec;
pub type vm_machine_attribute_t = ::std::os::raw::c_uint;
pub type vm_machine_attribute_val_t = ::std::os::raw::c_int;
pub type vm_inherit_t = ::std::os::raw::c_uint;
pub type vm_purgable_t = ::std::os::raw::c_int;
pub type vm_behavior_t = ::std::os::raw::c_int;
extern "C" {
    pub static mut vm_page_size: vm_size_t;
}
extern "C" {
    pub static mut vm_page_mask: vm_size_t;
}
extern "C" {
    pub static mut vm_page_shift: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut vm_kernel_page_size: vm_size_t;
}
extern "C" {
    pub static mut vm_kernel_page_mask: vm_size_t;
}
extern "C" {
    pub static mut vm_kernel_page_shift: ::std::os::raw::c_int;
}
pub type vm32_object_id_t = u32;
pub type vm_region_info_t = *mut ::std::os::raw::c_int;
pub type vm_region_info_64_t = *mut ::std::os::raw::c_int;
pub type vm_region_recurse_info_t = *mut ::std::os::raw::c_int;
pub type vm_region_recurse_info_64_t = *mut ::std::os::raw::c_int;
pub type vm_region_flavor_t = ::std::os::raw::c_int;
pub type vm_region_info_data_t = [::std::os::raw::c_int; 1024usize];
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct vm_region_basic_info_64 {
    pub protection: vm_prot_t,
    pub max_protection: vm_prot_t,
    pub inheritance: vm_inherit_t,
    pub shared: boolean_t,
    pub reserved: boolean_t,
    pub offset: memory_object_offset_t,
    pub behavior: vm_behavior_t,
    pub user_wired_count: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_region_basic_info_64"][::std::mem::size_of::<vm_region_basic_info_64>() - 36usize];
    ["Alignment of vm_region_basic_info_64"]
        [::std::mem::align_of::<vm_region_basic_info_64>() - 4usize];
    ["Offset of field: vm_region_basic_info_64::protection"]
        [::std::mem::offset_of!(vm_region_basic_info_64, protection) - 0usize];
    ["Offset of field: vm_region_basic_info_64::max_protection"]
        [::std::mem::offset_of!(vm_region_basic_info_64, max_protection) - 4usize];
    ["Offset of field: vm_region_basic_info_64::inheritance"]
        [::std::mem::offset_of!(vm_region_basic_info_64, inheritance) - 8usize];
    ["Offset of field: vm_region_basic_info_64::shared"]
        [::std::mem::offset_of!(vm_region_basic_info_64, shared) - 12usize];
    ["Offset of field: vm_region_basic_info_64::reserved"]
        [::std::mem::offset_of!(vm_region_basic_info_64, reserved) - 16usize];
    ["Offset of field: vm_region_basic_info_64::offset"]
        [::std::mem::offset_of!(vm_region_basic_info_64, offset) - 20usize];
    ["Offset of field: vm_region_basic_info_64::behavior"]
        [::std::mem::offset_of!(vm_region_basic_info_64, behavior) - 28usize];
    ["Offset of field: vm_region_basic_info_64::user_wired_count"]
        [::std::mem::offset_of!(vm_region_basic_info_64, user_wired_count) - 32usize];
};
pub type vm_region_basic_info_64_t = *mut vm_region_basic_info_64;
pub type vm_region_basic_info_data_64_t = vm_region_basic_info_64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_region_basic_info {
    pub protection: vm_prot_t,
    pub max_protection: vm_prot_t,
    pub inheritance: vm_inherit_t,
    pub shared: boolean_t,
    pub reserved: boolean_t,
    pub offset: u32,
    pub behavior: vm_behavior_t,
    pub user_wired_count: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_region_basic_info"][::std::mem::size_of::<vm_region_basic_info>() - 32usize];
    ["Alignment of vm_region_basic_info"][::std::mem::align_of::<vm_region_basic_info>() - 4usize];
    ["Offset of field: vm_region_basic_info::protection"]
        [::std::mem::offset_of!(vm_region_basic_info, protection) - 0usize];
    ["Offset of field: vm_region_basic_info::max_protection"]
        [::std::mem::offset_of!(vm_region_basic_info, max_protection) - 4usize];
    ["Offset of field: vm_region_basic_info::inheritance"]
        [::std::mem::offset_of!(vm_region_basic_info, inheritance) - 8usize];
    ["Offset of field: vm_region_basic_info::shared"]
        [::std::mem::offset_of!(vm_region_basic_info, shared) - 12usize];
    ["Offset of field: vm_region_basic_info::reserved"]
        [::std::mem::offset_of!(vm_region_basic_info, reserved) - 16usize];
    ["Offset of field: vm_region_basic_info::offset"]
        [::std::mem::offset_of!(vm_region_basic_info, offset) - 20usize];
    ["Offset of field: vm_region_basic_info::behavior"]
        [::std::mem::offset_of!(vm_region_basic_info, behavior) - 24usize];
    ["Offset of field: vm_region_basic_info::user_wired_count"]
        [::std::mem::offset_of!(vm_region_basic_info, user_wired_count) - 28usize];
};
pub type vm_region_basic_info_t = *mut vm_region_basic_info;
pub type vm_region_basic_info_data_t = vm_region_basic_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_region_extended_info {
    pub protection: vm_prot_t,
    pub user_tag: ::std::os::raw::c_uint,
    pub pages_resident: ::std::os::raw::c_uint,
    pub pages_shared_now_private: ::std::os::raw::c_uint,
    pub pages_swapped_out: ::std::os::raw::c_uint,
    pub pages_dirtied: ::std::os::raw::c_uint,
    pub ref_count: ::std::os::raw::c_uint,
    pub shadow_depth: ::std::os::raw::c_ushort,
    pub external_pager: ::std::os::raw::c_uchar,
    pub share_mode: ::std::os::raw::c_uchar,
    pub pages_reusable: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_region_extended_info"][::std::mem::size_of::<vm_region_extended_info>() - 36usize];
    ["Alignment of vm_region_extended_info"]
        [::std::mem::align_of::<vm_region_extended_info>() - 4usize];
    ["Offset of field: vm_region_extended_info::protection"]
        [::std::mem::offset_of!(vm_region_extended_info, protection) - 0usize];
    ["Offset of field: vm_region_extended_info::user_tag"]
        [::std::mem::offset_of!(vm_region_extended_info, user_tag) - 4usize];
    ["Offset of field: vm_region_extended_info::pages_resident"]
        [::std::mem::offset_of!(vm_region_extended_info, pages_resident) - 8usize];
    ["Offset of field: vm_region_extended_info::pages_shared_now_private"]
        [::std::mem::offset_of!(vm_region_extended_info, pages_shared_now_private) - 12usize];
    ["Offset of field: vm_region_extended_info::pages_swapped_out"]
        [::std::mem::offset_of!(vm_region_extended_info, pages_swapped_out) - 16usize];
    ["Offset of field: vm_region_extended_info::pages_dirtied"]
        [::std::mem::offset_of!(vm_region_extended_info, pages_dirtied) - 20usize];
    ["Offset of field: vm_region_extended_info::ref_count"]
        [::std::mem::offset_of!(vm_region_extended_info, ref_count) - 24usize];
    ["Offset of field: vm_region_extended_info::shadow_depth"]
        [::std::mem::offset_of!(vm_region_extended_info, shadow_depth) - 28usize];
    ["Offset of field: vm_region_extended_info::external_pager"]
        [::std::mem::offset_of!(vm_region_extended_info, external_pager) - 30usize];
    ["Offset of field: vm_region_extended_info::share_mode"]
        [::std::mem::offset_of!(vm_region_extended_info, share_mode) - 31usize];
    ["Offset of field: vm_region_extended_info::pages_reusable"]
        [::std::mem::offset_of!(vm_region_extended_info, pages_reusable) - 32usize];
};
pub type vm_region_extended_info_t = *mut vm_region_extended_info;
pub type vm_region_extended_info_data_t = vm_region_extended_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_region_top_info {
    pub obj_id: ::std::os::raw::c_uint,
    pub ref_count: ::std::os::raw::c_uint,
    pub private_pages_resident: ::std::os::raw::c_uint,
    pub shared_pages_resident: ::std::os::raw::c_uint,
    pub share_mode: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_region_top_info"][::std::mem::size_of::<vm_region_top_info>() - 20usize];
    ["Alignment of vm_region_top_info"][::std::mem::align_of::<vm_region_top_info>() - 4usize];
    ["Offset of field: vm_region_top_info::obj_id"]
        [::std::mem::offset_of!(vm_region_top_info, obj_id) - 0usize];
    ["Offset of field: vm_region_top_info::ref_count"]
        [::std::mem::offset_of!(vm_region_top_info, ref_count) - 4usize];
    ["Offset of field: vm_region_top_info::private_pages_resident"]
        [::std::mem::offset_of!(vm_region_top_info, private_pages_resident) - 8usize];
    ["Offset of field: vm_region_top_info::shared_pages_resident"]
        [::std::mem::offset_of!(vm_region_top_info, shared_pages_resident) - 12usize];
    ["Offset of field: vm_region_top_info::share_mode"]
        [::std::mem::offset_of!(vm_region_top_info, share_mode) - 16usize];
};
pub type vm_region_top_info_t = *mut vm_region_top_info;
pub type vm_region_top_info_data_t = vm_region_top_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_region_submap_info {
    pub protection: vm_prot_t,
    pub max_protection: vm_prot_t,
    pub inheritance: vm_inherit_t,
    pub offset: u32,
    pub user_tag: ::std::os::raw::c_uint,
    pub pages_resident: ::std::os::raw::c_uint,
    pub pages_shared_now_private: ::std::os::raw::c_uint,
    pub pages_swapped_out: ::std::os::raw::c_uint,
    pub pages_dirtied: ::std::os::raw::c_uint,
    pub ref_count: ::std::os::raw::c_uint,
    pub shadow_depth: ::std::os::raw::c_ushort,
    pub external_pager: ::std::os::raw::c_uchar,
    pub share_mode: ::std::os::raw::c_uchar,
    pub is_submap: boolean_t,
    pub behavior: vm_behavior_t,
    pub object_id: vm32_object_id_t,
    pub user_wired_count: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_region_submap_info"][::std::mem::size_of::<vm_region_submap_info>() - 60usize];
    ["Alignment of vm_region_submap_info"]
        [::std::mem::align_of::<vm_region_submap_info>() - 4usize];
    ["Offset of field: vm_region_submap_info::protection"]
        [::std::mem::offset_of!(vm_region_submap_info, protection) - 0usize];
    ["Offset of field: vm_region_submap_info::max_protection"]
        [::std::mem::offset_of!(vm_region_submap_info, max_protection) - 4usize];
    ["Offset of field: vm_region_submap_info::inheritance"]
        [::std::mem::offset_of!(vm_region_submap_info, inheritance) - 8usize];
    ["Offset of field: vm_region_submap_info::offset"]
        [::std::mem::offset_of!(vm_region_submap_info, offset) - 12usize];
    ["Offset of field: vm_region_submap_info::user_tag"]
        [::std::mem::offset_of!(vm_region_submap_info, user_tag) - 16usize];
    ["Offset of field: vm_region_submap_info::pages_resident"]
        [::std::mem::offset_of!(vm_region_submap_info, pages_resident) - 20usize];
    ["Offset of field: vm_region_submap_info::pages_shared_now_private"]
        [::std::mem::offset_of!(vm_region_submap_info, pages_shared_now_private) - 24usize];
    ["Offset of field: vm_region_submap_info::pages_swapped_out"]
        [::std::mem::offset_of!(vm_region_submap_info, pages_swapped_out) - 28usize];
    ["Offset of field: vm_region_submap_info::pages_dirtied"]
        [::std::mem::offset_of!(vm_region_submap_info, pages_dirtied) - 32usize];
    ["Offset of field: vm_region_submap_info::ref_count"]
        [::std::mem::offset_of!(vm_region_submap_info, ref_count) - 36usize];
    ["Offset of field: vm_region_submap_info::shadow_depth"]
        [::std::mem::offset_of!(vm_region_submap_info, shadow_depth) - 40usize];
    ["Offset of field: vm_region_submap_info::external_pager"]
        [::std::mem::offset_of!(vm_region_submap_info, external_pager) - 42usize];
    ["Offset of field: vm_region_submap_info::share_mode"]
        [::std::mem::offset_of!(vm_region_submap_info, share_mode) - 43usize];
    ["Offset of field: vm_region_submap_info::is_submap"]
        [::std::mem::offset_of!(vm_region_submap_info, is_submap) - 44usize];
    ["Offset of field: vm_region_submap_info::behavior"]
        [::std::mem::offset_of!(vm_region_submap_info, behavior) - 48usize];
    ["Offset of field: vm_region_submap_info::object_id"]
        [::std::mem::offset_of!(vm_region_submap_info, object_id) - 52usize];
    ["Offset of field: vm_region_submap_info::user_wired_count"]
        [::std::mem::offset_of!(vm_region_submap_info, user_wired_count) - 56usize];
};
pub type vm_region_submap_info_t = *mut vm_region_submap_info;
pub type vm_region_submap_info_data_t = vm_region_submap_info;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct vm_region_submap_info_64 {
    pub protection: vm_prot_t,
    pub max_protection: vm_prot_t,
    pub inheritance: vm_inherit_t,
    pub offset: memory_object_offset_t,
    pub user_tag: ::std::os::raw::c_uint,
    pub pages_resident: ::std::os::raw::c_uint,
    pub pages_shared_now_private: ::std::os::raw::c_uint,
    pub pages_swapped_out: ::std::os::raw::c_uint,
    pub pages_dirtied: ::std::os::raw::c_uint,
    pub ref_count: ::std::os::raw::c_uint,
    pub shadow_depth: ::std::os::raw::c_ushort,
    pub external_pager: ::std::os::raw::c_uchar,
    pub share_mode: ::std::os::raw::c_uchar,
    pub is_submap: boolean_t,
    pub behavior: vm_behavior_t,
    pub object_id: vm32_object_id_t,
    pub user_wired_count: ::std::os::raw::c_ushort,
    pub pages_reusable: ::std::os::raw::c_uint,
    pub object_id_full: vm_object_id_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_region_submap_info_64"]
        [::std::mem::size_of::<vm_region_submap_info_64>() - 76usize];
    ["Alignment of vm_region_submap_info_64"]
        [::std::mem::align_of::<vm_region_submap_info_64>() - 4usize];
    ["Offset of field: vm_region_submap_info_64::protection"]
        [::std::mem::offset_of!(vm_region_submap_info_64, protection) - 0usize];
    ["Offset of field: vm_region_submap_info_64::max_protection"]
        [::std::mem::offset_of!(vm_region_submap_info_64, max_protection) - 4usize];
    ["Offset of field: vm_region_submap_info_64::inheritance"]
        [::std::mem::offset_of!(vm_region_submap_info_64, inheritance) - 8usize];
    ["Offset of field: vm_region_submap_info_64::offset"]
        [::std::mem::offset_of!(vm_region_submap_info_64, offset) - 12usize];
    ["Offset of field: vm_region_submap_info_64::user_tag"]
        [::std::mem::offset_of!(vm_region_submap_info_64, user_tag) - 20usize];
    ["Offset of field: vm_region_submap_info_64::pages_resident"]
        [::std::mem::offset_of!(vm_region_submap_info_64, pages_resident) - 24usize];
    ["Offset of field: vm_region_submap_info_64::pages_shared_now_private"]
        [::std::mem::offset_of!(vm_region_submap_info_64, pages_shared_now_private) - 28usize];
    ["Offset of field: vm_region_submap_info_64::pages_swapped_out"]
        [::std::mem::offset_of!(vm_region_submap_info_64, pages_swapped_out) - 32usize];
    ["Offset of field: vm_region_submap_info_64::pages_dirtied"]
        [::std::mem::offset_of!(vm_region_submap_info_64, pages_dirtied) - 36usize];
    ["Offset of field: vm_region_submap_info_64::ref_count"]
        [::std::mem::offset_of!(vm_region_submap_info_64, ref_count) - 40usize];
    ["Offset of field: vm_region_submap_info_64::shadow_depth"]
        [::std::mem::offset_of!(vm_region_submap_info_64, shadow_depth) - 44usize];
    ["Offset of field: vm_region_submap_info_64::external_pager"]
        [::std::mem::offset_of!(vm_region_submap_info_64, external_pager) - 46usize];
    ["Offset of field: vm_region_submap_info_64::share_mode"]
        [::std::mem::offset_of!(vm_region_submap_info_64, share_mode) - 47usize];
    ["Offset of field: vm_region_submap_info_64::is_submap"]
        [::std::mem::offset_of!(vm_region_submap_info_64, is_submap) - 48usize];
    ["Offset of field: vm_region_submap_info_64::behavior"]
        [::std::mem::offset_of!(vm_region_submap_info_64, behavior) - 52usize];
    ["Offset of field: vm_region_submap_info_64::object_id"]
        [::std::mem::offset_of!(vm_region_submap_info_64, object_id) - 56usize];
    ["Offset of field: vm_region_submap_info_64::user_wired_count"]
        [::std::mem::offset_of!(vm_region_submap_info_64, user_wired_count) - 60usize];
    ["Offset of field: vm_region_submap_info_64::pages_reusable"]
        [::std::mem::offset_of!(vm_region_submap_info_64, pages_reusable) - 64usize];
    ["Offset of field: vm_region_submap_info_64::object_id_full"]
        [::std::mem::offset_of!(vm_region_submap_info_64, object_id_full) - 68usize];
};
pub type vm_region_submap_info_64_t = *mut vm_region_submap_info_64;
pub type vm_region_submap_info_data_64_t = vm_region_submap_info_64;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct vm_region_submap_short_info_64 {
    pub protection: vm_prot_t,
    pub max_protection: vm_prot_t,
    pub inheritance: vm_inherit_t,
    pub offset: memory_object_offset_t,
    pub user_tag: ::std::os::raw::c_uint,
    pub ref_count: ::std::os::raw::c_uint,
    pub shadow_depth: ::std::os::raw::c_ushort,
    pub external_pager: ::std::os::raw::c_uchar,
    pub share_mode: ::std::os::raw::c_uchar,
    pub is_submap: boolean_t,
    pub behavior: vm_behavior_t,
    pub object_id: vm32_object_id_t,
    pub user_wired_count: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_region_submap_short_info_64"]
        [::std::mem::size_of::<vm_region_submap_short_info_64>() - 48usize];
    ["Alignment of vm_region_submap_short_info_64"]
        [::std::mem::align_of::<vm_region_submap_short_info_64>() - 4usize];
    ["Offset of field: vm_region_submap_short_info_64::protection"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, protection) - 0usize];
    ["Offset of field: vm_region_submap_short_info_64::max_protection"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, max_protection) - 4usize];
    ["Offset of field: vm_region_submap_short_info_64::inheritance"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, inheritance) - 8usize];
    ["Offset of field: vm_region_submap_short_info_64::offset"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, offset) - 12usize];
    ["Offset of field: vm_region_submap_short_info_64::user_tag"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, user_tag) - 20usize];
    ["Offset of field: vm_region_submap_short_info_64::ref_count"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, ref_count) - 24usize];
    ["Offset of field: vm_region_submap_short_info_64::shadow_depth"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, shadow_depth) - 28usize];
    ["Offset of field: vm_region_submap_short_info_64::external_pager"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, external_pager) - 30usize];
    ["Offset of field: vm_region_submap_short_info_64::share_mode"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, share_mode) - 31usize];
    ["Offset of field: vm_region_submap_short_info_64::is_submap"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, is_submap) - 32usize];
    ["Offset of field: vm_region_submap_short_info_64::behavior"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, behavior) - 36usize];
    ["Offset of field: vm_region_submap_short_info_64::object_id"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, object_id) - 40usize];
    ["Offset of field: vm_region_submap_short_info_64::user_wired_count"]
        [::std::mem::offset_of!(vm_region_submap_short_info_64, user_wired_count) - 44usize];
};
pub type vm_region_submap_short_info_64_t = *mut vm_region_submap_short_info_64;
pub type vm_region_submap_short_info_data_64_t = vm_region_submap_short_info_64;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct mach_vm_read_entry {
    pub address: mach_vm_address_t,
    pub size: mach_vm_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_vm_read_entry"][::std::mem::size_of::<mach_vm_read_entry>() - 16usize];
    ["Alignment of mach_vm_read_entry"][::std::mem::align_of::<mach_vm_read_entry>() - 4usize];
    ["Offset of field: mach_vm_read_entry::address"]
        [::std::mem::offset_of!(mach_vm_read_entry, address) - 0usize];
    ["Offset of field: mach_vm_read_entry::size"]
        [::std::mem::offset_of!(mach_vm_read_entry, size) - 8usize];
};
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct vm_read_entry {
    pub address: vm_address_t,
    pub size: vm_size_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_read_entry"][::std::mem::size_of::<vm_read_entry>() - 16usize];
    ["Alignment of vm_read_entry"][::std::mem::align_of::<vm_read_entry>() - 4usize];
    ["Offset of field: vm_read_entry::address"]
        [::std::mem::offset_of!(vm_read_entry, address) - 0usize];
    ["Offset of field: vm_read_entry::size"][::std::mem::offset_of!(vm_read_entry, size) - 8usize];
};
pub type mach_vm_read_entry_t = [mach_vm_read_entry; 256usize];
pub type vm_read_entry_t = [vm_read_entry; 256usize];
pub type vm_page_info_t = *mut ::std::os::raw::c_int;
pub type vm_page_info_data_t = [::std::os::raw::c_int; 0usize];
pub type vm_page_info_flavor_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vm_page_info_basic {
    pub disposition: ::std::os::raw::c_int,
    pub ref_count: ::std::os::raw::c_int,
    pub object_id: vm_object_id_t,
    pub offset: memory_object_offset_t,
    pub depth: ::std::os::raw::c_int,
    pub __pad: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vm_page_info_basic"][::std::mem::size_of::<vm_page_info_basic>() - 32usize];
    ["Alignment of vm_page_info_basic"][::std::mem::align_of::<vm_page_info_basic>() - 8usize];
    ["Offset of field: vm_page_info_basic::disposition"]
        [::std::mem::offset_of!(vm_page_info_basic, disposition) - 0usize];
    ["Offset of field: vm_page_info_basic::ref_count"]
        [::std::mem::offset_of!(vm_page_info_basic, ref_count) - 4usize];
    ["Offset of field: vm_page_info_basic::object_id"]
        [::std::mem::offset_of!(vm_page_info_basic, object_id) - 8usize];
    ["Offset of field: vm_page_info_basic::offset"]
        [::std::mem::offset_of!(vm_page_info_basic, offset) - 16usize];
    ["Offset of field: vm_page_info_basic::depth"]
        [::std::mem::offset_of!(vm_page_info_basic, depth) - 24usize];
    ["Offset of field: vm_page_info_basic::__pad"]
        [::std::mem::offset_of!(vm_page_info_basic, __pad) - 28usize];
};
pub type vm_page_info_basic_t = *mut vm_page_info_basic;
pub type vm_page_info_basic_data_t = vm_page_info_basic;
pub type kmod_t = ::std::os::raw::c_int;
pub type kmod_start_func_t = ::std::option::Option<
    unsafe extern "C" fn(ki: *mut kmod_info, data: *mut ::std::os::raw::c_void) -> kern_return_t,
>;
pub type kmod_stop_func_t = ::std::option::Option<
    unsafe extern "C" fn(ki: *mut kmod_info, data: *mut ::std::os::raw::c_void) -> kern_return_t,
>;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct kmod_reference {
    pub next: *mut kmod_reference,
    pub info: *mut kmod_info,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kmod_reference"][::std::mem::size_of::<kmod_reference>() - 16usize];
    ["Alignment of kmod_reference"][::std::mem::align_of::<kmod_reference>() - 4usize];
    ["Offset of field: kmod_reference::next"]
        [::std::mem::offset_of!(kmod_reference, next) - 0usize];
    ["Offset of field: kmod_reference::info"]
        [::std::mem::offset_of!(kmod_reference, info) - 8usize];
};
pub type kmod_reference_t = kmod_reference;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct kmod_info {
    pub next: *mut kmod_info,
    pub info_version: i32,
    pub id: u32,
    pub name: [::std::os::raw::c_char; 64usize],
    pub version: [::std::os::raw::c_char; 64usize],
    pub reference_count: i32,
    pub reference_list: *mut kmod_reference_t,
    pub address: vm_address_t,
    pub size: vm_size_t,
    pub hdr_size: vm_size_t,
    pub start: kmod_start_func_t,
    pub stop: kmod_stop_func_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kmod_info"][::std::mem::size_of::<kmod_info>() - 196usize];
    ["Alignment of kmod_info"][::std::mem::align_of::<kmod_info>() - 4usize];
    ["Offset of field: kmod_info::next"][::std::mem::offset_of!(kmod_info, next) - 0usize];
    ["Offset of field: kmod_info::info_version"]
        [::std::mem::offset_of!(kmod_info, info_version) - 8usize];
    ["Offset of field: kmod_info::id"][::std::mem::offset_of!(kmod_info, id) - 12usize];
    ["Offset of field: kmod_info::name"][::std::mem::offset_of!(kmod_info, name) - 16usize];
    ["Offset of field: kmod_info::version"][::std::mem::offset_of!(kmod_info, version) - 80usize];
    ["Offset of field: kmod_info::reference_count"]
        [::std::mem::offset_of!(kmod_info, reference_count) - 144usize];
    ["Offset of field: kmod_info::reference_list"]
        [::std::mem::offset_of!(kmod_info, reference_list) - 148usize];
    ["Offset of field: kmod_info::address"][::std::mem::offset_of!(kmod_info, address) - 156usize];
    ["Offset of field: kmod_info::size"][::std::mem::offset_of!(kmod_info, size) - 164usize];
    ["Offset of field: kmod_info::hdr_size"]
        [::std::mem::offset_of!(kmod_info, hdr_size) - 172usize];
    ["Offset of field: kmod_info::start"][::std::mem::offset_of!(kmod_info, start) - 180usize];
    ["Offset of field: kmod_info::stop"][::std::mem::offset_of!(kmod_info, stop) - 188usize];
};
pub type kmod_info_t = kmod_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kmod_info_32_v1 {
    pub next_addr: u32,
    pub info_version: i32,
    pub id: u32,
    pub name: [u8; 64usize],
    pub version: [u8; 64usize],
    pub reference_count: i32,
    pub reference_list_addr: u32,
    pub address: u32,
    pub size: u32,
    pub hdr_size: u32,
    pub start_addr: u32,
    pub stop_addr: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kmod_info_32_v1"][::std::mem::size_of::<kmod_info_32_v1>() - 168usize];
    ["Alignment of kmod_info_32_v1"][::std::mem::align_of::<kmod_info_32_v1>() - 4usize];
    ["Offset of field: kmod_info_32_v1::next_addr"]
        [::std::mem::offset_of!(kmod_info_32_v1, next_addr) - 0usize];
    ["Offset of field: kmod_info_32_v1::info_version"]
        [::std::mem::offset_of!(kmod_info_32_v1, info_version) - 4usize];
    ["Offset of field: kmod_info_32_v1::id"][::std::mem::offset_of!(kmod_info_32_v1, id) - 8usize];
    ["Offset of field: kmod_info_32_v1::name"]
        [::std::mem::offset_of!(kmod_info_32_v1, name) - 12usize];
    ["Offset of field: kmod_info_32_v1::version"]
        [::std::mem::offset_of!(kmod_info_32_v1, version) - 76usize];
    ["Offset of field: kmod_info_32_v1::reference_count"]
        [::std::mem::offset_of!(kmod_info_32_v1, reference_count) - 140usize];
    ["Offset of field: kmod_info_32_v1::reference_list_addr"]
        [::std::mem::offset_of!(kmod_info_32_v1, reference_list_addr) - 144usize];
    ["Offset of field: kmod_info_32_v1::address"]
        [::std::mem::offset_of!(kmod_info_32_v1, address) - 148usize];
    ["Offset of field: kmod_info_32_v1::size"]
        [::std::mem::offset_of!(kmod_info_32_v1, size) - 152usize];
    ["Offset of field: kmod_info_32_v1::hdr_size"]
        [::std::mem::offset_of!(kmod_info_32_v1, hdr_size) - 156usize];
    ["Offset of field: kmod_info_32_v1::start_addr"]
        [::std::mem::offset_of!(kmod_info_32_v1, start_addr) - 160usize];
    ["Offset of field: kmod_info_32_v1::stop_addr"]
        [::std::mem::offset_of!(kmod_info_32_v1, stop_addr) - 164usize];
};
pub type kmod_info_32_v1_t = kmod_info_32_v1;
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct kmod_info_64_v1 {
    pub next_addr: u64,
    pub info_version: i32,
    pub id: u32,
    pub name: [u8; 64usize],
    pub version: [u8; 64usize],
    pub reference_count: i32,
    pub reference_list_addr: u64,
    pub address: u64,
    pub size: u64,
    pub hdr_size: u64,
    pub start_addr: u64,
    pub stop_addr: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kmod_info_64_v1"][::std::mem::size_of::<kmod_info_64_v1>() - 196usize];
    ["Alignment of kmod_info_64_v1"][::std::mem::align_of::<kmod_info_64_v1>() - 4usize];
    ["Offset of field: kmod_info_64_v1::next_addr"]
        [::std::mem::offset_of!(kmod_info_64_v1, next_addr) - 0usize];
    ["Offset of field: kmod_info_64_v1::info_version"]
        [::std::mem::offset_of!(kmod_info_64_v1, info_version) - 8usize];
    ["Offset of field: kmod_info_64_v1::id"][::std::mem::offset_of!(kmod_info_64_v1, id) - 12usize];
    ["Offset of field: kmod_info_64_v1::name"]
        [::std::mem::offset_of!(kmod_info_64_v1, name) - 16usize];
    ["Offset of field: kmod_info_64_v1::version"]
        [::std::mem::offset_of!(kmod_info_64_v1, version) - 80usize];
    ["Offset of field: kmod_info_64_v1::reference_count"]
        [::std::mem::offset_of!(kmod_info_64_v1, reference_count) - 144usize];
    ["Offset of field: kmod_info_64_v1::reference_list_addr"]
        [::std::mem::offset_of!(kmod_info_64_v1, reference_list_addr) - 148usize];
    ["Offset of field: kmod_info_64_v1::address"]
        [::std::mem::offset_of!(kmod_info_64_v1, address) - 156usize];
    ["Offset of field: kmod_info_64_v1::size"]
        [::std::mem::offset_of!(kmod_info_64_v1, size) - 164usize];
    ["Offset of field: kmod_info_64_v1::hdr_size"]
        [::std::mem::offset_of!(kmod_info_64_v1, hdr_size) - 172usize];
    ["Offset of field: kmod_info_64_v1::start_addr"]
        [::std::mem::offset_of!(kmod_info_64_v1, start_addr) - 180usize];
    ["Offset of field: kmod_info_64_v1::stop_addr"]
        [::std::mem::offset_of!(kmod_info_64_v1, stop_addr) - 188usize];
};
pub type kmod_info_64_v1_t = kmod_info_64_v1;
pub type kmod_args_t = *mut ::std::os::raw::c_void;
pub type kmod_control_flavor_t = ::std::os::raw::c_int;
pub type kmod_info_array_t = *mut kmod_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fsid {
    pub val: [i32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fsid"][::std::mem::size_of::<fsid>() - 8usize];
    ["Alignment of fsid"][::std::mem::align_of::<fsid>() - 4usize];
    ["Offset of field: fsid::val"][::std::mem::offset_of!(fsid, val) - 0usize];
};
pub type fsid_t = fsid;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fsobj_id {
    pub fid_objno: u_int32_t,
    pub fid_generation: u_int32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fsobj_id"][::std::mem::size_of::<fsobj_id>() - 8usize];
    ["Alignment of fsobj_id"][::std::mem::align_of::<fsobj_id>() - 4usize];
    ["Offset of field: fsobj_id::fid_objno"][::std::mem::offset_of!(fsobj_id, fid_objno) - 0usize];
    ["Offset of field: fsobj_id::fid_generation"]
        [::std::mem::offset_of!(fsobj_id, fid_generation) - 4usize];
};
pub type fsobj_id_t = fsobj_id;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dyld_kernel_image_info {
    pub uuid: uuid_t,
    pub fsobjid: fsobj_id_t,
    pub fsid: fsid_t,
    pub load_addr: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dyld_kernel_image_info"][::std::mem::size_of::<dyld_kernel_image_info>() - 40usize];
    ["Alignment of dyld_kernel_image_info"]
        [::std::mem::align_of::<dyld_kernel_image_info>() - 8usize];
    ["Offset of field: dyld_kernel_image_info::uuid"]
        [::std::mem::offset_of!(dyld_kernel_image_info, uuid) - 0usize];
    ["Offset of field: dyld_kernel_image_info::fsobjid"]
        [::std::mem::offset_of!(dyld_kernel_image_info, fsobjid) - 16usize];
    ["Offset of field: dyld_kernel_image_info::fsid"]
        [::std::mem::offset_of!(dyld_kernel_image_info, fsid) - 24usize];
    ["Offset of field: dyld_kernel_image_info::load_addr"]
        [::std::mem::offset_of!(dyld_kernel_image_info, load_addr) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dyld_kernel_process_info {
    pub cache_image_info: dyld_kernel_image_info,
    pub timestamp: u64,
    pub imageCount: u32,
    pub initialImageCount: u32,
    pub dyldState: u8,
    pub no_cache: boolean_t,
    pub private_cache: boolean_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dyld_kernel_process_info"]
        [::std::mem::size_of::<dyld_kernel_process_info>() - 72usize];
    ["Alignment of dyld_kernel_process_info"]
        [::std::mem::align_of::<dyld_kernel_process_info>() - 8usize];
    ["Offset of field: dyld_kernel_process_info::cache_image_info"]
        [::std::mem::offset_of!(dyld_kernel_process_info, cache_image_info) - 0usize];
    ["Offset of field: dyld_kernel_process_info::timestamp"]
        [::std::mem::offset_of!(dyld_kernel_process_info, timestamp) - 40usize];
    ["Offset of field: dyld_kernel_process_info::imageCount"]
        [::std::mem::offset_of!(dyld_kernel_process_info, imageCount) - 48usize];
    ["Offset of field: dyld_kernel_process_info::initialImageCount"]
        [::std::mem::offset_of!(dyld_kernel_process_info, initialImageCount) - 52usize];
    ["Offset of field: dyld_kernel_process_info::dyldState"]
        [::std::mem::offset_of!(dyld_kernel_process_info, dyldState) - 56usize];
    ["Offset of field: dyld_kernel_process_info::no_cache"]
        [::std::mem::offset_of!(dyld_kernel_process_info, no_cache) - 60usize];
    ["Offset of field: dyld_kernel_process_info::private_cache"]
        [::std::mem::offset_of!(dyld_kernel_process_info, private_cache) - 64usize];
};
pub type dyld_kernel_image_info_t = dyld_kernel_image_info;
pub type dyld_kernel_process_info_t = dyld_kernel_process_info;
pub type dyld_kernel_image_info_array_t = *mut dyld_kernel_image_info_t;
pub type task_t = mach_port_t;
pub type task_name_t = mach_port_t;
pub type task_policy_set_t = mach_port_t;
pub type task_policy_get_t = mach_port_t;
pub type task_inspect_t = mach_port_t;
pub type task_read_t = mach_port_t;
pub type task_suspension_token_t = mach_port_t;
pub type thread_t = mach_port_t;
pub type thread_act_t = mach_port_t;
pub type thread_inspect_t = mach_port_t;
pub type thread_read_t = mach_port_t;
pub type ipc_space_t = mach_port_t;
pub type ipc_space_read_t = mach_port_t;
pub type ipc_space_inspect_t = mach_port_t;
pub type coalition_t = mach_port_t;
pub type host_t = mach_port_t;
pub type host_priv_t = mach_port_t;
pub type host_security_t = mach_port_t;
pub type processor_t = mach_port_t;
pub type processor_set_t = mach_port_t;
pub type processor_set_control_t = mach_port_t;
pub type semaphore_t = mach_port_t;
pub type lock_set_t = mach_port_t;
pub type ledger_t = mach_port_t;
pub type alarm_t = mach_port_t;
pub type clock_serv_t = mach_port_t;
pub type clock_ctrl_t = mach_port_t;
pub type arcade_register_t = mach_port_t;
pub type ipc_eventlink_t = mach_port_t;
pub type eventlink_port_pair_t = [mach_port_t; 2usize];
pub type task_id_token_t = mach_port_t;
pub type kcdata_object_t = mach_port_t;
pub type processor_set_name_t = processor_set_t;
pub type clock_reply_t = mach_port_t;
pub type bootstrap_t = mach_port_t;
pub type mem_entry_name_port_t = mach_port_t;
pub type exception_handler_t = mach_port_t;
pub type exception_handler_array_t = *mut exception_handler_t;
pub type vm_task_entry_t = mach_port_t;
pub type io_main_t = mach_port_t;
pub type UNDServerRef = mach_port_t;
pub type mach_eventlink_t = mach_port_t;
pub type exception_handler_info_t = ipc_info_port_t;
pub type task_array_t = *mut task_t;
pub type thread_array_t = *mut thread_t;
pub type processor_set_array_t = *mut processor_set_t;
pub type processor_set_name_array_t = *mut processor_set_t;
pub type processor_array_t = *mut processor_t;
pub type thread_act_array_t = *mut thread_act_t;
pub type ledger_array_t = *mut ledger_t;
pub type task_port_t = task_t;
pub type task_port_array_t = task_array_t;
pub type thread_port_t = thread_t;
pub type thread_port_array_t = thread_array_t;
pub type ipc_space_port_t = ipc_space_t;
pub type host_name_t = host_t;
pub type host_name_port_t = host_t;
pub type processor_set_port_t = processor_set_t;
pub type processor_set_name_port_t = processor_set_t;
pub type processor_set_name_port_array_t = processor_set_array_t;
pub type processor_set_control_port_t = processor_set_t;
pub type processor_port_t = processor_t;
pub type processor_port_array_t = processor_array_t;
pub type thread_act_port_t = thread_act_t;
pub type thread_act_port_array_t = thread_act_array_t;
pub type semaphore_port_t = semaphore_t;
pub type lock_set_port_t = lock_set_t;
pub type ledger_port_t = ledger_t;
pub type ledger_port_array_t = ledger_array_t;
pub type alarm_port_t = alarm_t;
pub type clock_serv_port_t = clock_serv_t;
pub type clock_ctrl_port_t = clock_ctrl_t;
pub type exception_port_t = exception_handler_t;
pub type exception_port_arrary_t = exception_handler_array_t;
pub type vfs_path_t = [::std::os::raw::c_char; 4096usize];
pub type nspace_path_t = [::std::os::raw::c_char; 8192usize];
pub type nspace_name_t = [::std::os::raw::c_char; 8192usize];
pub type mach_task_flavor_t = ::std::os::raw::c_uint;
pub type mach_thread_flavor_t = ::std::os::raw::c_uint;
pub type ledger_item_t = natural_t;
pub type ledger_amount_t = i64;
pub type emulation_vector_t = *mut mach_vm_offset_t;
pub type user_subsystem_t = *mut ::std::os::raw::c_char;
pub type labelstr_t = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(
        __dst: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dst: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __len: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __b: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __len: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcat(
        __s1: *mut ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcpy(
        __dst: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __charset: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strncat(
        __s1: *mut ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncpy(
        __dst: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __charset: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __charset: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strstr(
        __big: *const ::std::os::raw::c_char,
        __little: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __str: *mut ::std::os::raw::c_char,
        __sep: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strxfrm(
        __s1: *mut ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtok_r(
        __str: *mut ::std::os::raw::c_char,
        __sep: *const ::std::os::raw::c_char,
        __lasts: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __strerrbuf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strdup(__s1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn memccpy(
        __dst: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn stpcpy(
        __dst: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dst: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __s1: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnlen(__s1: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
pub type errno_t = ::std::os::raw::c_int;
extern "C" {
    pub fn memset_s(
        __s: *mut ::std::os::raw::c_void,
        __smax: rsize_t,
        __c: ::std::os::raw::c_int,
        __n: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn memmem(
        __big: *const ::std::os::raw::c_void,
        __big_len: usize,
        __little: *const ::std::os::raw::c_void,
        __little_len: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset_pattern4(
        __b: *mut ::std::os::raw::c_void,
        __pattern4: *const ::std::os::raw::c_void,
        __len: usize,
    );
}
extern "C" {
    pub fn memset_pattern8(
        __b: *mut ::std::os::raw::c_void,
        __pattern8: *const ::std::os::raw::c_void,
        __len: usize,
    );
}
extern "C" {
    pub fn memset_pattern16(
        __b: *mut ::std::os::raw::c_void,
        __pattern16: *const ::std::os::raw::c_void,
        __len: usize,
    );
}
extern "C" {
    pub fn strcasestr(
        __big: *const ::std::os::raw::c_char,
        __little: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnstr(
        __big: *const ::std::os::raw::c_char,
        __little: *const ::std::os::raw::c_char,
        __len: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlcat(
        __dst: *mut ::std::os::raw::c_char,
        __source: *const ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strlcpy(
        __dst: *mut ::std::os::raw::c_char,
        __source: *const ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strmode(__mode: ::std::os::raw::c_int, __bp: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn timingsafe_bcmp(
        __b1: *const ::std::os::raw::c_void,
        __b2: *const ::std::os::raw::c_void,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strsignal_r(
        __sig: ::std::os::raw::c_int,
        __strsignalbuf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
    );
}
extern "C" {
    pub fn bzero(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fls(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flsl(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flsll(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _OSUnalignedU16 {
    pub __val: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OSUnalignedU16"][::std::mem::size_of::<_OSUnalignedU16>() - 2usize];
    ["Alignment of _OSUnalignedU16"][::std::mem::align_of::<_OSUnalignedU16>() - 1usize];
    ["Offset of field: _OSUnalignedU16::__val"]
        [::std::mem::offset_of!(_OSUnalignedU16, __val) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _OSUnalignedU32 {
    pub __val: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OSUnalignedU32"][::std::mem::size_of::<_OSUnalignedU32>() - 4usize];
    ["Alignment of _OSUnalignedU32"][::std::mem::align_of::<_OSUnalignedU32>() - 1usize];
    ["Offset of field: _OSUnalignedU32::__val"]
        [::std::mem::offset_of!(_OSUnalignedU32, __val) - 0usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _OSUnalignedU64 {
    pub __val: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OSUnalignedU64"][::std::mem::size_of::<_OSUnalignedU64>() - 8usize];
    ["Alignment of _OSUnalignedU64"][::std::mem::align_of::<_OSUnalignedU64>() - 1usize];
    ["Offset of field: _OSUnalignedU64::__val"]
        [::std::mem::offset_of!(_OSUnalignedU64, __val) - 0usize];
};
pub const OSUnknownByteOrder: _bindgen_ty_1 = 0;
pub const OSLittleEndian: _bindgen_ty_1 = 1;
pub const OSBigEndian: _bindgen_ty_1 = 2;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NDR_record_t {
    pub mig_vers: ::std::os::raw::c_uchar,
    pub if_vers: ::std::os::raw::c_uchar,
    pub reserved1: ::std::os::raw::c_uchar,
    pub mig_encoding: ::std::os::raw::c_uchar,
    pub int_rep: ::std::os::raw::c_uchar,
    pub char_rep: ::std::os::raw::c_uchar,
    pub float_rep: ::std::os::raw::c_uchar,
    pub reserved2: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NDR_record_t"][::std::mem::size_of::<NDR_record_t>() - 8usize];
    ["Alignment of NDR_record_t"][::std::mem::align_of::<NDR_record_t>() - 1usize];
    ["Offset of field: NDR_record_t::mig_vers"]
        [::std::mem::offset_of!(NDR_record_t, mig_vers) - 0usize];
    ["Offset of field: NDR_record_t::if_vers"]
        [::std::mem::offset_of!(NDR_record_t, if_vers) - 1usize];
    ["Offset of field: NDR_record_t::reserved1"]
        [::std::mem::offset_of!(NDR_record_t, reserved1) - 2usize];
    ["Offset of field: NDR_record_t::mig_encoding"]
        [::std::mem::offset_of!(NDR_record_t, mig_encoding) - 3usize];
    ["Offset of field: NDR_record_t::int_rep"]
        [::std::mem::offset_of!(NDR_record_t, int_rep) - 4usize];
    ["Offset of field: NDR_record_t::char_rep"]
        [::std::mem::offset_of!(NDR_record_t, char_rep) - 5usize];
    ["Offset of field: NDR_record_t::float_rep"]
        [::std::mem::offset_of!(NDR_record_t, float_rep) - 6usize];
    ["Offset of field: NDR_record_t::reserved2"]
        [::std::mem::offset_of!(NDR_record_t, reserved2) - 7usize];
};
extern "C" {
    pub static mut NDR_record: NDR_record_t;
}
pub type notify_port_t = mach_port_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_port_deleted_notification_t {
    pub not_header: mach_msg_header_t,
    pub NDR: NDR_record_t,
    pub not_port: mach_port_name_t,
    pub trailer: mach_msg_format_0_trailer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_port_deleted_notification_t"]
        [::std::mem::size_of::<mach_port_deleted_notification_t>() - 56usize];
    ["Alignment of mach_port_deleted_notification_t"]
        [::std::mem::align_of::<mach_port_deleted_notification_t>() - 4usize];
    ["Offset of field: mach_port_deleted_notification_t::not_header"]
        [::std::mem::offset_of!(mach_port_deleted_notification_t, not_header) - 0usize];
    ["Offset of field: mach_port_deleted_notification_t::NDR"]
        [::std::mem::offset_of!(mach_port_deleted_notification_t, NDR) - 24usize];
    ["Offset of field: mach_port_deleted_notification_t::not_port"]
        [::std::mem::offset_of!(mach_port_deleted_notification_t, not_port) - 32usize];
    ["Offset of field: mach_port_deleted_notification_t::trailer"]
        [::std::mem::offset_of!(mach_port_deleted_notification_t, trailer) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_send_possible_notification_t {
    pub not_header: mach_msg_header_t,
    pub NDR: NDR_record_t,
    pub not_port: mach_port_name_t,
    pub trailer: mach_msg_format_0_trailer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_send_possible_notification_t"]
        [::std::mem::size_of::<mach_send_possible_notification_t>() - 56usize];
    ["Alignment of mach_send_possible_notification_t"]
        [::std::mem::align_of::<mach_send_possible_notification_t>() - 4usize];
    ["Offset of field: mach_send_possible_notification_t::not_header"]
        [::std::mem::offset_of!(mach_send_possible_notification_t, not_header) - 0usize];
    ["Offset of field: mach_send_possible_notification_t::NDR"]
        [::std::mem::offset_of!(mach_send_possible_notification_t, NDR) - 24usize];
    ["Offset of field: mach_send_possible_notification_t::not_port"]
        [::std::mem::offset_of!(mach_send_possible_notification_t, not_port) - 32usize];
    ["Offset of field: mach_send_possible_notification_t::trailer"]
        [::std::mem::offset_of!(mach_send_possible_notification_t, trailer) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_port_destroyed_notification_t {
    pub not_header: mach_msg_header_t,
    pub not_body: mach_msg_body_t,
    pub not_port: mach_msg_port_descriptor_t,
    pub trailer: mach_msg_format_0_trailer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_port_destroyed_notification_t"]
        [::std::mem::size_of::<mach_port_destroyed_notification_t>() - 60usize];
    ["Alignment of mach_port_destroyed_notification_t"]
        [::std::mem::align_of::<mach_port_destroyed_notification_t>() - 4usize];
    ["Offset of field: mach_port_destroyed_notification_t::not_header"]
        [::std::mem::offset_of!(mach_port_destroyed_notification_t, not_header) - 0usize];
    ["Offset of field: mach_port_destroyed_notification_t::not_body"]
        [::std::mem::offset_of!(mach_port_destroyed_notification_t, not_body) - 24usize];
    ["Offset of field: mach_port_destroyed_notification_t::not_port"]
        [::std::mem::offset_of!(mach_port_destroyed_notification_t, not_port) - 28usize];
    ["Offset of field: mach_port_destroyed_notification_t::trailer"]
        [::std::mem::offset_of!(mach_port_destroyed_notification_t, trailer) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_no_senders_notification_t {
    pub not_header: mach_msg_header_t,
    pub NDR: NDR_record_t,
    pub not_count: mach_msg_type_number_t,
    pub trailer: mach_msg_format_0_trailer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_no_senders_notification_t"]
        [::std::mem::size_of::<mach_no_senders_notification_t>() - 56usize];
    ["Alignment of mach_no_senders_notification_t"]
        [::std::mem::align_of::<mach_no_senders_notification_t>() - 4usize];
    ["Offset of field: mach_no_senders_notification_t::not_header"]
        [::std::mem::offset_of!(mach_no_senders_notification_t, not_header) - 0usize];
    ["Offset of field: mach_no_senders_notification_t::NDR"]
        [::std::mem::offset_of!(mach_no_senders_notification_t, NDR) - 24usize];
    ["Offset of field: mach_no_senders_notification_t::not_count"]
        [::std::mem::offset_of!(mach_no_senders_notification_t, not_count) - 32usize];
    ["Offset of field: mach_no_senders_notification_t::trailer"]
        [::std::mem::offset_of!(mach_no_senders_notification_t, trailer) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_send_once_notification_t {
    pub not_header: mach_msg_header_t,
    pub trailer: mach_msg_format_0_trailer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_send_once_notification_t"]
        [::std::mem::size_of::<mach_send_once_notification_t>() - 44usize];
    ["Alignment of mach_send_once_notification_t"]
        [::std::mem::align_of::<mach_send_once_notification_t>() - 4usize];
    ["Offset of field: mach_send_once_notification_t::not_header"]
        [::std::mem::offset_of!(mach_send_once_notification_t, not_header) - 0usize];
    ["Offset of field: mach_send_once_notification_t::trailer"]
        [::std::mem::offset_of!(mach_send_once_notification_t, trailer) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mach_dead_name_notification_t {
    pub not_header: mach_msg_header_t,
    pub NDR: NDR_record_t,
    pub not_port: mach_port_name_t,
    pub trailer: mach_msg_format_0_trailer_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mach_dead_name_notification_t"]
        [::std::mem::size_of::<mach_dead_name_notification_t>() - 56usize];
    ["Alignment of mach_dead_name_notification_t"]
        [::std::mem::align_of::<mach_dead_name_notification_t>() - 4usize];
    ["Offset of field: mach_dead_name_notification_t::not_header"]
        [::std::mem::offset_of!(mach_dead_name_notification_t, not_header) - 0usize];
    ["Offset of field: mach_dead_name_notification_t::NDR"]
        [::std::mem::offset_of!(mach_dead_name_notification_t, NDR) - 24usize];
    ["Offset of field: mach_dead_name_notification_t::not_port"]
        [::std::mem::offset_of!(mach_dead_name_notification_t, not_port) - 32usize];
    ["Offset of field: mach_dead_name_notification_t::trailer"]
        [::std::mem::offset_of!(mach_dead_name_notification_t, trailer) - 36usize];
};
pub type mig_stub_routine_t = ::std::option::Option<
    unsafe extern "C" fn(InHeadP: *mut mach_msg_header_t, OutHeadP: *mut mach_msg_header_t),
>;
pub type mig_routine_t = mig_stub_routine_t;
pub type mig_server_routine_t =
    ::std::option::Option<unsafe extern "C" fn(InHeadP: *mut mach_msg_header_t) -> mig_routine_t>;
pub type mig_impl_routine_t = ::std::option::Option<unsafe extern "C" fn() -> kern_return_t>;
pub type routine_arg_descriptor = mach_msg_type_descriptor_t;
pub type routine_arg_descriptor_t = *mut mach_msg_type_descriptor_t;
pub type mig_routine_arg_descriptor_t = *mut mach_msg_type_descriptor_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct routine_descriptor {
    pub impl_routine: mig_impl_routine_t,
    pub stub_routine: mig_stub_routine_t,
    pub argc: ::std::os::raw::c_uint,
    pub descr_count: ::std::os::raw::c_uint,
    pub arg_descr: routine_arg_descriptor_t,
    pub max_reply_msg: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of routine_descriptor"][::std::mem::size_of::<routine_descriptor>() - 40usize];
    ["Alignment of routine_descriptor"][::std::mem::align_of::<routine_descriptor>() - 8usize];
    ["Offset of field: routine_descriptor::impl_routine"]
        [::std::mem::offset_of!(routine_descriptor, impl_routine) - 0usize];
    ["Offset of field: routine_descriptor::stub_routine"]
        [::std::mem::offset_of!(routine_descriptor, stub_routine) - 8usize];
    ["Offset of field: routine_descriptor::argc"]
        [::std::mem::offset_of!(routine_descriptor, argc) - 16usize];
    ["Offset of field: routine_descriptor::descr_count"]
        [::std::mem::offset_of!(routine_descriptor, descr_count) - 20usize];
    ["Offset of field: routine_descriptor::arg_descr"]
        [::std::mem::offset_of!(routine_descriptor, arg_descr) - 24usize];
    ["Offset of field: routine_descriptor::max_reply_msg"]
        [::std::mem::offset_of!(routine_descriptor, max_reply_msg) - 32usize];
};
pub type routine_descriptor_t = *mut routine_descriptor;
pub type mig_routine_descriptor = routine_descriptor;
pub type mig_routine_descriptor_t = *mut mig_routine_descriptor;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mig_subsystem {
    pub server: mig_server_routine_t,
    pub start: mach_msg_id_t,
    pub end: mach_msg_id_t,
    pub maxsize: mach_msg_size_t,
    pub reserved: vm_address_t,
    pub routine: [mig_routine_descriptor; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mig_subsystem"][::std::mem::size_of::<mig_subsystem>() - 72usize];
    ["Alignment of mig_subsystem"][::std::mem::align_of::<mig_subsystem>() - 8usize];
    ["Offset of field: mig_subsystem::server"]
        [::std::mem::offset_of!(mig_subsystem, server) - 0usize];
    ["Offset of field: mig_subsystem::start"]
        [::std::mem::offset_of!(mig_subsystem, start) - 8usize];
    ["Offset of field: mig_subsystem::end"][::std::mem::offset_of!(mig_subsystem, end) - 12usize];
    ["Offset of field: mig_subsystem::maxsize"]
        [::std::mem::offset_of!(mig_subsystem, maxsize) - 16usize];
    ["Offset of field: mig_subsystem::reserved"]
        [::std::mem::offset_of!(mig_subsystem, reserved) - 24usize];
    ["Offset of field: mig_subsystem::routine"]
        [::std::mem::offset_of!(mig_subsystem, routine) - 32usize];
};
pub type mig_subsystem_t = *mut mig_subsystem;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mig_symtab {
    pub ms_routine_name: *mut ::std::os::raw::c_char,
    pub ms_routine_number: ::std::os::raw::c_int,
    pub ms_routine: ::std::option::Option<unsafe extern "C" fn()>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mig_symtab"][::std::mem::size_of::<mig_symtab>() - 24usize];
    ["Alignment of mig_symtab"][::std::mem::align_of::<mig_symtab>() - 8usize];
    ["Offset of field: mig_symtab::ms_routine_name"]
        [::std::mem::offset_of!(mig_symtab, ms_routine_name) - 0usize];
    ["Offset of field: mig_symtab::ms_routine_number"]
        [::std::mem::offset_of!(mig_symtab, ms_routine_number) - 8usize];
    ["Offset of field: mig_symtab::ms_routine"]
        [::std::mem::offset_of!(mig_symtab, ms_routine) - 16usize];
};
pub type mig_symtab_t = mig_symtab;
extern "C" {
    pub fn mig_get_reply_port() -> mach_port_t;
}
extern "C" {
    pub fn mig_dealloc_reply_port(reply_port: mach_port_t);
}
extern "C" {
    pub fn mig_put_reply_port(reply_port: mach_port_t);
}
extern "C" {
    pub fn mig_strncpy(
        dest: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mig_strncpy_zerofill(
        dest: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mig_allocate(arg1: *mut vm_address_t, arg2: vm_size_t);
}
extern "C" {
    pub fn mig_deallocate(arg1: vm_address_t, arg2: vm_size_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mig_reply_error_t {
    pub Head: mach_msg_header_t,
    pub NDR: NDR_record_t,
    pub RetCode: kern_return_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mig_reply_error_t"][::std::mem::size_of::<mig_reply_error_t>() - 36usize];
    ["Alignment of mig_reply_error_t"][::std::mem::align_of::<mig_reply_error_t>() - 4usize];
    ["Offset of field: mig_reply_error_t::Head"]
        [::std::mem::offset_of!(mig_reply_error_t, Head) - 0usize];
    ["Offset of field: mig_reply_error_t::NDR"]
        [::std::mem::offset_of!(mig_reply_error_t, NDR) - 24usize];
    ["Offset of field: mig_reply_error_t::RetCode"]
        [::std::mem::offset_of!(mig_reply_error_t, RetCode) - 32usize];
};
extern "C" {
    pub fn clock_set_time(clock_ctrl: clock_ctrl_t, new_time: mach_timespec_t) -> kern_return_t;
}
extern "C" {
    pub fn clock_set_attributes(
        clock_ctrl: clock_ctrl_t,
        flavor: clock_flavor_t,
        clock_attr: clock_attr_t,
        clock_attrCnt: mach_msg_type_number_t,
    ) -> kern_return_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __Request__clock_set_time_t {
    pub Head: mach_msg_header_t,
    pub NDR: NDR_record_t,
    pub new_time: mach_timespec_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __Request__clock_set_time_t"]
        [::std::mem::size_of::<__Request__clock_set_time_t>() - 40usize];
    ["Alignment of __Request__clock_set_time_t"]
        [::std::mem::align_of::<__Request__clock_set_time_t>() - 4usize];
    ["Offset of field: __Request__clock_set_time_t::Head"]
        [::std::mem::offset_of!(__Request__clock_set_time_t, Head) - 0usize];
    ["Offset of field: __Request__clock_set_time_t::NDR"]
        [::std::mem::offset_of!(__Request__clock_set_time_t, NDR) - 24usize];
    ["Offset of field: __Request__clock_set_time_t::new_time"]
